J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>HP_PROCONP04</name>
					<description>PFLASH Bank 0 Protection Configuration 4</description>
					<addressOffset>0x10010</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S128L</name>
							<description>PFLASH p Sector 128 Locked for Write Protection - S128L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S129L</name>
							<description>PFLASH p Sector 129 Locked for Write Protection - S129L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S130L</name>
							<description>PFLASH p Sector 130 Locked for Write Protection - S130L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S131L</name>
							<description>PFLASH p Sector 131 Locked for Write Protection - S131L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S132L</name>
							<description>PFLASH p Sector 132 Locked for Write Protection - S132L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S133L</name>
							<description>PFLASH p Sector 133 Locked for Write Protection - S133L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S134L</name>
							<description>PFLASH p Sector 134 Locked for Write Protection - S134L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S135L</name>
							<description>PFLASH p Sector 135 Locked for Write Protection - S135L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S136L</name>
							<description>PFLASH p Sector 136 Locked for Write Protection - S136L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S137L</name>
							<description>PFLASH p Sector 137 Locked for Write Protection - S137L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S138L</name>
							<description>PFLASH p Sector 138 Locked for Write Protection - S138L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S139L</name>
							<description>PFLASH p Sector 139 Locked for Write Protection - S139L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S140L</name>
							<description>PFLASH p Sector 140 Locked for Write Protection - S140L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S141L</name>
							<description>PFLASH p Sector 141 Locked for Write Protection - S141L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S142L</name>
							<description>PFLASH p Sector 142 Locked for Write Protection - S142L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S143L</name>
							<description>PFLASH p Sector 143 Locked for Write Protection - S143L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S144L</name>
							<description>PFLASH p Sector 144 Locked for Write Protection - S144L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S145L</name>
							<description>PFLASH p Sector 145 Locked for Write Protection - S145L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S146L</name>
							<description>PFLASH p Sector 146 Locked for Write Protection - S146L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S147L</name>
							<description>PFLASH p Sector 147 Locked for Write Protection - S147L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S148L</name>
							<description>PFLASH p Sector 148 Locked for Write Protection - S148L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S149L</name>
							<description>PFLASH p Sector 149 Locked for Write Protection - S149L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S150L</name>
							<description>PFLASH p Sector 150 Locked for Write Protection - S150L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S151L</name>
							<description>PFLASH p Sector 151 Locked for Write Protection - S151L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S152L</name>
							<description>PFLASH p Sector 152 Locked for Write Protection - S152L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S153L</name>
							<description>PFLASH p Sector 153 Locked for Write Protection - S153L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S154L</name>
							<description>PFLASH p Sector 154 Locked for Write Protection - S154L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S155L</name>
							<description>PFLASH p Sector 155 Locked for Write Protection - S155L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S156L</name>
							<description>PFLASH p Sector 156 Locked for Write Protection - S156L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S157L</name>
							<description>PFLASH p Sector 157 Locked for Write Protection - S157L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S158L</name>
							<description>PFLASH p Sector 158 Locked for Write Protection - S158L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S159L</name>
							<description>PFLASH p Sector 159 Locked for Write Protection - S159L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_PROCONP05</name>
					<description>PFLASH Bank 0 Protection Configuration 5</description>
					<addressOffset>0x10014</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S160L</name>
							<description>PFLASH p Sector 160 Locked for Write Protection - S160L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S161L</name>
							<description>PFLASH p Sector 161 Locked for Write Protection - S161L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S162L</name>
							<description>PFLASH p Sector 162 Locked for Write Protection - S162L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S163L</name>
							<description>PFLASH p Sector 163 Locked for Write Protection - S163L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S164L</name>
							<description>PFLASH p Sector 164 Locked for Write Protection - S164L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S165L</name>
							<description>PFLASH p Sector 165 Locked for Write Protection - S165L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S166L</name>
							<description>PFLASH p Sector 166 Locked for Write Protection - S166L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S167L</name>
							<description>PFLASH p Sector 167 Locked for Write Protection - S167L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S168L</name>
							<description>PFLASH p Sector 168 Locked for Write Protection - S168L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S169L</name>
							<description>PFLASH p Sector 169 Locked for Write Protection - S169L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S170L</name>
							<description>PFLASH p Sector 170 Locked for Write Protection - S170L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S171L</name>
							<description>PFLASH p Sector 171 Locked for Write Protection - S171L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S172L</name>
							<description>PFLASH p Sector 172 Locked for Write Protection - S172L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S173L</name>
							<description>PFLASH p Sector 173 Locked for Write Protection - S173L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S174L</name>
							<description>PFLASH p Sector 174 Locked for Write Protection - S174L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S175L</name>
							<description>PFLASH p Sector 175 Locked for Write Protection - S175L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S176L</name>
							<description>PFLASH p Sector 176 Locked for Write Protection - S176L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S177L</name>
							<description>PFLASH p Sector 177 Locked for Write Protection - S177L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S178L</name>
							<description>PFLASH p Sector 178 Locked for Write Protection - S178L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S179L</name>
							<description>PFLASH p Sector 179 Locked for Write Protection - S179L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S180L</name>
							<description>PFLASH p Sector 180 Locked for Write Protection - S180L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S181L</name>
							<description>PFLASH p Sector 181 Locked for Write Protection - S181L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S182L</name>
							<description>PFLASH p Sector 182 Locked for Write Protection - S182L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S183L</name>
							<description>PFLASH p Sector 183 Locked for Write Protection - S183L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S184L</name>
							<description>PFLASH p Sector 184 Locked for Write Protection - S184L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S185L</name>
							<description>PFLASH p Sector 185 Locked for Write Protection - S185L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S186L</name>
							<description>PFLASH p Sector 186 Locked for Write Protection - S186L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S187L</name>
							<description>PFLASH p Sector 187 Locked for Write Protection - S187L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S188L</name>
							<description>PFLASH p Sector 188 Locked for Write Protection - S188L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S189L</name>
							<description>PFLASH p Sector 189 Locked for Write Protection - S189L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S190L</name>
							<description>PFLASH p Sector 190 Locked for Write Protection - S190L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S191L</name>
							<description>PFLASH p Sector 191 Locked for Write Protection - S191L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_PROCONOTP00</name>
					<description>PFLASH Bank 0 OTP Protection Configuration 0</description>
					<addressOffset>0x10040</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S0ROM</name>
							<description>PFLASH p Sector 0 Locked for Forever - S0ROM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S1ROM</name>
							<description>PFLASH p Sector 1 Locked for Forever - S1ROM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S2ROM</name>
							<description>PFLASH p Sector 2 Locked for Forever - S2ROM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S3ROM</name>
							<description>PFLASH p Sector 3 Locked for Forever - S3ROM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S4ROM</name>
							<description>PFLASH p Sector 4 Locked for Forever - S4ROM</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S5ROM</name>
							<description>PFLASH p Sector 5 Locked for Forever - S5ROM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S6ROM</name>
							<description>PFLASH p Sector 6 Locked for Forever - S6ROM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S7ROM</name>
							<description>PFLASH p Sector 7 Locked for Forever - S7ROM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S8ROM</name>
							<description>PFLASH p Sector 8 Locked for Forever - S8ROM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S9ROM</name>
							<description>PFLASH p Sector 9 Locked for Forever - S9ROM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S10ROM</name>
							<description>PFLASH p Sector 10 Locked for Forever - S10ROM</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S11ROM</name>
							<description>PFLASH p Sector 11 Locked for Forever - S11ROM</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S12ROM</name>
							<description>PFLASH p Sector 12 Locked for Forever - S12ROM</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S13ROM</name>
							<description>PFLASH p Sector 13 Locked for Forever - S13ROM</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S14ROM</name>
							<description>PFLASH p Sector 14 Locked for Forever - S14ROM</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S15ROM</name>
							<description>PFLASH p Sector 15 Locked for Forever - S15ROM</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S16ROM</name>
							<description>PFLASH p Sector 16 Locked for Forever - S16ROM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S17ROM</name>
							<description>PFLASH p Sector 17 Locked for Forever - S17ROM</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S18ROM</name>
							<description>PFLASH p Sector 18 Locked for Forever - S18ROM</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S19ROM</name>
							<description>PFLASH p Sector 19 Locked for Forever - S19ROM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S20ROM</name>
							<description>PFLASH p Sector 20 Locked for Forever - S20ROM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S21ROM</name>
							<description>PFLASH p Sector 21 Locked for Forever - S21ROM</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S22ROM</name>
							<description>PFLASH p Sector 22 Locked for Forever - S22ROM</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S23ROM</name>
							<description>PFLASH p Sector 23 Locked for Forever - S23ROM</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S24ROM</name>
							<description>PFLASH p Sector 24 Locked for Forever - S24ROM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S25ROM</name>
							<description>PFLASH p Sector 25 Locked for Forever - S25ROM</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S26ROM</name>
							<description>PFLASH p Sector 26 Locked for Forever - S26ROM</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S27ROM</name>
							<description>PFLASH p Sector 27 Locked for Forever - S27ROM</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S28ROM</name>
							<description>PFLASH p Sector 28 Locked for Forever - S28ROM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S29ROM</name>
							<description>PFLASH p Sector 29 Locked for Forever - S29ROM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S30ROM</name>
							<description>PFLASH p Sector 30 Locked for Forever - S30ROM</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S31ROM</name>
							<description>PFLASH p Sector 31 Locked for Forever - S31ROM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
