J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>HP_PROCONWOP00</name>
					<description>PFLASH Bank 0 WOP Configuration 0</description>
					<addressOffset>0x10080</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S0WOP</name>
							<description>PFLASH p Sector 0 Configured for Write-Once Protection - S0WOP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S1WOP</name>
							<description>PFLASH p Sector 1 Configured for Write-Once Protection - S1WOP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S2WOP</name>
							<description>PFLASH p Sector 2 Configured for Write-Once Protection - S2WOP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S3WOP</name>
							<description>PFLASH p Sector 3 Configured for Write-Once Protection - S3WOP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S4WOP</name>
							<description>PFLASH p Sector 4 Configured for Write-Once Protection - S4WOP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S5WOP</name>
							<description>PFLASH p Sector 5 Configured for Write-Once Protection - S5WOP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S6WOP</name>
							<description>PFLASH p Sector 6 Configured for Write-Once Protection - S6WOP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S7WOP</name>
							<description>PFLASH p Sector 7 Configured for Write-Once Protection - S7WOP</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S8WOP</name>
							<description>PFLASH p Sector 8 Configured for Write-Once Protection - S8WOP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S9WOP</name>
							<description>PFLASH p Sector 9 Configured for Write-Once Protection - S9WOP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S10WOP</name>
							<description>PFLASH p Sector 10 Configured for Write-Once Protection - S10WOP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S11WOP</name>
							<description>PFLASH p Sector 11 Configured for Write-Once Protection - S11WOP</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S12WOP</name>
							<description>PFLASH p Sector 12 Configured for Write-Once Protection - S12WOP</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S13WOP</name>
							<description>PFLASH p Sector 13 Configured for Write-Once Protection - S13WOP</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S14WOP</name>
							<description>PFLASH p Sector 14 Configured for Write-Once Protection - S14WOP</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S15WOP</name>
							<description>PFLASH p Sector 15 Configured for Write-Once Protection - S15WOP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S16WOP</name>
							<description>PFLASH p Sector 16 Configured for Write-Once Protection - S16WOP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S17WOP</name>
							<description>PFLASH p Sector 17 Configured for Write-Once Protection - S17WOP</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S18WOP</name>
							<description>PFLASH p Sector 18 Configured for Write-Once Protection - S18WOP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S19WOP</name>
							<description>PFLASH p Sector 19 Configured for Write-Once Protection - S19WOP</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S20WOP</name>
							<description>PFLASH p Sector 20 Configured for Write-Once Protection - S20WOP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S21WOP</name>
							<description>PFLASH p Sector 21 Configured for Write-Once Protection - S21WOP</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S22WOP</name>
							<description>PFLASH p Sector 22 Configured for Write-Once Protection - S22WOP</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S23WOP</name>
							<description>PFLASH p Sector 23 Configured for Write-Once Protection - S23WOP</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S24WOP</name>
							<description>PFLASH p Sector 24 Configured for Write-Once Protection - S24WOP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S25WOP</name>
							<description>PFLASH p Sector 25 Configured for Write-Once Protection - S25WOP</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S26WOP</name>
							<description>PFLASH p Sector 26 Configured for Write-Once Protection - S26WOP</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S27WOP</name>
							<description>PFLASH p Sector 27 Configured for Write-Once Protection - S27WOP</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S28WOP</name>
							<description>PFLASH p Sector 28 Configured for Write-Once Protection - S28WOP</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S29WOP</name>
							<description>PFLASH p Sector 29 Configured for Write-Once Protection - S29WOP</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S30WOP</name>
							<description>PFLASH p Sector 30 Configured for Write-Once Protection - S30WOP</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S31WOP</name>
							<description>PFLASH p Sector 31 Configured for Write-Once Protection - S31WOP</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_PROCONWOP01</name>
					<description>PFLASH Bank 0 WOP Configuration 1</description>
					<addressOffset>0x10084</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S32WOP</name>
							<description>PFLASH p Sector 32 Configured for Write-Once Protection - S32WOP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S33WOP</name>
							<description>PFLASH p Sector 33 Configured for Write-Once Protection - S33WOP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S34WOP</name>
							<description>PFLASH p Sector 34 Configured for Write-Once Protection - S34WOP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S35WOP</name>
							<description>PFLASH p Sector 35 Configured for Write-Once Protection - S35WOP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S36WOP</name>
							<description>PFLASH p Sector 36 Configured for Write-Once Protection - S36WOP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S37WOP</name>
							<description>PFLASH p Sector 37 Configured for Write-Once Protection - S37WOP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S38WOP</name>
							<description>PFLASH p Sector 38 Configured for Write-Once Protection - S38WOP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S39WOP</name>
							<description>PFLASH p Sector 39 Configured for Write-Once Protection - S39WOP</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S40WOP</name>
							<description>PFLASH p Sector 40 Configured for Write-Once Protection - S40WOP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S41WOP</name>
							<description>PFLASH p Sector 41 Configured for Write-Once Protection - S41WOP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S42WOP</name>
							<description>PFLASH p Sector 42 Configured for Write-Once Protection - S42WOP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S43WOP</name>
							<description>PFLASH p Sector 43 Configured for Write-Once Protection - S43WOP</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S44WOP</name>
							<description>PFLASH p Sector 44 Configured for Write-Once Protection - S44WOP</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S45WOP</name>
							<description>PFLASH p Sector 45 Configured for Write-Once Protection - S45WOP</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S46WOP</name>
							<description>PFLASH p Sector 46 Configured for Write-Once Protection - S46WOP</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S47WOP</name>
							<description>PFLASH p Sector 47 Configured for Write-Once Protection - S47WOP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S48WOP</name>
							<description>PFLASH p Sector 48 Configured for Write-Once Protection - S48WOP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S49WOP</name>
							<description>PFLASH p Sector 49 Configured for Write-Once Protection - S49WOP</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S50WOP</name>
							<description>PFLASH p Sector 50 Configured for Write-Once Protection - S50WOP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S51WOP</name>
							<description>PFLASH p Sector 51 Configured for Write-Once Protection - S51WOP</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S52WOP</name>
							<description>PFLASH p Sector 52 Configured for Write-Once Protection - S52WOP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S53WOP</name>
							<description>PFLASH p Sector 53 Configured for Write-Once Protection - S53WOP</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S54WOP</name>
							<description>PFLASH p Sector 54 Configured for Write-Once Protection - S54WOP</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S55WOP</name>
							<description>PFLASH p Sector 55 Configured for Write-Once Protection - S55WOP</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S56WOP</name>
							<description>PFLASH p Sector 56 Configured for Write-Once Protection - S56WOP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S57WOP</name>
							<description>PFLASH p Sector 57 Configured for Write-Once Protection - S57WOP</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S58WOP</name>
							<description>PFLASH p Sector 58 Configured for Write-Once Protection - S58WOP</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S59WOP</name>
							<description>PFLASH p Sector 59 Configured for Write-Once Protection - S59WOP</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S60WOP</name>
							<description>PFLASH p Sector 60 Configured for Write-Once Protection - S60WOP</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S61WOP</name>
							<description>PFLASH p Sector 61 Configured for Write-Once Protection - S61WOP</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S62WOP</name>
							<description>PFLASH p Sector 62 Configured for Write-Once Protection - S62WOP</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S63WOP</name>
							<description>PFLASH p Sector 63 Configured for Write-Once Protection - S63WOP</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
