J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>HP_PROCONWOP02</name>
					<description>PFLASH Bank 0 WOP Configuration 2</description>
					<addressOffset>0x10088</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S64WOP</name>
							<description>PFLASH p Sector 64 Configured for Write-Once Protection - S64WOP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S65WOP</name>
							<description>PFLASH p Sector 65 Configured for Write-Once Protection - S65WOP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S66WOP</name>
							<description>PFLASH p Sector 66 Configured for Write-Once Protection - S66WOP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S67WOP</name>
							<description>PFLASH p Sector 67 Configured for Write-Once Protection - S67WOP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S68WOP</name>
							<description>PFLASH p Sector 68 Configured for Write-Once Protection - S68WOP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S69WOP</name>
							<description>PFLASH p Sector 69 Configured for Write-Once Protection - S69WOP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S70WOP</name>
							<description>PFLASH p Sector 70 Configured for Write-Once Protection - S70WOP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S71WOP</name>
							<description>PFLASH p Sector 71 Configured for Write-Once Protection - S71WOP</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S72WOP</name>
							<description>PFLASH p Sector 72 Configured for Write-Once Protection - S72WOP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S73WOP</name>
							<description>PFLASH p Sector 73 Configured for Write-Once Protection - S73WOP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S74WOP</name>
							<description>PFLASH p Sector 74 Configured for Write-Once Protection - S74WOP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S75WOP</name>
							<description>PFLASH p Sector 75 Configured for Write-Once Protection - S75WOP</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S76WOP</name>
							<description>PFLASH p Sector 76 Configured for Write-Once Protection - S76WOP</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S77WOP</name>
							<description>PFLASH p Sector 77 Configured for Write-Once Protection - S77WOP</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S78WOP</name>
							<description>PFLASH p Sector 78 Configured for Write-Once Protection - S78WOP</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S79WOP</name>
							<description>PFLASH p Sector 79 Configured for Write-Once Protection - S79WOP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S80WOP</name>
							<description>PFLASH p Sector 80 Configured for Write-Once Protection - S80WOP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S81WOP</name>
							<description>PFLASH p Sector 81 Configured for Write-Once Protection - S81WOP</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S82WOP</name>
							<description>PFLASH p Sector 82 Configured for Write-Once Protection - S82WOP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S83WOP</name>
							<description>PFLASH p Sector 83 Configured for Write-Once Protection - S83WOP</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S84WOP</name>
							<description>PFLASH p Sector 84 Configured for Write-Once Protection - S84WOP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S85WOP</name>
							<description>PFLASH p Sector 85 Configured for Write-Once Protection - S85WOP</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S86WOP</name>
							<description>PFLASH p Sector 86 Configured for Write-Once Protection - S86WOP</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S87WOP</name>
							<description>PFLASH p Sector 87 Configured for Write-Once Protection - S87WOP</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S88WOP</name>
							<description>PFLASH p Sector 88 Configured for Write-Once Protection - S88WOP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S89WOP</name>
							<description>PFLASH p Sector 89 Configured for Write-Once Protection - S89WOP</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S90WOP</name>
							<description>PFLASH p Sector 90 Configured for Write-Once Protection - S90WOP</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S91WOP</name>
							<description>PFLASH p Sector 91 Configured for Write-Once Protection - S91WOP</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S92WOP</name>
							<description>PFLASH p Sector 92 Configured for Write-Once Protection - S92WOP</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S93WOP</name>
							<description>PFLASH p Sector 93 Configured for Write-Once Protection - S93WOP</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S94WOP</name>
							<description>PFLASH p Sector 94 Configured for Write-Once Protection - S94WOP</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S95WOP</name>
							<description>PFLASH p Sector 95 Configured for Write-Once Protection - S95WOP</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_PROCONWOP03</name>
					<description>PFLASH Bank 0 WOP Configuration 3</description>
					<addressOffset>0x1008C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S96WOP</name>
							<description>PFLASH p Sector 96 Configured for Write-Once Protection - S96WOP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S97WOP</name>
							<description>PFLASH p Sector 97 Configured for Write-Once Protection - S97WOP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S98WOP</name>
							<description>PFLASH p Sector 98 Configured for Write-Once Protection - S98WOP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S99WOP</name>
							<description>PFLASH p Sector 99 Configured for Write-Once Protection - S99WOP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S100WOP</name>
							<description>PFLASH p Sector 100 Configured for Write-Once Protection - S100WOP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S101WOP</name>
							<description>PFLASH p Sector 101 Configured for Write-Once Protection - S101WOP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S102WOP</name>
							<description>PFLASH p Sector 102 Configured for Write-Once Protection - S102WOP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S103WOP</name>
							<description>PFLASH p Sector 103 Configured for Write-Once Protection - S103WOP</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S104WOP</name>
							<description>PFLASH p Sector 104 Configured for Write-Once Protection - S104WOP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S105WOP</name>
							<description>PFLASH p Sector 105 Configured for Write-Once Protection - S105WOP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S106WOP</name>
							<description>PFLASH p Sector 106 Configured for Write-Once Protection - S106WOP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S107WOP</name>
							<description>PFLASH p Sector 107 Configured for Write-Once Protection - S107WOP</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S108WOP</name>
							<description>PFLASH p Sector 108 Configured for Write-Once Protection - S108WOP</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S109WOP</name>
							<description>PFLASH p Sector 109 Configured for Write-Once Protection - S109WOP</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S110WOP</name>
							<description>PFLASH p Sector 110 Configured for Write-Once Protection - S110WOP</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S111WOP</name>
							<description>PFLASH p Sector 111 Configured for Write-Once Protection - S111WOP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S112WOP</name>
							<description>PFLASH p Sector 112 Configured for Write-Once Protection - S112WOP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S113WOP</name>
							<description>PFLASH p Sector 113 Configured for Write-Once Protection - S113WOP</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S114WOP</name>
							<description>PFLASH p Sector 114 Configured for Write-Once Protection - S114WOP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S115WOP</name>
							<description>PFLASH p Sector 115 Configured for Write-Once Protection - S115WOP</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S116WOP</name>
							<description>PFLASH p Sector 116 Configured for Write-Once Protection - S116WOP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S117WOP</name>
							<description>PFLASH p Sector 117 Configured for Write-Once Protection - S117WOP</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S118WOP</name>
							<description>PFLASH p Sector 118 Configured for Write-Once Protection - S118WOP</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S119WOP</name>
							<description>PFLASH p Sector 119 Configured for Write-Once Protection - S119WOP</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S120WOP</name>
							<description>PFLASH p Sector 120 Configured for Write-Once Protection - S120WOP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S121WOP</name>
							<description>PFLASH p Sector 121 Configured for Write-Once Protection - S121WOP</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S122WOP</name>
							<description>PFLASH p Sector 122 Configured for Write-Once Protection - S122WOP</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S123WOP</name>
							<description>PFLASH p Sector 123 Configured for Write-Once Protection - S123WOP</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S124WOP</name>
							<description>PFLASH p Sector 124 Configured for Write-Once Protection - S124WOP</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S125WOP</name>
							<description>PFLASH p Sector 125 Configured for Write-Once Protection - S125WOP</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S126WOP</name>
							<description>PFLASH p Sector 126 Configured for Write-Once Protection - S126WOP</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S127WOP</name>
							<description>PFLASH p Sector 127 Configured for Write-Once Protection - S127WOP</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
