J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>HP_ECPRIO00</name>
					<description>PFLASH Bank 0 Erase Counter Priority configuration 0</description>
					<addressOffset>0x100A0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S0L</name>
							<description>PFLASH p Sector 0 Erase Counter priority - S0L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S1L</name>
							<description>PFLASH p Sector 1 Erase Counter priority - S1L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S2L</name>
							<description>PFLASH p Sector 2 Erase Counter priority - S2L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S3L</name>
							<description>PFLASH p Sector 3 Erase Counter priority - S3L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S4L</name>
							<description>PFLASH p Sector 4 Erase Counter priority - S4L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S5L</name>
							<description>PFLASH p Sector 5 Erase Counter priority - S5L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S6L</name>
							<description>PFLASH p Sector 6 Erase Counter priority - S6L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S7L</name>
							<description>PFLASH p Sector 7 Erase Counter priority - S7L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S8L</name>
							<description>PFLASH p Sector 8 Erase Counter priority - S8L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S9L</name>
							<description>PFLASH p Sector 9 Erase Counter priority - S9L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S10L</name>
							<description>PFLASH p Sector 10 Erase Counter priority - S10L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S11L</name>
							<description>PFLASH p Sector 11 Erase Counter priority - S11L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S12L</name>
							<description>PFLASH p Sector 12 Erase Counter priority - S12L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S13L</name>
							<description>PFLASH p Sector 13 Erase Counter priority - S13L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S14L</name>
							<description>PFLASH p Sector 14 Erase Counter priority - S14L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S15L</name>
							<description>PFLASH p Sector 15 Erase Counter priority - S15L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S16L</name>
							<description>PFLASH p Sector 16 Erase Counter priority - S16L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S17L</name>
							<description>PFLASH p Sector 17 Erase Counter priority - S17L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S18L</name>
							<description>PFLASH p Sector 18 Erase Counter priority - S18L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S19L</name>
							<description>PFLASH p Sector 19 Erase Counter priority - S19L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S20L</name>
							<description>PFLASH p Sector 20 Erase Counter priority - S20L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S21L</name>
							<description>PFLASH p Sector 21 Erase Counter priority - S21L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S22L</name>
							<description>PFLASH p Sector 22 Erase Counter priority - S22L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S23L</name>
							<description>PFLASH p Sector 23 Erase Counter priority - S23L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S24L</name>
							<description>PFLASH p Sector 24 Erase Counter priority - S24L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S25L</name>
							<description>PFLASH p Sector 25 Erase Counter priority - S25L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S26L</name>
							<description>PFLASH p Sector 26 Erase Counter priority - S26L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S27L</name>
							<description>PFLASH p Sector 27 Erase Counter priority - S27L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S28L</name>
							<description>PFLASH p Sector 28 Erase Counter priority - S28L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S29L</name>
							<description>PFLASH p Sector 29 Erase Counter priority - S29L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S30L</name>
							<description>PFLASH p Sector 30 Erase Counter priority - S30L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S31L</name>
							<description>PFLASH p Sector 31 Erase Counter priority - S31L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_ECPRIO01</name>
					<description>PFLASH Bank 0 Erase Counter Priority Configuration 1</description>
					<addressOffset>0x100A4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S32L</name>
							<description>PFLASH p Sector 32 Erase Counter priority - S32L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S33L</name>
							<description>PFLASH p Sector 33 Erase Counter priority - S33L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S34L</name>
							<description>PFLASH p Sector 34 Erase Counter priority - S34L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S35L</name>
							<description>PFLASH p Sector 35 Erase Counter priority - S35L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S36L</name>
							<description>PFLASH p Sector 36 Erase Counter priority - S36L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S37L</name>
							<description>PFLASH p Sector 37 Erase Counter priority - S37L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S38L</name>
							<description>PFLASH p Sector 38 Erase Counter priority - S38L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S39L</name>
							<description>PFLASH p Sector 39 Erase Counter priority - S39L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S40L</name>
							<description>PFLASH p Sector 40 Erase Counter priority - S40L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S41L</name>
							<description>PFLASH p Sector 41 Erase Counter priority - S41L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S42L</name>
							<description>PFLASH p Sector 42 Erase Counter priority - S42L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S43L</name>
							<description>PFLASH p Sector 43 Erase Counter priority - S43L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S44L</name>
							<description>PFLASH p Sector 44 Erase Counter priority - S44L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S45L</name>
							<description>PFLASH p Sector 45 Erase Counter priority - S45L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S46L</name>
							<description>PFLASH p Sector 46 Erase Counter priority - S46L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S47L</name>
							<description>PFLASH p Sector 47 Erase Counter priority - S47L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S48L</name>
							<description>PFLASH p Sector 48 Erase Counter priority - S48L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S49L</name>
							<description>PFLASH p Sector 49 Erase Counter priority - S49L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S50L</name>
							<description>PFLASH p Sector 50 Erase Counter priority - S50L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S51L</name>
							<description>PFLASH p Sector 51 Erase Counter priority - S51L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S52L</name>
							<description>PFLASH p Sector 52 Erase Counter priority - S52L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S53L</name>
							<description>PFLASH p Sector 53 Erase Counter priority - S53L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S54L</name>
							<description>PFLASH p Sector 54 Erase Counter priority - S54L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S55L</name>
							<description>PFLASH p Sector 55 Erase Counter priority - S55L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S56L</name>
							<description>PFLASH p Sector 56 Erase Counter priority - S56L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S57L</name>
							<description>PFLASH p Sector 57 Erase Counter priority - S57L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S58L</name>
							<description>PFLASH p Sector 58 Erase Counter priority - S58L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S59L</name>
							<description>PFLASH p Sector 59 Erase Counter priority - S59L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S60L</name>
							<description>PFLASH p Sector 60 Erase Counter priority - S60L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S61L</name>
							<description>PFLASH p Sector 61 Erase Counter priority - S61L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S62L</name>
							<description>PFLASH p Sector 62 Erase Counter priority - S62L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S63L</name>
							<description>PFLASH p Sector 63 Erase Counter priority - S63L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_ECPRIO02</name>
					<description>PFLASH Bank 0 Erase Counter Priority Configuration 2</description>
					<addressOffset>0x100A8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S64L</name>
							<description>PFLASH p Sector 64 Erase Counter priority - S64L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S65L</name>
							<description>PFLASH p Sector 65 Erase Counter priority - S65L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S66L</name>
							<description>PFLASH p Sector 66 Erase Counter priority - S66L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S67L</name>
							<description>PFLASH p Sector 67 Erase Counter priority - S67L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S68L</name>
							<description>PFLASH p Sector 68 Erase Counter priority - S68L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S69L</name>
							<description>PFLASH p Sector 69 Erase Counter priority - S69L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S70L</name>
							<description>PFLASH p Sector 70 Erase Counter priority - S70L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S71L</name>
							<description>PFLASH p Sector 71 Erase Counter priority - S71L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S72L</name>
							<description>PFLASH p Sector 72 Erase Counter priority - S72L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S73L</name>
							<description>PFLASH p Sector 73 Erase Counter priority - S73L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S74L</name>
							<description>PFLASH p Sector 74 Erase Counter priority - S74L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S75L</name>
							<description>PFLASH p Sector 75 Erase Counter priority - S75L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S76L</name>
							<description>PFLASH p Sector 76 Erase Counter priority - S76L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S77L</name>
							<description>PFLASH p Sector 77 Erase Counter priority - S77L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S78L</name>
							<description>PFLASH p Sector 78 Erase Counter priority - S78L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S79L</name>
							<description>PFLASH p Sector 79 Erase Counter priority - S79L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S80L</name>
							<description>PFLASH p Sector 80 Erase Counter priority - S80L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S81L</name>
							<description>PFLASH p Sector 81 Erase Counter priority - S81L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S82L</name>
							<description>PFLASH p Sector 82 Erase Counter priority - S82L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S83L</name>
							<description>PFLASH p Sector 83 Erase Counter priority - S83L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S84L</name>
							<description>PFLASH p Sector 84 Erase Counter priority - S84L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S85L</name>
							<description>PFLASH p Sector 85 Erase Counter priority - S85L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S86L</name>
							<description>PFLASH p Sector 86 Erase Counter priority - S86L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S87L</name>
							<description>PFLASH p Sector 87 Erase Counter priority - S87L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S88L</name>
							<description>PFLASH p Sector 88 Erase Counter priority - S88L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S89L</name>
							<description>PFLASH p Sector 89 Erase Counter priority - S89L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S90L</name>
							<description>PFLASH p Sector 90 Erase Counter priority - S90L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S91L</name>
							<description>PFLASH p Sector 91 Erase Counter priority - S91L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S92L</name>
							<description>PFLASH p Sector 92 Erase Counter priority - S92L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S93L</name>
							<description>PFLASH p Sector 93 Erase Counter priority - S93L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S94L</name>
							<description>PFLASH p Sector 94 Erase Counter priority - S94L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S95L</name>
							<description>PFLASH p Sector 95 Erase Counter priority - S95L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
