J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>HP_ECPRIO03</name>
					<description>PFLASH Bank 0 Erase Counter Priority Configuration 3</description>
					<addressOffset>0x100AC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S96L</name>
							<description>PFLASH p Sector 96 Erase Counter priority - S96L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S97L</name>
							<description>PFLASH p Sector 97 Erase Counter priority - S97L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S98L</name>
							<description>PFLASH p Sector 98 Erase Counter priority - S98L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S99L</name>
							<description>PFLASH p Sector 99 Erase Counter priority - S99L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S100L</name>
							<description>PFLASH p Sector 100 Erase Counter priority - S100L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S101L</name>
							<description>PFLASH p Sector 101 Erase Counter priority - S101L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S102L</name>
							<description>PFLASH p Sector 102 Erase Counter priority - S102L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S103L</name>
							<description>PFLASH p Sector 103 Erase Counter priority - S103L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S104L</name>
							<description>PFLASH p Sector 104 Erase Counter priority - S104L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S105L</name>
							<description>PFLASH p Sector 105 Erase Counter priority - S105L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S106L</name>
							<description>PFLASH p Sector 106 Erase Counter priority - S106L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S107L</name>
							<description>PFLASH p Sector 107 Erase Counter priority - S107L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S108L</name>
							<description>PFLASH p Sector 108 Erase Counter priority - S108L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S109L</name>
							<description>PFLASH p Sector 109 Erase Counter priority - S109L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S110L</name>
							<description>PFLASH p Sector 110 Erase Counter priority - S110L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S111L</name>
							<description>PFLASH p Sector 111 Erase Counter priority - S111L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S112L</name>
							<description>PFLASH p Sector 112 Erase Counter priority - S112L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S113L</name>
							<description>PFLASH p Sector 113 Erase Counter priority - S113L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S114L</name>
							<description>PFLASH p Sector 114 Erase Counter priority - S114L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S115L</name>
							<description>PFLASH p Sector 115 Erase Counter priority - S115L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S116L</name>
							<description>PFLASH p Sector 116 Erase Counter priority - S116L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S117L</name>
							<description>PFLASH p Sector 117 Erase Counter priority - S117L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S118L</name>
							<description>PFLASH p Sector 118 Erase Counter priority - S118L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S119L</name>
							<description>PFLASH p Sector 119 Erase Counter priority - S119L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S120L</name>
							<description>PFLASH p Sector 120 Erase Counter priority - S120L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S121L</name>
							<description>PFLASH p Sector 121 Erase Counter priority - S121L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S122L</name>
							<description>PFLASH p Sector 122 Erase Counter priority - S122L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S123L</name>
							<description>PFLASH p Sector 123 Erase Counter priority - S123L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S124L</name>
							<description>PFLASH p Sector 124 Erase Counter priority - S124L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S125L</name>
							<description>PFLASH p Sector 125 Erase Counter priority - S125L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S126L</name>
							<description>PFLASH p Sector 126 Erase Counter priority - S126L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S127L</name>
							<description>PFLASH p Sector 127 Erase Counter priority - S127L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_ECPRIO04</name>
					<description>PFLASH Bank 0 Erase Counter Priority Configuration 4</description>
					<addressOffset>0x100B0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S128L</name>
							<description>PFLASH p Sector 128 Erase Counter priority - S128L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S129L</name>
							<description>PFLASH p Sector 129 Erase Counter priority - S129L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S130L</name>
							<description>PFLASH p Sector 130 Erase Counter priority - S130L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S131L</name>
							<description>PFLASH p Sector 131 Erase Counter priority - S131L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S132L</name>
							<description>PFLASH p Sector 132 Erase Counter priority - S132L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S133L</name>
							<description>PFLASH p Sector 133 Erase Counter priority - S133L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S134L</name>
							<description>PFLASH p Sector 134 Erase Counter priority - S134L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S135L</name>
							<description>PFLASH p Sector 135 Erase Counter priority - S135L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S136L</name>
							<description>PFLASH p Sector 136 Erase Counter priority - S136L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S137L</name>
							<description>PFLASH p Sector 137 Erase Counter priority - S137L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S138L</name>
							<description>PFLASH p Sector 138 Erase Counter priority - S138L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S139L</name>
							<description>PFLASH p Sector 139 Erase Counter priority - S139L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S140L</name>
							<description>PFLASH p Sector 140 Erase Counter priority - S140L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S141L</name>
							<description>PFLASH p Sector 141 Erase Counter priority - S141L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S142L</name>
							<description>PFLASH p Sector 142 Erase Counter priority - S142L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S143L</name>
							<description>PFLASH p Sector 143 Erase Counter priority - S143L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S144L</name>
							<description>PFLASH p Sector 144 Erase Counter priority - S144L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S145L</name>
							<description>PFLASH p Sector 145 Erase Counter priority - S145L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S146L</name>
							<description>PFLASH p Sector 146 Erase Counter priority - S146L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S147L</name>
							<description>PFLASH p Sector 147 Erase Counter priority - S147L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S148L</name>
							<description>PFLASH p Sector 148 Erase Counter priority - S148L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S149L</name>
							<description>PFLASH p Sector 149 Erase Counter priority - S149L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S150L</name>
							<description>PFLASH p Sector 150 Erase Counter priority - S150L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S151L</name>
							<description>PFLASH p Sector 151 Erase Counter priority - S151L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S152L</name>
							<description>PFLASH p Sector 152 Erase Counter priority - S152L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S153L</name>
							<description>PFLASH p Sector 153 Erase Counter priority - S153L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S154L</name>
							<description>PFLASH p Sector 154 Erase Counter priority - S154L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S155L</name>
							<description>PFLASH p Sector 155 Erase Counter priority - S155L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S156L</name>
							<description>PFLASH p Sector 156 Erase Counter priority - S156L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S157L</name>
							<description>PFLASH p Sector 157 Erase Counter priority - S157L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S158L</name>
							<description>PFLASH p Sector 158 Erase Counter priority - S158L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S159L</name>
							<description>PFLASH p Sector 159 Erase Counter priority - S159L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_ECPRIO05</name>
					<description>PFLASH Bank 0 Erase Counter Priority Configuration 5</description>
					<addressOffset>0x100B4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S160L</name>
							<description>PFLASH p Sector 160 Erase Counter priority - S160L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S161L</name>
							<description>PFLASH p Sector 161 Erase Counter priority - S161L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S162L</name>
							<description>PFLASH p Sector 162 Erase Counter priority - S162L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S163L</name>
							<description>PFLASH p Sector 163 Erase Counter priority - S163L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S164L</name>
							<description>PFLASH p Sector 164 Erase Counter priority - S164L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S165L</name>
							<description>PFLASH p Sector 165 Erase Counter priority - S165L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S166L</name>
							<description>PFLASH p Sector 166 Erase Counter priority - S166L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S167L</name>
							<description>PFLASH p Sector 167 Erase Counter priority - S167L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S168L</name>
							<description>PFLASH p Sector 168 Erase Counter priority - S168L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S169L</name>
							<description>PFLASH p Sector 169 Erase Counter priority - S169L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S170L</name>
							<description>PFLASH p Sector 170 Erase Counter priority - S170L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S171L</name>
							<description>PFLASH p Sector 171 Erase Counter priority - S171L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S172L</name>
							<description>PFLASH p Sector 172 Erase Counter priority - S172L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S173L</name>
							<description>PFLASH p Sector 173 Erase Counter priority - S173L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S174L</name>
							<description>PFLASH p Sector 174 Erase Counter priority - S174L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S175L</name>
							<description>PFLASH p Sector 175 Erase Counter priority - S175L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S176L</name>
							<description>PFLASH p Sector 176 Erase Counter priority - S176L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S177L</name>
							<description>PFLASH p Sector 177 Erase Counter priority - S177L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S178L</name>
							<description>PFLASH p Sector 178 Erase Counter priority - S178L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S179L</name>
							<description>PFLASH p Sector 179 Erase Counter priority - S179L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S180L</name>
							<description>PFLASH p Sector 180 Erase Counter priority - S180L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S181L</name>
							<description>PFLASH p Sector 181 Erase Counter priority - S181L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S182L</name>
							<description>PFLASH p Sector 182 Erase Counter priority - S182L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S183L</name>
							<description>PFLASH p Sector 183 Erase Counter priority - S183L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S184L</name>
							<description>PFLASH p Sector 184 Erase Counter priority - S184L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S185L</name>
							<description>PFLASH p Sector 185 Erase Counter priority - S185L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S186L</name>
							<description>PFLASH p Sector 186 Erase Counter priority - S186L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S187L</name>
							<description>PFLASH p Sector 187 Erase Counter priority - S187L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S188L</name>
							<description>PFLASH p Sector 188 Erase Counter priority - S188L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S189L</name>
							<description>PFLASH p Sector 189 Erase Counter priority - S189L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S190L</name>
							<description>PFLASH p Sector 190 Erase Counter priority - S190L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S191L</name>
							<description>PFLASH p Sector 191 Erase Counter priority - S191L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
