J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>HP_PROCONP15</name>
					<description>PFLASH Bank 1 Protection Configuration 5</description>
					<addressOffset>0x10114</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S160L</name>
							<description>PFLASH p Sector 160 Locked for Write Protection - S160L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S161L</name>
							<description>PFLASH p Sector 161 Locked for Write Protection - S161L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S162L</name>
							<description>PFLASH p Sector 162 Locked for Write Protection - S162L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S163L</name>
							<description>PFLASH p Sector 163 Locked for Write Protection - S163L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S164L</name>
							<description>PFLASH p Sector 164 Locked for Write Protection - S164L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S165L</name>
							<description>PFLASH p Sector 165 Locked for Write Protection - S165L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S166L</name>
							<description>PFLASH p Sector 166 Locked for Write Protection - S166L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S167L</name>
							<description>PFLASH p Sector 167 Locked for Write Protection - S167L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S168L</name>
							<description>PFLASH p Sector 168 Locked for Write Protection - S168L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S169L</name>
							<description>PFLASH p Sector 169 Locked for Write Protection - S169L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S170L</name>
							<description>PFLASH p Sector 170 Locked for Write Protection - S170L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S171L</name>
							<description>PFLASH p Sector 171 Locked for Write Protection - S171L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S172L</name>
							<description>PFLASH p Sector 172 Locked for Write Protection - S172L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S173L</name>
							<description>PFLASH p Sector 173 Locked for Write Protection - S173L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S174L</name>
							<description>PFLASH p Sector 174 Locked for Write Protection - S174L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S175L</name>
							<description>PFLASH p Sector 175 Locked for Write Protection - S175L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S176L</name>
							<description>PFLASH p Sector 176 Locked for Write Protection - S176L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S177L</name>
							<description>PFLASH p Sector 177 Locked for Write Protection - S177L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S178L</name>
							<description>PFLASH p Sector 178 Locked for Write Protection - S178L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S179L</name>
							<description>PFLASH p Sector 179 Locked for Write Protection - S179L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S180L</name>
							<description>PFLASH p Sector 180 Locked for Write Protection - S180L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S181L</name>
							<description>PFLASH p Sector 181 Locked for Write Protection - S181L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S182L</name>
							<description>PFLASH p Sector 182 Locked for Write Protection - S182L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S183L</name>
							<description>PFLASH p Sector 183 Locked for Write Protection - S183L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S184L</name>
							<description>PFLASH p Sector 184 Locked for Write Protection - S184L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S185L</name>
							<description>PFLASH p Sector 185 Locked for Write Protection - S185L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S186L</name>
							<description>PFLASH p Sector 186 Locked for Write Protection - S186L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S187L</name>
							<description>PFLASH p Sector 187 Locked for Write Protection - S187L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S188L</name>
							<description>PFLASH p Sector 188 Locked for Write Protection - S188L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S189L</name>
							<description>PFLASH p Sector 189 Locked for Write Protection - S189L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S190L</name>
							<description>PFLASH p Sector 190 Locked for Write Protection - S190L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S191L</name>
							<description>PFLASH p Sector 191 Locked for Write Protection - S191L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_PROCONOTP10</name>
					<description>PFLASH Bank 1 OTP Protection Configuration 0</description>
					<addressOffset>0x10140</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S0ROM</name>
							<description>PFLASH p Sector 0 Locked for Forever - S0ROM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S1ROM</name>
							<description>PFLASH p Sector 1 Locked for Forever - S1ROM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S2ROM</name>
							<description>PFLASH p Sector 2 Locked for Forever - S2ROM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S3ROM</name>
							<description>PFLASH p Sector 3 Locked for Forever - S3ROM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S4ROM</name>
							<description>PFLASH p Sector 4 Locked for Forever - S4ROM</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S5ROM</name>
							<description>PFLASH p Sector 5 Locked for Forever - S5ROM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S6ROM</name>
							<description>PFLASH p Sector 6 Locked for Forever - S6ROM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S7ROM</name>
							<description>PFLASH p Sector 7 Locked for Forever - S7ROM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S8ROM</name>
							<description>PFLASH p Sector 8 Locked for Forever - S8ROM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S9ROM</name>
							<description>PFLASH p Sector 9 Locked for Forever - S9ROM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S10ROM</name>
							<description>PFLASH p Sector 10 Locked for Forever - S10ROM</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S11ROM</name>
							<description>PFLASH p Sector 11 Locked for Forever - S11ROM</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S12ROM</name>
							<description>PFLASH p Sector 12 Locked for Forever - S12ROM</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S13ROM</name>
							<description>PFLASH p Sector 13 Locked for Forever - S13ROM</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S14ROM</name>
							<description>PFLASH p Sector 14 Locked for Forever - S14ROM</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S15ROM</name>
							<description>PFLASH p Sector 15 Locked for Forever - S15ROM</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S16ROM</name>
							<description>PFLASH p Sector 16 Locked for Forever - S16ROM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S17ROM</name>
							<description>PFLASH p Sector 17 Locked for Forever - S17ROM</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S18ROM</name>
							<description>PFLASH p Sector 18 Locked for Forever - S18ROM</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S19ROM</name>
							<description>PFLASH p Sector 19 Locked for Forever - S19ROM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S20ROM</name>
							<description>PFLASH p Sector 20 Locked for Forever - S20ROM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S21ROM</name>
							<description>PFLASH p Sector 21 Locked for Forever - S21ROM</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S22ROM</name>
							<description>PFLASH p Sector 22 Locked for Forever - S22ROM</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S23ROM</name>
							<description>PFLASH p Sector 23 Locked for Forever - S23ROM</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S24ROM</name>
							<description>PFLASH p Sector 24 Locked for Forever - S24ROM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S25ROM</name>
							<description>PFLASH p Sector 25 Locked for Forever - S25ROM</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S26ROM</name>
							<description>PFLASH p Sector 26 Locked for Forever - S26ROM</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S27ROM</name>
							<description>PFLASH p Sector 27 Locked for Forever - S27ROM</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S28ROM</name>
							<description>PFLASH p Sector 28 Locked for Forever - S28ROM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S29ROM</name>
							<description>PFLASH p Sector 29 Locked for Forever - S29ROM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S30ROM</name>
							<description>PFLASH p Sector 30 Locked for Forever - S30ROM</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S31ROM</name>
							<description>PFLASH p Sector 31 Locked for Forever - S31ROM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_PROCONOTP11</name>
					<description>PFLASH Bank 1 OTP Protection Configuration 1</description>
					<addressOffset>0x10144</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S32ROM</name>
							<description>PFLASH p Sector 32 Locked for Forever - S32ROM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S33ROM</name>
							<description>PFLASH p Sector 33 Locked for Forever - S33ROM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S34ROM</name>
							<description>PFLASH p Sector 34 Locked for Forever - S34ROM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S35ROM</name>
							<description>PFLASH p Sector 35 Locked for Forever - S35ROM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S36ROM</name>
							<description>PFLASH p Sector 36 Locked for Forever - S36ROM</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S37ROM</name>
							<description>PFLASH p Sector 37 Locked for Forever - S37ROM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S38ROM</name>
							<description>PFLASH p Sector 38 Locked for Forever - S38ROM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S39ROM</name>
							<description>PFLASH p Sector 39 Locked for Forever - S39ROM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S40ROM</name>
							<description>PFLASH p Sector 40 Locked for Forever - S40ROM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S41ROM</name>
							<description>PFLASH p Sector 41 Locked for Forever - S41ROM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S42ROM</name>
							<description>PFLASH p Sector 42 Locked for Forever - S42ROM</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S43ROM</name>
							<description>PFLASH p Sector 43 Locked for Forever - S43ROM</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S44ROM</name>
							<description>PFLASH p Sector 44 Locked for Forever - S44ROM</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S45ROM</name>
							<description>PFLASH p Sector 45 Locked for Forever - S45ROM</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S46ROM</name>
							<description>PFLASH p Sector 46 Locked for Forever - S46ROM</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S47ROM</name>
							<description>PFLASH p Sector 47 Locked for Forever - S47ROM</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S48ROM</name>
							<description>PFLASH p Sector 48 Locked for Forever - S48ROM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S49ROM</name>
							<description>PFLASH p Sector 49 Locked for Forever - S49ROM</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S50ROM</name>
							<description>PFLASH p Sector 50 Locked for Forever - S50ROM</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S51ROM</name>
							<description>PFLASH p Sector 51 Locked for Forever - S51ROM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S52ROM</name>
							<description>PFLASH p Sector 52 Locked for Forever - S52ROM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S53ROM</name>
							<description>PFLASH p Sector 53 Locked for Forever - S53ROM</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S54ROM</name>
							<description>PFLASH p Sector 54 Locked for Forever - S54ROM</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S55ROM</name>
							<description>PFLASH p Sector 55 Locked for Forever - S55ROM</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S56ROM</name>
							<description>PFLASH p Sector 56 Locked for Forever - S56ROM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S57ROM</name>
							<description>PFLASH p Sector 57 Locked for Forever - S57ROM</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S58ROM</name>
							<description>PFLASH p Sector 58 Locked for Forever - S58ROM</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S59ROM</name>
							<description>PFLASH p Sector 59 Locked for Forever - S59ROM</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S60ROM</name>
							<description>PFLASH p Sector 60 Locked for Forever - S60ROM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S61ROM</name>
							<description>PFLASH p Sector 61 Locked for Forever - S61ROM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S62ROM</name>
							<description>PFLASH p Sector 62 Locked for Forever - S62ROM</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S63ROM</name>
							<description>PFLASH p Sector 63 Locked for Forever - S63ROM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
