J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>HP_PROCONOTP12</name>
					<description>PFLASH Bank 1 OTP Protection Configuration 2</description>
					<addressOffset>0x10148</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S64ROM</name>
							<description>PFLASH p Sector 64 Locked for Forever - S64ROM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S65ROM</name>
							<description>PFLASH p Sector 65 Locked for Forever - S65ROM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S66ROM</name>
							<description>PFLASH p Sector 66 Locked for Forever - S66ROM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S67ROM</name>
							<description>PFLASH p Sector 67 Locked for Forever - S67ROM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S68ROM</name>
							<description>PFLASH p Sector 68 Locked for Forever - S68ROM</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S69ROM</name>
							<description>PFLASH p Sector 69 Locked for Forever - S69ROM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S70ROM</name>
							<description>PFLASH p Sector 70 Locked for Forever - S70ROM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S71ROM</name>
							<description>PFLASH p Sector 71 Locked for Forever - S71ROM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S72ROM</name>
							<description>PFLASH p Sector 72 Locked for Forever - S72ROM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S73ROM</name>
							<description>PFLASH p Sector 73 Locked for Forever - S73ROM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S74ROM</name>
							<description>PFLASH p Sector 74 Locked for Forever - S74ROM</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S75ROM</name>
							<description>PFLASH p Sector 75 Locked for Forever - S75ROM</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S76ROM</name>
							<description>PFLASH p Sector 76 Locked for Forever - S76ROM</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S77ROM</name>
							<description>PFLASH p Sector 77 Locked for Forever - S77ROM</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S78ROM</name>
							<description>PFLASH p Sector 78 Locked for Forever - S78ROM</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S79ROM</name>
							<description>PFLASH p Sector 79 Locked for Forever - S79ROM</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S80ROM</name>
							<description>PFLASH p Sector 80 Locked for Forever - S80ROM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S81ROM</name>
							<description>PFLASH p Sector 81 Locked for Forever - S81ROM</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S82ROM</name>
							<description>PFLASH p Sector 82 Locked for Forever - S82ROM</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S83ROM</name>
							<description>PFLASH p Sector 83 Locked for Forever - S83ROM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S84ROM</name>
							<description>PFLASH p Sector 84 Locked for Forever - S84ROM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S85ROM</name>
							<description>PFLASH p Sector 85 Locked for Forever - S85ROM</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S86ROM</name>
							<description>PFLASH p Sector 86 Locked for Forever - S86ROM</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S87ROM</name>
							<description>PFLASH p Sector 87 Locked for Forever - S87ROM</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S88ROM</name>
							<description>PFLASH p Sector 88 Locked for Forever - S88ROM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S89ROM</name>
							<description>PFLASH p Sector 89 Locked for Forever - S89ROM</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S90ROM</name>
							<description>PFLASH p Sector 90 Locked for Forever - S90ROM</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S91ROM</name>
							<description>PFLASH p Sector 91 Locked for Forever - S91ROM</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S92ROM</name>
							<description>PFLASH p Sector 92 Locked for Forever - S92ROM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S93ROM</name>
							<description>PFLASH p Sector 93 Locked for Forever - S93ROM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S94ROM</name>
							<description>PFLASH p Sector 94 Locked for Forever - S94ROM</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S95ROM</name>
							<description>PFLASH p Sector 95 Locked for Forever - S95ROM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_PROCONOTP13</name>
					<description>PFLASH Bank 1 OTP Protection Configuration 3</description>
					<addressOffset>0x1014C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S96ROM</name>
							<description>PFLASH p Sector 96 Locked for Forever - S96ROM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S97ROM</name>
							<description>PFLASH p Sector 97 Locked for Forever - S97ROM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S98ROM</name>
							<description>PFLASH p Sector 98 Locked for Forever - S98ROM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S99ROM</name>
							<description>PFLASH p Sector 99 Locked for Forever - S99ROM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S100ROM</name>
							<description>PFLASH p Sector 100 Locked for Forever - S100ROM</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S101ROM</name>
							<description>PFLASH p Sector 101 Locked for Forever - S101ROM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S102ROM</name>
							<description>PFLASH p Sector 102 Locked for Forever - S102ROM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S103ROM</name>
							<description>PFLASH p Sector 103 Locked for Forever - S103ROM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S104ROM</name>
							<description>PFLASH p Sector 104 Locked for Forever - S104ROM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S105ROM</name>
							<description>PFLASH p Sector 105 Locked for Forever - S105ROM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S106ROM</name>
							<description>PFLASH p Sector 106 Locked for Forever - S106ROM</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S107ROM</name>
							<description>PFLASH p Sector 107 Locked for Forever - S107ROM</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S108ROM</name>
							<description>PFLASH p Sector 108 Locked for Forever - S108ROM</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S109ROM</name>
							<description>PFLASH p Sector 109 Locked for Forever - S109ROM</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S110ROM</name>
							<description>PFLASH p Sector 110 Locked for Forever - S110ROM</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S111ROM</name>
							<description>PFLASH p Sector 111 Locked for Forever - S111ROM</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S112ROM</name>
							<description>PFLASH p Sector 112 Locked for Forever - S112ROM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S113ROM</name>
							<description>PFLASH p Sector 113 Locked for Forever - S113ROM</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S114ROM</name>
							<description>PFLASH p Sector 114 Locked for Forever - S114ROM</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S115ROM</name>
							<description>PFLASH p Sector 115 Locked for Forever - S115ROM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S116ROM</name>
							<description>PFLASH p Sector 116 Locked for Forever - S116ROM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S117ROM</name>
							<description>PFLASH p Sector 117 Locked for Forever - S117ROM</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S118ROM</name>
							<description>PFLASH p Sector 118 Locked for Forever - S118ROM</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S119ROM</name>
							<description>PFLASH p Sector 119 Locked for Forever - S119ROM</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S120ROM</name>
							<description>PFLASH p Sector 120 Locked for Forever - S120ROM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S121ROM</name>
							<description>PFLASH p Sector 121 Locked for Forever - S121ROM</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S122ROM</name>
							<description>PFLASH p Sector 122 Locked for Forever - S122ROM</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S123ROM</name>
							<description>PFLASH p Sector 123 Locked for Forever - S123ROM</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S124ROM</name>
							<description>PFLASH p Sector 124 Locked for Forever - S124ROM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S125ROM</name>
							<description>PFLASH p Sector 125 Locked for Forever - S125ROM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S126ROM</name>
							<description>PFLASH p Sector 126 Locked for Forever - S126ROM</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S127ROM</name>
							<description>PFLASH p Sector 127 Locked for Forever - S127ROM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_PROCONOTP14</name>
					<description>PFLASH Bank 1 OTP Protection Configuration 4</description>
					<addressOffset>0x10150</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S128ROM</name>
							<description>PFLASH p Sector 128 Locked for Forever - S128ROM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S129ROM</name>
							<description>PFLASH p Sector 129 Locked for Forever - S129ROM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S130ROM</name>
							<description>PFLASH p Sector 130 Locked for Forever - S130ROM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S131ROM</name>
							<description>PFLASH p Sector 131 Locked for Forever - S131ROM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S132ROM</name>
							<description>PFLASH p Sector 132 Locked for Forever - S132ROM</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S133ROM</name>
							<description>PFLASH p Sector 133 Locked for Forever - S133ROM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S134ROM</name>
							<description>PFLASH p Sector 134 Locked for Forever - S134ROM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S135ROM</name>
							<description>PFLASH p Sector 135 Locked for Forever - S135ROM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S136ROM</name>
							<description>PFLASH p Sector 136 Locked for Forever - S136ROM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S137ROM</name>
							<description>PFLASH p Sector 137 Locked for Forever - S137ROM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S138ROM</name>
							<description>PFLASH p Sector 138 Locked for Forever - S138ROM</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S139ROM</name>
							<description>PFLASH p Sector 139 Locked for Forever - S139ROM</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S140ROM</name>
							<description>PFLASH p Sector 140 Locked for Forever - S140ROM</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S141ROM</name>
							<description>PFLASH p Sector 141 Locked for Forever - S141ROM</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S142ROM</name>
							<description>PFLASH p Sector 142 Locked for Forever - S142ROM</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S143ROM</name>
							<description>PFLASH p Sector 143 Locked for Forever - S143ROM</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S144ROM</name>
							<description>PFLASH p Sector 144 Locked for Forever - S144ROM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S145ROM</name>
							<description>PFLASH p Sector 145 Locked for Forever - S145ROM</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S146ROM</name>
							<description>PFLASH p Sector 146 Locked for Forever - S146ROM</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S147ROM</name>
							<description>PFLASH p Sector 147 Locked for Forever - S147ROM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S148ROM</name>
							<description>PFLASH p Sector 148 Locked for Forever - S148ROM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S149ROM</name>
							<description>PFLASH p Sector 149 Locked for Forever - S149ROM</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S150ROM</name>
							<description>PFLASH p Sector 150 Locked for Forever - S150ROM</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S151ROM</name>
							<description>PFLASH p Sector 151 Locked for Forever - S151ROM</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S152ROM</name>
							<description>PFLASH p Sector 152 Locked for Forever - S152ROM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S153ROM</name>
							<description>PFLASH p Sector 153 Locked for Forever - S153ROM</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S154ROM</name>
							<description>PFLASH p Sector 154 Locked for Forever - S154ROM</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S155ROM</name>
							<description>PFLASH p Sector 155 Locked for Forever - S155ROM</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S156ROM</name>
							<description>PFLASH p Sector 156 Locked for Forever - S156ROM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S157ROM</name>
							<description>PFLASH p Sector 157 Locked for Forever - S157ROM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S158ROM</name>
							<description>PFLASH p Sector 158 Locked for Forever - S158ROM</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S159ROM</name>
							<description>PFLASH p Sector 159 Locked for Forever - S159ROM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
