J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>HP_PROCONOTP15</name>
					<description>PFLASH Bank 1 OTP Protection Configuration 5</description>
					<addressOffset>0x10154</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S160ROM</name>
							<description>PFLASH p Sector 160 Locked for Forever - S160ROM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S161ROM</name>
							<description>PFLASH p Sector 161 Locked for Forever - S161ROM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S162ROM</name>
							<description>PFLASH p Sector 162 Locked for Forever - S162ROM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S163ROM</name>
							<description>PFLASH p Sector 163 Locked for Forever - S163ROM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S164ROM</name>
							<description>PFLASH p Sector 164 Locked for Forever - S164ROM</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S165ROM</name>
							<description>PFLASH p Sector 165 Locked for Forever - S165ROM</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S166ROM</name>
							<description>PFLASH p Sector 166 Locked for Forever - S166ROM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S167ROM</name>
							<description>PFLASH p Sector 167 Locked for Forever - S167ROM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S168ROM</name>
							<description>PFLASH p Sector 168 Locked for Forever - S168ROM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S169ROM</name>
							<description>PFLASH p Sector 169 Locked for Forever - S169ROM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S170ROM</name>
							<description>PFLASH p Sector 170 Locked for Forever - S170ROM</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S171ROM</name>
							<description>PFLASH p Sector 171 Locked for Forever - S171ROM</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S172ROM</name>
							<description>PFLASH p Sector 172 Locked for Forever - S172ROM</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S173ROM</name>
							<description>PFLASH p Sector 173 Locked for Forever - S173ROM</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S174ROM</name>
							<description>PFLASH p Sector 174 Locked for Forever - S174ROM</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S175ROM</name>
							<description>PFLASH p Sector 175 Locked for Forever - S175ROM</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S176ROM</name>
							<description>PFLASH p Sector 176 Locked for Forever - S176ROM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S177ROM</name>
							<description>PFLASH p Sector 177 Locked for Forever - S177ROM</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S178ROM</name>
							<description>PFLASH p Sector 178 Locked for Forever - S178ROM</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S179ROM</name>
							<description>PFLASH p Sector 179 Locked for Forever - S179ROM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S180ROM</name>
							<description>PFLASH p Sector 180 Locked for Forever - S180ROM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S181ROM</name>
							<description>PFLASH p Sector 181 Locked for Forever - S181ROM</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S182ROM</name>
							<description>PFLASH p Sector 182 Locked for Forever - S182ROM</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S183ROM</name>
							<description>PFLASH p Sector 183 Locked for Forever - S183ROM</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S184ROM</name>
							<description>PFLASH p Sector 184 Locked for Forever - S184ROM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S185ROM</name>
							<description>PFLASH p Sector 185 Locked for Forever - S185ROM</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S186ROM</name>
							<description>PFLASH p Sector 186 Locked for Forever - S186ROM</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S187ROM</name>
							<description>PFLASH p Sector 187 Locked for Forever - S187ROM</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S188ROM</name>
							<description>PFLASH p Sector 188 Locked for Forever - S188ROM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S189ROM</name>
							<description>PFLASH p Sector 189 Locked for Forever - S189ROM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S190ROM</name>
							<description>PFLASH p Sector 190 Locked for Forever - S190ROM</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S191ROM</name>
							<description>PFLASH p Sector 191 Locked for Forever - S191ROM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_PROCONWOP10</name>
					<description>PFLASH Bank 1 WOP Configuration 0</description>
					<addressOffset>0x10180</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S0WOP</name>
							<description>PFLASH p Sector 0 Configured for Write-Once Protection - S0WOP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S1WOP</name>
							<description>PFLASH p Sector 1 Configured for Write-Once Protection - S1WOP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S2WOP</name>
							<description>PFLASH p Sector 2 Configured for Write-Once Protection - S2WOP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S3WOP</name>
							<description>PFLASH p Sector 3 Configured for Write-Once Protection - S3WOP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S4WOP</name>
							<description>PFLASH p Sector 4 Configured for Write-Once Protection - S4WOP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S5WOP</name>
							<description>PFLASH p Sector 5 Configured for Write-Once Protection - S5WOP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S6WOP</name>
							<description>PFLASH p Sector 6 Configured for Write-Once Protection - S6WOP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S7WOP</name>
							<description>PFLASH p Sector 7 Configured for Write-Once Protection - S7WOP</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S8WOP</name>
							<description>PFLASH p Sector 8 Configured for Write-Once Protection - S8WOP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S9WOP</name>
							<description>PFLASH p Sector 9 Configured for Write-Once Protection - S9WOP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S10WOP</name>
							<description>PFLASH p Sector 10 Configured for Write-Once Protection - S10WOP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S11WOP</name>
							<description>PFLASH p Sector 11 Configured for Write-Once Protection - S11WOP</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S12WOP</name>
							<description>PFLASH p Sector 12 Configured for Write-Once Protection - S12WOP</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S13WOP</name>
							<description>PFLASH p Sector 13 Configured for Write-Once Protection - S13WOP</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S14WOP</name>
							<description>PFLASH p Sector 14 Configured for Write-Once Protection - S14WOP</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S15WOP</name>
							<description>PFLASH p Sector 15 Configured for Write-Once Protection - S15WOP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S16WOP</name>
							<description>PFLASH p Sector 16 Configured for Write-Once Protection - S16WOP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S17WOP</name>
							<description>PFLASH p Sector 17 Configured for Write-Once Protection - S17WOP</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S18WOP</name>
							<description>PFLASH p Sector 18 Configured for Write-Once Protection - S18WOP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S19WOP</name>
							<description>PFLASH p Sector 19 Configured for Write-Once Protection - S19WOP</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S20WOP</name>
							<description>PFLASH p Sector 20 Configured for Write-Once Protection - S20WOP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S21WOP</name>
							<description>PFLASH p Sector 21 Configured for Write-Once Protection - S21WOP</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S22WOP</name>
							<description>PFLASH p Sector 22 Configured for Write-Once Protection - S22WOP</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S23WOP</name>
							<description>PFLASH p Sector 23 Configured for Write-Once Protection - S23WOP</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S24WOP</name>
							<description>PFLASH p Sector 24 Configured for Write-Once Protection - S24WOP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S25WOP</name>
							<description>PFLASH p Sector 25 Configured for Write-Once Protection - S25WOP</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S26WOP</name>
							<description>PFLASH p Sector 26 Configured for Write-Once Protection - S26WOP</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S27WOP</name>
							<description>PFLASH p Sector 27 Configured for Write-Once Protection - S27WOP</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S28WOP</name>
							<description>PFLASH p Sector 28 Configured for Write-Once Protection - S28WOP</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S29WOP</name>
							<description>PFLASH p Sector 29 Configured for Write-Once Protection - S29WOP</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S30WOP</name>
							<description>PFLASH p Sector 30 Configured for Write-Once Protection - S30WOP</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S31WOP</name>
							<description>PFLASH p Sector 31 Configured for Write-Once Protection - S31WOP</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
