J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>HP_PROCONWOP11</name>
					<description>PFLASH Bank 1 WOP Configuration 1</description>
					<addressOffset>0x10184</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S32WOP</name>
							<description>PFLASH p Sector 32 Configured for Write-Once Protection - S32WOP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S33WOP</name>
							<description>PFLASH p Sector 33 Configured for Write-Once Protection - S33WOP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S34WOP</name>
							<description>PFLASH p Sector 34 Configured for Write-Once Protection - S34WOP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S35WOP</name>
							<description>PFLASH p Sector 35 Configured for Write-Once Protection - S35WOP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S36WOP</name>
							<description>PFLASH p Sector 36 Configured for Write-Once Protection - S36WOP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S37WOP</name>
							<description>PFLASH p Sector 37 Configured for Write-Once Protection - S37WOP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S38WOP</name>
							<description>PFLASH p Sector 38 Configured for Write-Once Protection - S38WOP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S39WOP</name>
							<description>PFLASH p Sector 39 Configured for Write-Once Protection - S39WOP</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S40WOP</name>
							<description>PFLASH p Sector 40 Configured for Write-Once Protection - S40WOP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S41WOP</name>
							<description>PFLASH p Sector 41 Configured for Write-Once Protection - S41WOP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S42WOP</name>
							<description>PFLASH p Sector 42 Configured for Write-Once Protection - S42WOP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S43WOP</name>
							<description>PFLASH p Sector 43 Configured for Write-Once Protection - S43WOP</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S44WOP</name>
							<description>PFLASH p Sector 44 Configured for Write-Once Protection - S44WOP</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S45WOP</name>
							<description>PFLASH p Sector 45 Configured for Write-Once Protection - S45WOP</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S46WOP</name>
							<description>PFLASH p Sector 46 Configured for Write-Once Protection - S46WOP</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S47WOP</name>
							<description>PFLASH p Sector 47 Configured for Write-Once Protection - S47WOP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S48WOP</name>
							<description>PFLASH p Sector 48 Configured for Write-Once Protection - S48WOP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S49WOP</name>
							<description>PFLASH p Sector 49 Configured for Write-Once Protection - S49WOP</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S50WOP</name>
							<description>PFLASH p Sector 50 Configured for Write-Once Protection - S50WOP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S51WOP</name>
							<description>PFLASH p Sector 51 Configured for Write-Once Protection - S51WOP</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S52WOP</name>
							<description>PFLASH p Sector 52 Configured for Write-Once Protection - S52WOP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S53WOP</name>
							<description>PFLASH p Sector 53 Configured for Write-Once Protection - S53WOP</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S54WOP</name>
							<description>PFLASH p Sector 54 Configured for Write-Once Protection - S54WOP</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S55WOP</name>
							<description>PFLASH p Sector 55 Configured for Write-Once Protection - S55WOP</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S56WOP</name>
							<description>PFLASH p Sector 56 Configured for Write-Once Protection - S56WOP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S57WOP</name>
							<description>PFLASH p Sector 57 Configured for Write-Once Protection - S57WOP</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S58WOP</name>
							<description>PFLASH p Sector 58 Configured for Write-Once Protection - S58WOP</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S59WOP</name>
							<description>PFLASH p Sector 59 Configured for Write-Once Protection - S59WOP</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S60WOP</name>
							<description>PFLASH p Sector 60 Configured for Write-Once Protection - S60WOP</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S61WOP</name>
							<description>PFLASH p Sector 61 Configured for Write-Once Protection - S61WOP</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S62WOP</name>
							<description>PFLASH p Sector 62 Configured for Write-Once Protection - S62WOP</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S63WOP</name>
							<description>PFLASH p Sector 63 Configured for Write-Once Protection - S63WOP</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_PROCONWOP12</name>
					<description>PFLASH Bank 1 WOP Configuration 2</description>
					<addressOffset>0x10188</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S64WOP</name>
							<description>PFLASH p Sector 64 Configured for Write-Once Protection - S64WOP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S65WOP</name>
							<description>PFLASH p Sector 65 Configured for Write-Once Protection - S65WOP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S66WOP</name>
							<description>PFLASH p Sector 66 Configured for Write-Once Protection - S66WOP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S67WOP</name>
							<description>PFLASH p Sector 67 Configured for Write-Once Protection - S67WOP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S68WOP</name>
							<description>PFLASH p Sector 68 Configured for Write-Once Protection - S68WOP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S69WOP</name>
							<description>PFLASH p Sector 69 Configured for Write-Once Protection - S69WOP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S70WOP</name>
							<description>PFLASH p Sector 70 Configured for Write-Once Protection - S70WOP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S71WOP</name>
							<description>PFLASH p Sector 71 Configured for Write-Once Protection - S71WOP</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S72WOP</name>
							<description>PFLASH p Sector 72 Configured for Write-Once Protection - S72WOP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S73WOP</name>
							<description>PFLASH p Sector 73 Configured for Write-Once Protection - S73WOP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S74WOP</name>
							<description>PFLASH p Sector 74 Configured for Write-Once Protection - S74WOP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S75WOP</name>
							<description>PFLASH p Sector 75 Configured for Write-Once Protection - S75WOP</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S76WOP</name>
							<description>PFLASH p Sector 76 Configured for Write-Once Protection - S76WOP</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S77WOP</name>
							<description>PFLASH p Sector 77 Configured for Write-Once Protection - S77WOP</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S78WOP</name>
							<description>PFLASH p Sector 78 Configured for Write-Once Protection - S78WOP</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S79WOP</name>
							<description>PFLASH p Sector 79 Configured for Write-Once Protection - S79WOP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S80WOP</name>
							<description>PFLASH p Sector 80 Configured for Write-Once Protection - S80WOP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S81WOP</name>
							<description>PFLASH p Sector 81 Configured for Write-Once Protection - S81WOP</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S82WOP</name>
							<description>PFLASH p Sector 82 Configured for Write-Once Protection - S82WOP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S83WOP</name>
							<description>PFLASH p Sector 83 Configured for Write-Once Protection - S83WOP</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S84WOP</name>
							<description>PFLASH p Sector 84 Configured for Write-Once Protection - S84WOP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S85WOP</name>
							<description>PFLASH p Sector 85 Configured for Write-Once Protection - S85WOP</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S86WOP</name>
							<description>PFLASH p Sector 86 Configured for Write-Once Protection - S86WOP</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S87WOP</name>
							<description>PFLASH p Sector 87 Configured for Write-Once Protection - S87WOP</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S88WOP</name>
							<description>PFLASH p Sector 88 Configured for Write-Once Protection - S88WOP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S89WOP</name>
							<description>PFLASH p Sector 89 Configured for Write-Once Protection - S89WOP</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S90WOP</name>
							<description>PFLASH p Sector 90 Configured for Write-Once Protection - S90WOP</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S91WOP</name>
							<description>PFLASH p Sector 91 Configured for Write-Once Protection - S91WOP</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S92WOP</name>
							<description>PFLASH p Sector 92 Configured for Write-Once Protection - S92WOP</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S93WOP</name>
							<description>PFLASH p Sector 93 Configured for Write-Once Protection - S93WOP</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S94WOP</name>
							<description>PFLASH p Sector 94 Configured for Write-Once Protection - S94WOP</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S95WOP</name>
							<description>PFLASH p Sector 95 Configured for Write-Once Protection - S95WOP</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
