J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>HP_PROCONWOP13</name>
					<description>PFLASH Bank 1 WOP Configuration 3</description>
					<addressOffset>0x1018C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S96WOP</name>
							<description>PFLASH p Sector 96 Configured for Write-Once Protection - S96WOP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S97WOP</name>
							<description>PFLASH p Sector 97 Configured for Write-Once Protection - S97WOP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S98WOP</name>
							<description>PFLASH p Sector 98 Configured for Write-Once Protection - S98WOP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S99WOP</name>
							<description>PFLASH p Sector 99 Configured for Write-Once Protection - S99WOP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S100WOP</name>
							<description>PFLASH p Sector 100 Configured for Write-Once Protection - S100WOP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S101WOP</name>
							<description>PFLASH p Sector 101 Configured for Write-Once Protection - S101WOP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S102WOP</name>
							<description>PFLASH p Sector 102 Configured for Write-Once Protection - S102WOP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S103WOP</name>
							<description>PFLASH p Sector 103 Configured for Write-Once Protection - S103WOP</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S104WOP</name>
							<description>PFLASH p Sector 104 Configured for Write-Once Protection - S104WOP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S105WOP</name>
							<description>PFLASH p Sector 105 Configured for Write-Once Protection - S105WOP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S106WOP</name>
							<description>PFLASH p Sector 106 Configured for Write-Once Protection - S106WOP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S107WOP</name>
							<description>PFLASH p Sector 107 Configured for Write-Once Protection - S107WOP</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S108WOP</name>
							<description>PFLASH p Sector 108 Configured for Write-Once Protection - S108WOP</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S109WOP</name>
							<description>PFLASH p Sector 109 Configured for Write-Once Protection - S109WOP</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S110WOP</name>
							<description>PFLASH p Sector 110 Configured for Write-Once Protection - S110WOP</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S111WOP</name>
							<description>PFLASH p Sector 111 Configured for Write-Once Protection - S111WOP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S112WOP</name>
							<description>PFLASH p Sector 112 Configured for Write-Once Protection - S112WOP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S113WOP</name>
							<description>PFLASH p Sector 113 Configured for Write-Once Protection - S113WOP</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S114WOP</name>
							<description>PFLASH p Sector 114 Configured for Write-Once Protection - S114WOP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S115WOP</name>
							<description>PFLASH p Sector 115 Configured for Write-Once Protection - S115WOP</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S116WOP</name>
							<description>PFLASH p Sector 116 Configured for Write-Once Protection - S116WOP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S117WOP</name>
							<description>PFLASH p Sector 117 Configured for Write-Once Protection - S117WOP</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S118WOP</name>
							<description>PFLASH p Sector 118 Configured for Write-Once Protection - S118WOP</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S119WOP</name>
							<description>PFLASH p Sector 119 Configured for Write-Once Protection - S119WOP</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S120WOP</name>
							<description>PFLASH p Sector 120 Configured for Write-Once Protection - S120WOP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S121WOP</name>
							<description>PFLASH p Sector 121 Configured for Write-Once Protection - S121WOP</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S122WOP</name>
							<description>PFLASH p Sector 122 Configured for Write-Once Protection - S122WOP</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S123WOP</name>
							<description>PFLASH p Sector 123 Configured for Write-Once Protection - S123WOP</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S124WOP</name>
							<description>PFLASH p Sector 124 Configured for Write-Once Protection - S124WOP</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S125WOP</name>
							<description>PFLASH p Sector 125 Configured for Write-Once Protection - S125WOP</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S126WOP</name>
							<description>PFLASH p Sector 126 Configured for Write-Once Protection - S126WOP</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S127WOP</name>
							<description>PFLASH p Sector 127 Configured for Write-Once Protection - S127WOP</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_PROCONWOP14</name>
					<description>PFLASH Bank 1 WOP Configuration 4</description>
					<addressOffset>0x10190</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S128WOP</name>
							<description>PFLASH p Sector 128 Configured for Write-Once Protection - S128WOP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S129WOP</name>
							<description>PFLASH p Sector 129 Configured for Write-Once Protection - S129WOP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S130WOP</name>
							<description>PFLASH p Sector 130 Configured for Write-Once Protection - S130WOP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S131WOP</name>
							<description>PFLASH p Sector 131 Configured for Write-Once Protection - S131WOP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S132WOP</name>
							<description>PFLASH p Sector 132 Configured for Write-Once Protection - S132WOP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S133WOP</name>
							<description>PFLASH p Sector 133 Configured for Write-Once Protection - S133WOP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S134WOP</name>
							<description>PFLASH p Sector 134 Configured for Write-Once Protection - S134WOP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S135WOP</name>
							<description>PFLASH p Sector 135 Configured for Write-Once Protection - S135WOP</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S136WOP</name>
							<description>PFLASH p Sector 136 Configured for Write-Once Protection - S136WOP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S137WOP</name>
							<description>PFLASH p Sector 137 Configured for Write-Once Protection - S137WOP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S138WOP</name>
							<description>PFLASH p Sector 138 Configured for Write-Once Protection - S138WOP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S139WOP</name>
							<description>PFLASH p Sector 139 Configured for Write-Once Protection - S139WOP</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S140WOP</name>
							<description>PFLASH p Sector 140 Configured for Write-Once Protection - S140WOP</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S141WOP</name>
							<description>PFLASH p Sector 141 Configured for Write-Once Protection - S141WOP</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S142WOP</name>
							<description>PFLASH p Sector 142 Configured for Write-Once Protection - S142WOP</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S143WOP</name>
							<description>PFLASH p Sector 143 Configured for Write-Once Protection - S143WOP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S144WOP</name>
							<description>PFLASH p Sector 144 Configured for Write-Once Protection - S144WOP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S145WOP</name>
							<description>PFLASH p Sector 145 Configured for Write-Once Protection - S145WOP</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S146WOP</name>
							<description>PFLASH p Sector 146 Configured for Write-Once Protection - S146WOP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S147WOP</name>
							<description>PFLASH p Sector 147 Configured for Write-Once Protection - S147WOP</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S148WOP</name>
							<description>PFLASH p Sector 148 Configured for Write-Once Protection - S148WOP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S149WOP</name>
							<description>PFLASH p Sector 149 Configured for Write-Once Protection - S149WOP</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S150WOP</name>
							<description>PFLASH p Sector 150 Configured for Write-Once Protection - S150WOP</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S151WOP</name>
							<description>PFLASH p Sector 151 Configured for Write-Once Protection - S151WOP</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S152WOP</name>
							<description>PFLASH p Sector 152 Configured for Write-Once Protection - S152WOP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S153WOP</name>
							<description>PFLASH p Sector 153 Configured for Write-Once Protection - S153WOP</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S154WOP</name>
							<description>PFLASH p Sector 154 Configured for Write-Once Protection - S154WOP</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S155WOP</name>
							<description>PFLASH p Sector 155 Configured for Write-Once Protection - S155WOP</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S156WOP</name>
							<description>PFLASH p Sector 156 Configured for Write-Once Protection - S156WOP</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S157WOP</name>
							<description>PFLASH p Sector 157 Configured for Write-Once Protection - S157WOP</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S158WOP</name>
							<description>PFLASH p Sector 158 Configured for Write-Once Protection - S158WOP</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S159WOP</name>
							<description>PFLASH p Sector 159 Configured for Write-Once Protection - S159WOP</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
