J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>HP_ECPRIO14</name>
					<description>PFLASH Bank 1 Erase Counter Priority Configuration 4</description>
					<addressOffset>0x101B0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S128L</name>
							<description>PFLASH p Sector 128 Erase Counter priority - S128L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S129L</name>
							<description>PFLASH p Sector 129 Erase Counter priority - S129L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S130L</name>
							<description>PFLASH p Sector 130 Erase Counter priority - S130L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S131L</name>
							<description>PFLASH p Sector 131 Erase Counter priority - S131L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S132L</name>
							<description>PFLASH p Sector 132 Erase Counter priority - S132L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S133L</name>
							<description>PFLASH p Sector 133 Erase Counter priority - S133L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S134L</name>
							<description>PFLASH p Sector 134 Erase Counter priority - S134L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S135L</name>
							<description>PFLASH p Sector 135 Erase Counter priority - S135L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S136L</name>
							<description>PFLASH p Sector 136 Erase Counter priority - S136L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S137L</name>
							<description>PFLASH p Sector 137 Erase Counter priority - S137L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S138L</name>
							<description>PFLASH p Sector 138 Erase Counter priority - S138L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S139L</name>
							<description>PFLASH p Sector 139 Erase Counter priority - S139L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S140L</name>
							<description>PFLASH p Sector 140 Erase Counter priority - S140L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S141L</name>
							<description>PFLASH p Sector 141 Erase Counter priority - S141L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S142L</name>
							<description>PFLASH p Sector 142 Erase Counter priority - S142L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S143L</name>
							<description>PFLASH p Sector 143 Erase Counter priority - S143L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S144L</name>
							<description>PFLASH p Sector 144 Erase Counter priority - S144L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S145L</name>
							<description>PFLASH p Sector 145 Erase Counter priority - S145L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S146L</name>
							<description>PFLASH p Sector 146 Erase Counter priority - S146L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S147L</name>
							<description>PFLASH p Sector 147 Erase Counter priority - S147L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S148L</name>
							<description>PFLASH p Sector 148 Erase Counter priority - S148L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S149L</name>
							<description>PFLASH p Sector 149 Erase Counter priority - S149L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S150L</name>
							<description>PFLASH p Sector 150 Erase Counter priority - S150L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S151L</name>
							<description>PFLASH p Sector 151 Erase Counter priority - S151L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S152L</name>
							<description>PFLASH p Sector 152 Erase Counter priority - S152L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S153L</name>
							<description>PFLASH p Sector 153 Erase Counter priority - S153L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S154L</name>
							<description>PFLASH p Sector 154 Erase Counter priority - S154L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S155L</name>
							<description>PFLASH p Sector 155 Erase Counter priority - S155L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S156L</name>
							<description>PFLASH p Sector 156 Erase Counter priority - S156L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S157L</name>
							<description>PFLASH p Sector 157 Erase Counter priority - S157L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S158L</name>
							<description>PFLASH p Sector 158 Erase Counter priority - S158L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S159L</name>
							<description>PFLASH p Sector 159 Erase Counter priority - S159L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HP_ECPRIO15</name>
					<description>PFLASH Bank 1 Erase Counter Priority Configuration 5</description>
					<addressOffset>0x101B4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>S160L</name>
							<description>PFLASH p Sector 160 Erase Counter priority - S160L</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S161L</name>
							<description>PFLASH p Sector 161 Erase Counter priority - S161L</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S162L</name>
							<description>PFLASH p Sector 162 Erase Counter priority - S162L</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S163L</name>
							<description>PFLASH p Sector 163 Erase Counter priority - S163L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S164L</name>
							<description>PFLASH p Sector 164 Erase Counter priority - S164L</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S165L</name>
							<description>PFLASH p Sector 165 Erase Counter priority - S165L</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S166L</name>
							<description>PFLASH p Sector 166 Erase Counter priority - S166L</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S167L</name>
							<description>PFLASH p Sector 167 Erase Counter priority - S167L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S168L</name>
							<description>PFLASH p Sector 168 Erase Counter priority - S168L</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S169L</name>
							<description>PFLASH p Sector 169 Erase Counter priority - S169L</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S170L</name>
							<description>PFLASH p Sector 170 Erase Counter priority - S170L</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S171L</name>
							<description>PFLASH p Sector 171 Erase Counter priority - S171L</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S172L</name>
							<description>PFLASH p Sector 172 Erase Counter priority - S172L</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S173L</name>
							<description>PFLASH p Sector 173 Erase Counter priority - S173L</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S174L</name>
							<description>PFLASH p Sector 174 Erase Counter priority - S174L</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S175L</name>
							<description>PFLASH p Sector 175 Erase Counter priority - S175L</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S176L</name>
							<description>PFLASH p Sector 176 Erase Counter priority - S176L</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S177L</name>
							<description>PFLASH p Sector 177 Erase Counter priority - S177L</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S178L</name>
							<description>PFLASH p Sector 178 Erase Counter priority - S178L</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S179L</name>
							<description>PFLASH p Sector 179 Erase Counter priority - S179L</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S180L</name>
							<description>PFLASH p Sector 180 Erase Counter priority - S180L</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S181L</name>
							<description>PFLASH p Sector 181 Erase Counter priority - S181L</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S182L</name>
							<description>PFLASH p Sector 182 Erase Counter priority - S182L</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S183L</name>
							<description>PFLASH p Sector 183 Erase Counter priority - S183L</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S184L</name>
							<description>PFLASH p Sector 184 Erase Counter priority - S184L</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S185L</name>
							<description>PFLASH p Sector 185 Erase Counter priority - S185L</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S186L</name>
							<description>PFLASH p Sector 186 Erase Counter priority - S186L</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S187L</name>
							<description>PFLASH p Sector 187 Erase Counter priority - S187L</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S188L</name>
							<description>PFLASH p Sector 188 Erase Counter priority - S188L</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S189L</name>
							<description>PFLASH p Sector 189 Erase Counter priority - S189L</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S190L</name>
							<description>PFLASH p Sector 190 Erase Counter priority - S190L</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>S191L</name>
							<description>PFLASH p Sector 191 Erase Counter priority - S191L</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_STATUS</name>
					<description>HSM Flash Status Register</description>
					<addressOffset>0x20010</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x2</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>D1BUSY</name>
							<description>Data Flash Bank 1 Busy - D1BUSY</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DFPAGE</name>
							<description>Data Flash in Page Mode - DFPAGE</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_CONTROL</name>
					<description>HSM Flash Configuration Register</description>
					<addressOffset>0x20014</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>LCKHSMUCB</name>
							<description>Lock Access to UCB_HSMCFG - LCKHSMUCB</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CPROG</name>
							<description>Clear Programming State - CPROG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CERASE</name>
							<description>Clear Erase State - CERASE</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_OPERATION</name>
					<description>HSM Flash Operation Register</description>
					<addressOffset>0x20018</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PROG</name>
							<description>Programming State - PROG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERASE</name>
							<description>Erase State - ERASE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_EER</name>
					<description>HSM Enable Error Interrupt Control Register</description>
					<addressOffset>0x20030</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OPERM</name>
							<description>Operation Error Interrupt Mask - OPERM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SQERM</name>
							<description>Command Sequence Error Interrupt Mask - SQERM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PVERM</name>
							<description>Program Verify Error Interrupt Mask - PVERM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVERM</name>
							<description>Erase Verify Error Interrupt Mask - EVERM</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EOBM</name>
							<description>End of Busy Interrupt Mask - EOBM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_ERRSR</name>
					<description>HSM Error Status Register</description>
					<addressOffset>0x20034</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OPER</name>
							<description>Flash Operation Error - OPER</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SQER</name>
							<description>Command Sequence Error - SQER</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PVER</name>
							<description>Program Verify Error - PVER</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EVER</name>
							<description>Erase Verify Error - EVER</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_CLRE</name>
					<description>HSM Clear Error Register</description>
					<addressOffset>0x20038</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CSQER</name>
							<description>Clear Command Sequence Error - CSQER</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CPVER</name>
							<description>Clear Program Verify Error - CPVER</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEVER</name>
							<description>Clear Erase Verify Error - CEVER</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_ECCR</name>
					<description>HSM DF1 ECC Read Register</description>
					<addressOffset>0x20040</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RCODE</name>
							<description>Error Correction Read Code - RCODE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>22</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
