J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>SF_ECCS</name>
					<description>HSM DF1 ECC Status Register</description>
					<addressOffset>0x20044</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ERR1</name>
							<description>Read Access Single Bit ECC Error - ERR1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR2</name>
							<description>Read Access Double Bit ECC Error - ERR2</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR3</name>
							<description>Read Access Triple Bit ECC Error - ERR3</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERRM</name>
							<description>Read Access Multi-bit ECC Error - ERRM</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERRANY</name>
							<description>Any Read Access ECC Error - ERRANY</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BLANKA</name>
							<description>Read Access Blank Analog - BLANKA</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AER1</name>
							<description>Accumulated Single Bit ECC Errors - AER1</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AER2</name>
							<description>Accumulated Double Bit ECC Errors - AER2</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AER3</name>
							<description>Accumulated Triple Bit ECC Errors - AER3</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AERM</name>
							<description>Accumulated Multi-bit ECC Errors - AERM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AERANY</name>
							<description>Accumulated Any Read Access ECC Error - AERANY</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ABLANKA</name>
							<description>Accumulated Blank Analog - ABLANKA</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_ECCC</name>
					<description>HSM DF1 ECC Control Register</description>
					<addressOffset>0x20048</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xc0000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CLR</name>
							<description>Clear ECC status bits - CLR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ECCCORDIS</name>
							<description>HSM Command Interface ECC Correction Disable - ECCCORDIS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRAPDIS</name>
							<description>HSM Command Interface Uncorrectable ECC Bit Error Trap Disable - TRAPDIS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_ECCW</name>
					<description>HSM DF1 ECC Write Register</description>
					<addressOffset>0x2004C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>WCODE</name>
							<description>Error Correction Write Code - WCODE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>22</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECCENCDIS</name>
							<description>ECC Encoding Disable - ECCENCDIS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_PROCONUSR</name>
					<description>HSM DF1 User Mode Control</description>
					<addressOffset>0x20074</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MODE</name>
							<description>DF1 User Mode Control - MODE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_SUSPEND</name>
					<description>HSM Suspend Control Register</description>
					<addressOffset>0x200E8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REQ</name>
							<description>Suspend Request - REQ</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLR</name>
							<description>Suspend Clear - CLR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SPND</name>
							<description>Flash Operation Suspended - SPND</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR</name>
							<description>Suspend Error - ERR</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SF_MARGIN</name>
					<description>HSM DF1 Margin Control Register</description>
					<addressOffset>0x200EC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SELD1</name>
							<description>DF1 Margin Read Selection - SELD1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HMARGIN</name>
							<description>Hard Margin Selection - HMARGIN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SP_PROCONHSMCFG</name>
					<description>HSM Protection Configuration</description>
					<addressOffset>0x30000</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HSMBOOTEN</name>
							<description>HSM Boot Enable - HSMBOOTEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SSWWAIT</name>
							<description>SSW Wait - SSWWAIT</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMDX</name>
							<description>HSM Data Sectors Exclusive - HSMDX</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMRAMKEEP</name>
							<description>HSM RAM Clear - HSMRAMKEEP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMENPINS</name>
							<description>Enable HSM Forcing of Pins HSM1/2 - HSMENPINS</description>
							<bitOffset>7</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSMENRES</name>
							<description>Enable HSM Triggering Resets - HSMENRES</description>
							<bitOffset>9</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DESTDBG</name>
							<description>Destructive Debug Entry - DESTDBG</description>
							<bitOffset>11</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BLKFLAN</name>
							<description>Block Flash Analysis - BLKFLAN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SP_PROCONHSMCBS</name>
					<description>HSM Code Boot Sector</description>
					<addressOffset>0x30004</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BOOTSEL0</name>
							<description>Boot Sector Selection - BOOTSEL0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BOOTSEL1</name>
							<description>Boot Sector Selection - BOOTSEL1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BOOTSEL2</name>
							<description>Boot Sector Selection - BOOTSEL2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BOOTSEL3</name>
							<description>Boot Sector Selection - BOOTSEL3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SP_PROCONHSMCX0</name>
					<description>HSM Code Exclusive Protection Configuration</description>
					<addressOffset>0x30008</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HSM0X</name>
							<description>PFLASH Sector 0 HSM Code Exclusive - HSM0X</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM1X</name>
							<description>PFLASH Sector 1 HSM Code Exclusive - HSM1X</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM2X</name>
							<description>PFLASH Sector 2 HSM Code Exclusive - HSM2X</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM3X</name>
							<description>PFLASH Sector 3 HSM Code Exclusive - HSM3X</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM4X</name>
							<description>PFLASH Sector 4 HSM Code Exclusive - HSM4X</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM5X</name>
							<description>PFLASH Sector 5 HSM Code Exclusive - HSM5X</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM6X</name>
							<description>PFLASH Sector 6 HSM Code Exclusive - HSM6X</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM7X</name>
							<description>PFLASH Sector 7 HSM Code Exclusive - HSM7X</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM8X</name>
							<description>PFLASH Sector 8 HSM Code Exclusive - HSM8X</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM9X</name>
							<description>PFLASH Sector 9 HSM Code Exclusive - HSM9X</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM10X</name>
							<description>PFLASH Sector 10 HSM Code Exclusive - HSM10X</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM11X</name>
							<description>PFLASH Sector 11 HSM Code Exclusive - HSM11X</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM12X</name>
							<description>PFLASH Sector 12 HSM Code Exclusive - HSM12X</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM13X</name>
							<description>PFLASH Sector 13 HSM Code Exclusive - HSM13X</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM14X</name>
							<description>PFLASH Sector 14 HSM Code Exclusive - HSM14X</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM15X</name>
							<description>PFLASH Sector 15 HSM Code Exclusive - HSM15X</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM16X</name>
							<description>PFLASH Sector 16 HSM Code Exclusive - HSM16X</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM17X</name>
							<description>PFLASH Sector 17 HSM Code Exclusive - HSM17X</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM18X</name>
							<description>PFLASH Sector 18 HSM Code Exclusive - HSM18X</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM19X</name>
							<description>PFLASH Sector 19 HSM Code Exclusive - HSM19X</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM20X</name>
							<description>PFLASH Sector 20 HSM Code Exclusive - HSM20X</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM21X</name>
							<description>PFLASH Sector 21 HSM Code Exclusive - HSM21X</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM22X</name>
							<description>PFLASH Sector 22 HSM Code Exclusive - HSM22X</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM23X</name>
							<description>PFLASH Sector 23 HSM Code Exclusive - HSM23X</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM24X</name>
							<description>PFLASH Sector 24 HSM Code Exclusive - HSM24X</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM25X</name>
							<description>PFLASH Sector 25 HSM Code Exclusive - HSM25X</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM26X</name>
							<description>PFLASH Sector 26 HSM Code Exclusive - HSM26X</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM27X</name>
							<description>PFLASH Sector 27 HSM Code Exclusive - HSM27X</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM28X</name>
							<description>PFLASH Sector 28 HSM Code Exclusive - HSM28X</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM29X</name>
							<description>PFLASH Sector 29 HSM Code Exclusive - HSM29X</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM30X</name>
							<description>PFLASH Sector 30 HSM Code Exclusive - HSM30X</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM31X</name>
							<description>PFLASH Sector 31 HSM Code Exclusive - HSM31X</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SP_PROCONHSMCX1</name>
					<description>HSM Code Exclusive Protection Configuration</description>
					<addressOffset>0x3000C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HSM32X</name>
							<description>PFLASH Sector 32 HSM Code Exclusive - HSM32X</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM33X</name>
							<description>PFLASH Sector 33 HSM Code Exclusive - HSM33X</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM34X</name>
							<description>PFLASH Sector 34 HSM Code Exclusive - HSM34X</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM35X</name>
							<description>PFLASH Sector 35 HSM Code Exclusive - HSM35X</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM36X</name>
							<description>PFLASH Sector 36 HSM Code Exclusive - HSM36X</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM37X</name>
							<description>PFLASH Sector 37 HSM Code Exclusive - HSM37X</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM38X</name>
							<description>PFLASH Sector 38 HSM Code Exclusive - HSM38X</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM39X</name>
							<description>PFLASH Sector 39 HSM Code Exclusive - HSM39X</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
