J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>DMACH117</name>
					<description>DMA Channel  117 Service Request</description>
					<addressOffset>0x544</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMACH118</name>
					<description>DMA Channel  118 Service Request</description>
					<addressOffset>0x548</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMACH119</name>
					<description>DMA Channel  119 Service Request</description>
					<addressOffset>0x54C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMACH120</name>
					<description>DMA Channel  120 Service Request</description>
					<addressOffset>0x550</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMACH121</name>
					<description>DMA Channel  121 Service Request</description>
					<addressOffset>0x554</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMACH122</name>
					<description>DMA Channel  122 Service Request</description>
					<addressOffset>0x558</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMACH123</name>
					<description>DMA Channel  123 Service Request</description>
					<addressOffset>0x55C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMACH124</name>
					<description>DMA Channel  124 Service Request</description>
					<addressOffset>0x560</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DMACH125</name>
					<description>DMA Channel  125 Service Request</description>
					<addressOffset>0x564</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRPN</name>
							<description>Service Request Priority Number</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRE</name>
							<description>Service Request Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Type of Service Control</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC</name>
							<description>Error Correction Code</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRR</name>
							<description>Service Request Flag</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CLRR</name>
							<description>Request Clear Bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SETR</name>
							<description>Request Set Bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IOV</name>
							<description>Interrupt Trigger Overflow Bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IOVCLR</name>
							<description>Interrupt Trigger Overflow Clear Bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SWS</name>
							<description>SW Sticky Bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWSCLR</name>
							<description>SW Sticky Clear Bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
