J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>AMU00</name>
			<version>100</version>
			<description>ce_amu</description>
			<groupName>AMU00</groupName>
			<baseAddress>0xF8508000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CTRL1</name>
					<description>Control Register 1</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EXPFIX</name>
							<description>Exponent for Fixed Exponent Format - EXPFIX</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VFRMT</name>
							<description>Parameter Matrix V Format - VFRMT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFGSET</name>
							<description>Configuration Set - CFGSET</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EER</name>
					<description>Error Enable Register</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x40007f</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>P7MAX</name>
							<description>Enable Interrupt on P7 Over Maximum Error - P7MAX</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IINF</name>
							<description>Enable Interrupt on Input Infinity Error - IINF</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INAN</name>
							<description>Enable Interrupt on Input NaN Error - INAN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OOV</name>
							<description>Enable Interrupt on Output Overflow - OOV</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ME</name>
							<description>Enable Interrupt on Memory Error - ME</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REGACC</name>
							<description>Enable Interrupt on Register Access during Computation Error - REGACC</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DENORM</name>
							<description>Enable Interrupt on Input Denormalised Number Error - DENORM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECC_STOP</name>
							<description>Stop on ECC Error - ECC_STOP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DENEN</name>
							<description>Enable Stop on Input Denormalised Number Error. - DENEN</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EECN</name>
							<description>Enable Stop Condition Bit - EECN</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P10SINT</name>
					<description>Parameter p10 Register</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>NCROSSING</name>
							<description>Loop Counter Value to Raise Limit Interrupt - NCROSSING</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P6SINT</name>
					<description>Parameter p6 Register</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>NEND</name>
							<description>Max Iteration Counter for Outer Loop - NEND</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P7SINT</name>
					<description>Parameter p7 Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>M</name>
							<description>Max Iteration Counter for Inner Loop - M</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P8SINT</name>
					<description>Parameter p8 Register</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>NSTART</name>
							<description>Start Value for Outer Loop - NSTART</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P9DOUBLELOW32</name>
					<description>Parameter p9 Register</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>P9DOUBLE</name>
							<description>AMU Parameter p9 Register (Double) - P9DOUBLE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P9DOUBLEHIGH32</name>
					<description>Parameter p9 Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>P9DOUBLE</name>
							<description>AMU Parameter p9 Register (Double) - P9DOUBLE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VPFLOAT</name>
					<description>Coefficient Matrix V Register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VPFLOAT</name>
							<description>AMU V Parameter Register (Pointer to Float) - VPFLOAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LPFLOAT</name>
					<description>Coefficient Array L Register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>LPFLOAT</name>
							<description>AMU Coefficient Array L (Pointer to Float) - LPFLOAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P1PFLOAT</name>
					<description>Parameter p1 Register</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>P1PFLOAT</name>
							<description>AMU P1 Parameter Register (Pointer to Float) - P1PFLOAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P2PFLOAT</name>
					<description>Parameter p2 Register</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>P2PFLOAT</name>
							<description>AMU P2 Parameter Register (Pointer to Float) - P2PFLOAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P3PFLOAT</name>
					<description>Parameter p3 Register</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>P3PFLOAT</name>
							<description>AMU P3 Parameter Register (Pointer to Float) - P3PFLOAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P4FLOAT</name>
					<description>Parameter p4 Register</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>P4FLOAT</name>
							<description>AMU P4 Parameter Register (Float) - P4FLOAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P5FLOAT</name>
					<description>Parameter p5 Register</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>P5FLOAT</name>
							<description>AMU P5 Parameter Register (Float) - P5FLOAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UPFLOAT</name>
					<description>Input Vector u Register</description>
					<addressOffset>0x3C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>UPFLOAT</name>
							<description>AMU Input Vector Register (Pointer to Float) - UPFLOAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OLCOMP</name>
					<description>Parameter p8 Register</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CP8H2N</name>
							<description>Trigger Value for switch from half to full speed - CP8H2N</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CPHN2H</name>
							<description>Trigger Value for switch from full to half speed - CPHN2H</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL0</name>
					<description>Control Register 0</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x7000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EN</name>
							<description>Enable Bit - EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENCN</name>
							<description>Enable Condition Bit - ENCN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>READY</name>
							<description>Ready Flag - READY</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SDOWN</name>
							<description>Slowdown Flag - SDOWN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDOWNCN</name>
							<description>Slowdown Condition Bit - SDOWNCN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>LI</name>
							<description>Limit Interrupt - LI</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR</name>
							<description>Error Interrupt - ERR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LIM2RDY</name>
							<description>Limit to Ready Interrupt - LIM2RDY</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RDY2LIM</name>
							<description>Ready to Limit Interrupt - RDY2LIM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SL</name>
							<description>Stop on Limit Interrupt - SL</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REGACCEN</name>
							<description>Allow Register Write when Active - REGACCEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MAX</name>
							<description>Maximum Speed Control - MAX</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MAXCN</name>
							<description>Maximum Speed Condition Bit - MAXCN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ID</name>
							<description>Identifier - ID</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IDCN</name>
							<description>Identifier Condition Bit - IDCN</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CSH</name>
							<description>Current Shaping Enable - CSH</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CSHCN</name>
							<description>Current Shaping Enable Condition Bit - CSHCN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HSPEED</name>
							<description>Half Speed - HSPEED</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HSPEEDCN</name>
							<description>Identifier Condition Bit - HSPEEDCN</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CSHS</name>
							<description>Current Shaping Status - CSHS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ZDOUBLELOW32</name>
					<description>Return Value Register</description>
					<addressOffset>0x80</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0xffffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ZDOUBLE</name>
							<description>AMU Return value z Register (Double) - ZDOUBLE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ZDOUBLEHIGH32</name>
					<description>Return Value Register</description>
					<addressOffset>0x84</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x7fffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ZDOUBLE</name>
							<description>AMU return value z Register (Double) - ZDOUBLE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ZFLOAT</name>
					<description>Return Value Register</description>
					<addressOffset>0x88</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x7fffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ZFLOAT</name>
							<description>AMU Result Register (Float) - ZFLOAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL0MIR</name>
					<description>Control Register 0 Mirror</description>
					<addressOffset>0x8C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x7000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EN</name>
							<description>Enable Bit - EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>READY</name>
							<description>Ready Flag - READY</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SDOWN</name>
							<description>Slowdown Flag - SDOWN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LI</name>
							<description>Limit Interrupt - LI</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ERR</name>
							<description>Error Interrupt - ERR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LIM2RDY</name>
							<description>Limit to Ready Interrupt - LIM2RDY</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RDY2LIM</name>
							<description>Ready to Limit Interrupt - RDY2LIM</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SL</name>
							<description>Stop on Limit Interrupt - SL</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>REGACCEN</name>
							<description>Allow Register Write when Active - REGACCEN</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MAX</name>
							<description>Maximum Speed Control - MAX</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ID</name>
							<description>Identifier - ID</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CSH</name>
							<description>Current Shaping Enable - CSH</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSPEED</name>
							<description>Half Speed - HSPEED</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CSHS</name>
							<description>Current Shaping Status - CSHS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>YDOUBLELOW32</name>
					<description>Intermediate Result yRegister</description>
					<addressOffset>0x90</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0xffffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>YDOUBLE</name>
							<description>AMU v Result Register (Double) - YDOUBLE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>YDOUBLEHIGH32</name>
					<description>Intermediate Result yRegister</description>
					<addressOffset>0x94</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x7fffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>YDOUBLE</name>
							<description>AMU v Result Register (Double) - YDOUBLE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>YFLOAT</name>
					<description>Intermediate Result y Float Register</description>
					<addressOffset>0x98</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x7fffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>YFLOAT</name>
							<description>AMU v Result Register (Float) - YFLOAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
