J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>ERRSR</name>
					<description>Error Status Register</description>
					<addressOffset>0x9C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0xf00</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>P7MAX</name>
							<description>P7 Over Maximum Error - P7MAX</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IINF</name>
							<description>Input Infinity Error - IINF</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INAN</name>
							<description>Input NaN Error - INAN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OOV</name>
							<description>Output Overflow - OOV</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ME</name>
							<description>Memory Error - ME</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>REGACC</name>
							<description>Register Access during Computation Error - REGACC</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DENORM</name>
							<description>Input Denormalised Number Error - DENORM</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ALGOPOS</name>
							<description>Algorithm Position - ALGOPOS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MEU</name>
							<description>Uncorrectable Memory Error - MEU</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SRI_ECC</name>
							<description>Uncorrectable Memory Error - SRI_ECC</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P8SINTMIR</name>
					<description>Interrupt Status Register</description>
					<addressOffset>0xA0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>NSTART</name>
							<description>Start Value for Outer Loop - NSTART</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>UCURRPFLOAT</name>
					<description>Current Input Vector Pointer Register</description>
					<addressOffset>0xA8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>UPFLOAT</name>
							<description>AMU Input Vector Register (Pointer to Float) - UPFLOAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P1CURRPFLOAT</name>
					<description>Current Parameter p1 Pointer Register</description>
					<addressOffset>0xAC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>P1PFLOAT</name>
							<description>AMU Input Vector Register (Pointer to Float) - P1PFLOAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P2CURRPFLOAT</name>
					<description>Current Parameter p2 Pointer Register</description>
					<addressOffset>0xB0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>P2PFLOAT</name>
							<description>AMU Input Vector Register (Pointer to Float) - P2PFLOAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>P3CURRPFLOAT</name>
					<description>Current Parameter p3 Pointer Register</description>
					<addressOffset>0xB4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>P3PFLOAT</name>
							<description>AMU Input Vector Register (Pointer to Float) - P3PFLOAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VCURRPFLOAT</name>
					<description>Current Coefficient Matrix V Pointer Register</description>
					<addressOffset>0xB8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VPFLOAT</name>
							<description>AMU V Coefficient Register (Pointer to Float) - VPFLOAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LCURRPFLOAT</name>
					<description>Current Coefficient Matrix L Pointer Register</description>
					<addressOffset>0xBC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>LPFLOAT</name>
							<description>AMU Coefficient Register (Pointer to Float) - LPFLOAT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
