J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>MODE1</name>
					<description>RP 1 Mode Register</description>
					<addressOffset>0x1304</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MODE</name>
							<description>Resource Partition Supervisor Mode - MODE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MODE2</name>
					<description>RP 2 Mode Register</description>
					<addressOffset>0x1308</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MODE</name>
							<description>Resource Partition Supervisor Mode - MODE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MODE3</name>
					<description>RP 3 Mode Register</description>
					<addressOffset>0x130C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MODE</name>
							<description>Resource Partition Supervisor Mode - MODE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRINTR0</name>
					<description>RP 0 Error Interrupt Set Register</description>
					<addressOffset>0x1320</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SIT</name>
							<description>Set Error Interrupt Service Request - SIT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRINTR1</name>
					<description>RP 1 Error Interrupt Set Register</description>
					<addressOffset>0x1324</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SIT</name>
							<description>Set Error Interrupt Service Request - SIT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRINTR2</name>
					<description>RP 2 Error Interrupt Set Register</description>
					<addressOffset>0x1328</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SIT</name>
							<description>Set Error Interrupt Service Request - SIT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRINTR3</name>
					<description>RP 3 Error Interrupt Set Register</description>
					<addressOffset>0x132C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SIT</name>
							<description>Set Error Interrupt Service Request - SIT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR000</name>
					<description>DMA Channel 000 Resource Partition Register</description>
					<addressOffset>0x1800</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR001</name>
					<description>DMA Channel 001 Resource Partition Register</description>
					<addressOffset>0x1804</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR002</name>
					<description>DMA Channel 002 Resource Partition Register</description>
					<addressOffset>0x1808</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR003</name>
					<description>DMA Channel 003 Resource Partition Register</description>
					<addressOffset>0x180C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR004</name>
					<description>DMA Channel 004 Resource Partition Register</description>
					<addressOffset>0x1810</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR005</name>
					<description>DMA Channel 005 Resource Partition Register</description>
					<addressOffset>0x1814</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR006</name>
					<description>DMA Channel 006 Resource Partition Register</description>
					<addressOffset>0x1818</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR007</name>
					<description>DMA Channel 007 Resource Partition Register</description>
					<addressOffset>0x181C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR008</name>
					<description>DMA Channel 008 Resource Partition Register</description>
					<addressOffset>0x1820</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR009</name>
					<description>DMA Channel 009 Resource Partition Register</description>
					<addressOffset>0x1824</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR010</name>
					<description>DMA Channel 010 Resource Partition Register</description>
					<addressOffset>0x1828</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR011</name>
					<description>DMA Channel 011 Resource Partition Register</description>
					<addressOffset>0x182C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR012</name>
					<description>DMA Channel 012 Resource Partition Register</description>
					<addressOffset>0x1830</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR013</name>
					<description>DMA Channel 013 Resource Partition Register</description>
					<addressOffset>0x1834</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR014</name>
					<description>DMA Channel 014 Resource Partition Register</description>
					<addressOffset>0x1838</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR015</name>
					<description>DMA Channel 015 Resource Partition Register</description>
					<addressOffset>0x183C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR016</name>
					<description>DMA Channel 016 Resource Partition Register</description>
					<addressOffset>0x1840</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR017</name>
					<description>DMA Channel 017 Resource Partition Register</description>
					<addressOffset>0x1844</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR018</name>
					<description>DMA Channel 018 Resource Partition Register</description>
					<addressOffset>0x1848</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR019</name>
					<description>DMA Channel 019 Resource Partition Register</description>
					<addressOffset>0x184C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR020</name>
					<description>DMA Channel 020 Resource Partition Register</description>
					<addressOffset>0x1850</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR021</name>
					<description>DMA Channel 021 Resource Partition Register</description>
					<addressOffset>0x1854</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR022</name>
					<description>DMA Channel 022 Resource Partition Register</description>
					<addressOffset>0x1858</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR023</name>
					<description>DMA Channel 023 Resource Partition Register</description>
					<addressOffset>0x185C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR024</name>
					<description>DMA Channel 024 Resource Partition Register</description>
					<addressOffset>0x1860</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR025</name>
					<description>DMA Channel 025 Resource Partition Register</description>
					<addressOffset>0x1864</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR026</name>
					<description>DMA Channel 026 Resource Partition Register</description>
					<addressOffset>0x1868</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR027</name>
					<description>DMA Channel 027 Resource Partition Register</description>
					<addressOffset>0x186C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR028</name>
					<description>DMA Channel 028 Resource Partition Register</description>
					<addressOffset>0x1870</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR029</name>
					<description>DMA Channel 029 Resource Partition Register</description>
					<addressOffset>0x1874</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR030</name>
					<description>DMA Channel 030 Resource Partition Register</description>
					<addressOffset>0x1878</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR031</name>
					<description>DMA Channel 031 Resource Partition Register</description>
					<addressOffset>0x187C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR032</name>
					<description>DMA Channel 032 Resource Partition Register</description>
					<addressOffset>0x1880</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR033</name>
					<description>DMA Channel 033 Resource Partition Register</description>
					<addressOffset>0x1884</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR034</name>
					<description>DMA Channel 034 Resource Partition Register</description>
					<addressOffset>0x1888</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR035</name>
					<description>DMA Channel 035 Resource Partition Register</description>
					<addressOffset>0x188C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
