J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>HRR079</name>
					<description>DMA Channel 079 Resource Partition Register</description>
					<addressOffset>0x193C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR080</name>
					<description>DMA Channel 080 Resource Partition Register</description>
					<addressOffset>0x1940</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR081</name>
					<description>DMA Channel 081 Resource Partition Register</description>
					<addressOffset>0x1944</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR082</name>
					<description>DMA Channel 082 Resource Partition Register</description>
					<addressOffset>0x1948</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR083</name>
					<description>DMA Channel 083 Resource Partition Register</description>
					<addressOffset>0x194C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR084</name>
					<description>DMA Channel 084 Resource Partition Register</description>
					<addressOffset>0x1950</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR085</name>
					<description>DMA Channel 085 Resource Partition Register</description>
					<addressOffset>0x1954</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR086</name>
					<description>DMA Channel 086 Resource Partition Register</description>
					<addressOffset>0x1958</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR087</name>
					<description>DMA Channel 087 Resource Partition Register</description>
					<addressOffset>0x195C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR088</name>
					<description>DMA Channel 088 Resource Partition Register</description>
					<addressOffset>0x1960</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR089</name>
					<description>DMA Channel 089 Resource Partition Register</description>
					<addressOffset>0x1964</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR090</name>
					<description>DMA Channel 090 Resource Partition Register</description>
					<addressOffset>0x1968</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR091</name>
					<description>DMA Channel 091 Resource Partition Register</description>
					<addressOffset>0x196C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR092</name>
					<description>DMA Channel 092 Resource Partition Register</description>
					<addressOffset>0x1970</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR093</name>
					<description>DMA Channel 093 Resource Partition Register</description>
					<addressOffset>0x1974</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR094</name>
					<description>DMA Channel 094 Resource Partition Register</description>
					<addressOffset>0x1978</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR095</name>
					<description>DMA Channel 095 Resource Partition Register</description>
					<addressOffset>0x197C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR096</name>
					<description>DMA Channel 096 Resource Partition Register</description>
					<addressOffset>0x1980</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR097</name>
					<description>DMA Channel 097 Resource Partition Register</description>
					<addressOffset>0x1984</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR098</name>
					<description>DMA Channel 098 Resource Partition Register</description>
					<addressOffset>0x1988</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR099</name>
					<description>DMA Channel 099 Resource Partition Register</description>
					<addressOffset>0x198C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR100</name>
					<description>DMA Channel 100 Resource Partition Register</description>
					<addressOffset>0x1990</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR101</name>
					<description>DMA Channel 101 Resource Partition Register</description>
					<addressOffset>0x1994</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR102</name>
					<description>DMA Channel 102 Resource Partition Register</description>
					<addressOffset>0x1998</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR103</name>
					<description>DMA Channel 103 Resource Partition Register</description>
					<addressOffset>0x199C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR104</name>
					<description>DMA Channel 104 Resource Partition Register</description>
					<addressOffset>0x19A0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR105</name>
					<description>DMA Channel 105 Resource Partition Register</description>
					<addressOffset>0x19A4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR106</name>
					<description>DMA Channel 106 Resource Partition Register</description>
					<addressOffset>0x19A8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR107</name>
					<description>DMA Channel 107 Resource Partition Register</description>
					<addressOffset>0x19AC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR108</name>
					<description>DMA Channel 108 Resource Partition Register</description>
					<addressOffset>0x19B0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR109</name>
					<description>DMA Channel 109 Resource Partition Register</description>
					<addressOffset>0x19B4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR110</name>
					<description>DMA Channel 110 Resource Partition Register</description>
					<addressOffset>0x19B8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR111</name>
					<description>DMA Channel 111 Resource Partition Register</description>
					<addressOffset>0x19BC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR112</name>
					<description>DMA Channel 112 Resource Partition Register</description>
					<addressOffset>0x19C0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR113</name>
					<description>DMA Channel 113 Resource Partition Register</description>
					<addressOffset>0x19C4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR114</name>
					<description>DMA Channel 114 Resource Partition Register</description>
					<addressOffset>0x19C8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR115</name>
					<description>DMA Channel 115 Resource Partition Register</description>
					<addressOffset>0x19CC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR116</name>
					<description>DMA Channel 116 Resource Partition Register</description>
					<addressOffset>0x19D0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR117</name>
					<description>DMA Channel 117 Resource Partition Register</description>
					<addressOffset>0x19D4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR118</name>
					<description>DMA Channel 118 Resource Partition Register</description>
					<addressOffset>0x19D8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR119</name>
					<description>DMA Channel 119 Resource Partition Register</description>
					<addressOffset>0x19DC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR120</name>
					<description>DMA Channel 120 Resource Partition Register</description>
					<addressOffset>0x19E0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR121</name>
					<description>DMA Channel 121 Resource Partition Register</description>
					<addressOffset>0x19E4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
