J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>HRR122</name>
					<description>DMA Channel 122 Resource Partition Register</description>
					<addressOffset>0x19E8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR123</name>
					<description>DMA Channel 123 Resource Partition Register</description>
					<addressOffset>0x19EC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR124</name>
					<description>DMA Channel 124 Resource Partition Register</description>
					<addressOffset>0x19F0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR125</name>
					<description>DMA Channel 125 Resource Partition Register</description>
					<addressOffset>0x19F4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR126</name>
					<description>DMA Channel 126 Resource Partition Register</description>
					<addressOffset>0x19F8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HRR127</name>
					<description>DMA Channel 127 Resource Partition Register</description>
					<addressOffset>0x19FC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>HRP</name>
							<description>DMA Channel Resource Partition - HRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR000</name>
					<description>DMA Channel 000 Suspend Enable Register</description>
					<addressOffset>0x1A00</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR001</name>
					<description>DMA Channel 001 Suspend Enable Register</description>
					<addressOffset>0x1A04</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR002</name>
					<description>DMA Channel 002 Suspend Enable Register</description>
					<addressOffset>0x1A08</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR003</name>
					<description>DMA Channel 003 Suspend Enable Register</description>
					<addressOffset>0x1A0C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR004</name>
					<description>DMA Channel 004 Suspend Enable Register</description>
					<addressOffset>0x1A10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR005</name>
					<description>DMA Channel 005 Suspend Enable Register</description>
					<addressOffset>0x1A14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR006</name>
					<description>DMA Channel 006 Suspend Enable Register</description>
					<addressOffset>0x1A18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR007</name>
					<description>DMA Channel 007 Suspend Enable Register</description>
					<addressOffset>0x1A1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR008</name>
					<description>DMA Channel 008 Suspend Enable Register</description>
					<addressOffset>0x1A20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR009</name>
					<description>DMA Channel 009 Suspend Enable Register</description>
					<addressOffset>0x1A24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR010</name>
					<description>DMA Channel 010 Suspend Enable Register</description>
					<addressOffset>0x1A28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR011</name>
					<description>DMA Channel 011 Suspend Enable Register</description>
					<addressOffset>0x1A2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR012</name>
					<description>DMA Channel 012 Suspend Enable Register</description>
					<addressOffset>0x1A30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR013</name>
					<description>DMA Channel 013 Suspend Enable Register</description>
					<addressOffset>0x1A34</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR014</name>
					<description>DMA Channel 014 Suspend Enable Register</description>
					<addressOffset>0x1A38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR015</name>
					<description>DMA Channel 015 Suspend Enable Register</description>
					<addressOffset>0x1A3C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR016</name>
					<description>DMA Channel 016 Suspend Enable Register</description>
					<addressOffset>0x1A40</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR017</name>
					<description>DMA Channel 017 Suspend Enable Register</description>
					<addressOffset>0x1A44</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR018</name>
					<description>DMA Channel 018 Suspend Enable Register</description>
					<addressOffset>0x1A48</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR019</name>
					<description>DMA Channel 019 Suspend Enable Register</description>
					<addressOffset>0x1A4C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR020</name>
					<description>DMA Channel 020 Suspend Enable Register</description>
					<addressOffset>0x1A50</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR021</name>
					<description>DMA Channel 021 Suspend Enable Register</description>
					<addressOffset>0x1A54</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR022</name>
					<description>DMA Channel 022 Suspend Enable Register</description>
					<addressOffset>0x1A58</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR023</name>
					<description>DMA Channel 023 Suspend Enable Register</description>
					<addressOffset>0x1A5C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR024</name>
					<description>DMA Channel 024 Suspend Enable Register</description>
					<addressOffset>0x1A60</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR025</name>
					<description>DMA Channel 025 Suspend Enable Register</description>
					<addressOffset>0x1A64</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR026</name>
					<description>DMA Channel 026 Suspend Enable Register</description>
					<addressOffset>0x1A68</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR027</name>
					<description>DMA Channel 027 Suspend Enable Register</description>
					<addressOffset>0x1A6C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR028</name>
					<description>DMA Channel 028 Suspend Enable Register</description>
					<addressOffset>0x1A70</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR029</name>
					<description>DMA Channel 029 Suspend Enable Register</description>
					<addressOffset>0x1A74</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR030</name>
					<description>DMA Channel 030 Suspend Enable Register</description>
					<addressOffset>0x1A78</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR031</name>
					<description>DMA Channel 031 Suspend Enable Register</description>
					<addressOffset>0x1A7C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR032</name>
					<description>DMA Channel 032 Suspend Enable Register</description>
					<addressOffset>0x1A80</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR033</name>
					<description>DMA Channel 033 Suspend Enable Register</description>
					<addressOffset>0x1A84</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR034</name>
					<description>DMA Channel 034 Suspend Enable Register</description>
					<addressOffset>0x1A88</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR035</name>
					<description>DMA Channel 035 Suspend Enable Register</description>
					<addressOffset>0x1A8C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
