J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>SUSENR078</name>
					<description>DMA Channel 078 Suspend Enable Register</description>
					<addressOffset>0x1B38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR079</name>
					<description>DMA Channel 079 Suspend Enable Register</description>
					<addressOffset>0x1B3C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR080</name>
					<description>DMA Channel 080 Suspend Enable Register</description>
					<addressOffset>0x1B40</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR081</name>
					<description>DMA Channel 081 Suspend Enable Register</description>
					<addressOffset>0x1B44</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR082</name>
					<description>DMA Channel 082 Suspend Enable Register</description>
					<addressOffset>0x1B48</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR083</name>
					<description>DMA Channel 083 Suspend Enable Register</description>
					<addressOffset>0x1B4C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR084</name>
					<description>DMA Channel 084 Suspend Enable Register</description>
					<addressOffset>0x1B50</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR085</name>
					<description>DMA Channel 085 Suspend Enable Register</description>
					<addressOffset>0x1B54</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR086</name>
					<description>DMA Channel 086 Suspend Enable Register</description>
					<addressOffset>0x1B58</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR087</name>
					<description>DMA Channel 087 Suspend Enable Register</description>
					<addressOffset>0x1B5C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR088</name>
					<description>DMA Channel 088 Suspend Enable Register</description>
					<addressOffset>0x1B60</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR089</name>
					<description>DMA Channel 089 Suspend Enable Register</description>
					<addressOffset>0x1B64</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR090</name>
					<description>DMA Channel 090 Suspend Enable Register</description>
					<addressOffset>0x1B68</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR091</name>
					<description>DMA Channel 091 Suspend Enable Register</description>
					<addressOffset>0x1B6C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR092</name>
					<description>DMA Channel 092 Suspend Enable Register</description>
					<addressOffset>0x1B70</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR093</name>
					<description>DMA Channel 093 Suspend Enable Register</description>
					<addressOffset>0x1B74</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR094</name>
					<description>DMA Channel 094 Suspend Enable Register</description>
					<addressOffset>0x1B78</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR095</name>
					<description>DMA Channel 095 Suspend Enable Register</description>
					<addressOffset>0x1B7C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR096</name>
					<description>DMA Channel 096 Suspend Enable Register</description>
					<addressOffset>0x1B80</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR097</name>
					<description>DMA Channel 097 Suspend Enable Register</description>
					<addressOffset>0x1B84</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR098</name>
					<description>DMA Channel 098 Suspend Enable Register</description>
					<addressOffset>0x1B88</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR099</name>
					<description>DMA Channel 099 Suspend Enable Register</description>
					<addressOffset>0x1B8C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR100</name>
					<description>DMA Channel 100 Suspend Enable Register</description>
					<addressOffset>0x1B90</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR101</name>
					<description>DMA Channel 101 Suspend Enable Register</description>
					<addressOffset>0x1B94</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR102</name>
					<description>DMA Channel 102 Suspend Enable Register</description>
					<addressOffset>0x1B98</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR103</name>
					<description>DMA Channel 103 Suspend Enable Register</description>
					<addressOffset>0x1B9C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR104</name>
					<description>DMA Channel 104 Suspend Enable Register</description>
					<addressOffset>0x1BA0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR105</name>
					<description>DMA Channel 105 Suspend Enable Register</description>
					<addressOffset>0x1BA4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR106</name>
					<description>DMA Channel 106 Suspend Enable Register</description>
					<addressOffset>0x1BA8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR107</name>
					<description>DMA Channel 107 Suspend Enable Register</description>
					<addressOffset>0x1BAC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR108</name>
					<description>DMA Channel 108 Suspend Enable Register</description>
					<addressOffset>0x1BB0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR109</name>
					<description>DMA Channel 109 Suspend Enable Register</description>
					<addressOffset>0x1BB4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR110</name>
					<description>DMA Channel 110 Suspend Enable Register</description>
					<addressOffset>0x1BB8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR111</name>
					<description>DMA Channel 111 Suspend Enable Register</description>
					<addressOffset>0x1BBC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR112</name>
					<description>DMA Channel 112 Suspend Enable Register</description>
					<addressOffset>0x1BC0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR113</name>
					<description>DMA Channel 113 Suspend Enable Register</description>
					<addressOffset>0x1BC4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR114</name>
					<description>DMA Channel 114 Suspend Enable Register</description>
					<addressOffset>0x1BC8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR115</name>
					<description>DMA Channel 115 Suspend Enable Register</description>
					<addressOffset>0x1BCC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR116</name>
					<description>DMA Channel 116 Suspend Enable Register</description>
					<addressOffset>0x1BD0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR117</name>
					<description>DMA Channel 117 Suspend Enable Register</description>
					<addressOffset>0x1BD4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR118</name>
					<description>DMA Channel 118 Suspend Enable Register</description>
					<addressOffset>0x1BD8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SUSENR119</name>
					<description>DMA Channel 119 Suspend Enable Register</description>
					<addressOffset>0x1BDC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SUSEN</name>
							<description>Channel Suspend Enable for DMA Channel - SUSEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
