J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>TSR029</name>
					<description>DMA Channel 029 Transaction State Register</description>
					<addressOffset>0x1E74</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>DMA Channel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HTRE</name>
							<description>DMA Channel Hardware Request Enable - HTRE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRL</name>
							<description>DMA Channel Transaction/Transfer Request Lost - TRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CH</name>
							<description>DMA Channel Transaction Request State - CH</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ETRL</name>
							<description>Enable DMA Channel Transaction/Transfer Request Lost Interrupt - ETRL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTREQ</name>
							<description>DMA Channel Halt Request - HLTREQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTACK</name>
							<description>DMA Channel Halt Acknowledge - HLTACK</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECH</name>
							<description>Enable DMA Channel Hardware Transaction Request - ECH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCH</name>
							<description>Disable DMA Channel Hardware Transaction Request - DCH</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CTL</name>
							<description>Clear DMA Channel Transaction/Transfer Request Lost - CTL</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HLTCLR</name>
							<description>Clear DMA Channel Halt Request and Acknowledge - HLTCLR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSR030</name>
					<description>DMA Channel 030 Transaction State Register</description>
					<addressOffset>0x1E78</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>DMA Channel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HTRE</name>
							<description>DMA Channel Hardware Request Enable - HTRE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRL</name>
							<description>DMA Channel Transaction/Transfer Request Lost - TRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CH</name>
							<description>DMA Channel Transaction Request State - CH</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ETRL</name>
							<description>Enable DMA Channel Transaction/Transfer Request Lost Interrupt - ETRL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTREQ</name>
							<description>DMA Channel Halt Request - HLTREQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTACK</name>
							<description>DMA Channel Halt Acknowledge - HLTACK</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECH</name>
							<description>Enable DMA Channel Hardware Transaction Request - ECH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCH</name>
							<description>Disable DMA Channel Hardware Transaction Request - DCH</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CTL</name>
							<description>Clear DMA Channel Transaction/Transfer Request Lost - CTL</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HLTCLR</name>
							<description>Clear DMA Channel Halt Request and Acknowledge - HLTCLR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSR031</name>
					<description>DMA Channel 031 Transaction State Register</description>
					<addressOffset>0x1E7C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>DMA Channel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HTRE</name>
							<description>DMA Channel Hardware Request Enable - HTRE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRL</name>
							<description>DMA Channel Transaction/Transfer Request Lost - TRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CH</name>
							<description>DMA Channel Transaction Request State - CH</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ETRL</name>
							<description>Enable DMA Channel Transaction/Transfer Request Lost Interrupt - ETRL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTREQ</name>
							<description>DMA Channel Halt Request - HLTREQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTACK</name>
							<description>DMA Channel Halt Acknowledge - HLTACK</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECH</name>
							<description>Enable DMA Channel Hardware Transaction Request - ECH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCH</name>
							<description>Disable DMA Channel Hardware Transaction Request - DCH</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CTL</name>
							<description>Clear DMA Channel Transaction/Transfer Request Lost - CTL</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HLTCLR</name>
							<description>Clear DMA Channel Halt Request and Acknowledge - HLTCLR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSR032</name>
					<description>DMA Channel 032 Transaction State Register</description>
					<addressOffset>0x1E80</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>DMA Channel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HTRE</name>
							<description>DMA Channel Hardware Request Enable - HTRE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRL</name>
							<description>DMA Channel Transaction/Transfer Request Lost - TRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CH</name>
							<description>DMA Channel Transaction Request State - CH</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ETRL</name>
							<description>Enable DMA Channel Transaction/Transfer Request Lost Interrupt - ETRL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTREQ</name>
							<description>DMA Channel Halt Request - HLTREQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTACK</name>
							<description>DMA Channel Halt Acknowledge - HLTACK</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECH</name>
							<description>Enable DMA Channel Hardware Transaction Request - ECH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCH</name>
							<description>Disable DMA Channel Hardware Transaction Request - DCH</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CTL</name>
							<description>Clear DMA Channel Transaction/Transfer Request Lost - CTL</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HLTCLR</name>
							<description>Clear DMA Channel Halt Request and Acknowledge - HLTCLR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSR033</name>
					<description>DMA Channel 033 Transaction State Register</description>
					<addressOffset>0x1E84</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>DMA Channel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HTRE</name>
							<description>DMA Channel Hardware Request Enable - HTRE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRL</name>
							<description>DMA Channel Transaction/Transfer Request Lost - TRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CH</name>
							<description>DMA Channel Transaction Request State - CH</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ETRL</name>
							<description>Enable DMA Channel Transaction/Transfer Request Lost Interrupt - ETRL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTREQ</name>
							<description>DMA Channel Halt Request - HLTREQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTACK</name>
							<description>DMA Channel Halt Acknowledge - HLTACK</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECH</name>
							<description>Enable DMA Channel Hardware Transaction Request - ECH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCH</name>
							<description>Disable DMA Channel Hardware Transaction Request - DCH</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CTL</name>
							<description>Clear DMA Channel Transaction/Transfer Request Lost - CTL</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HLTCLR</name>
							<description>Clear DMA Channel Halt Request and Acknowledge - HLTCLR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSR034</name>
					<description>DMA Channel 034 Transaction State Register</description>
					<addressOffset>0x1E88</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>DMA Channel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HTRE</name>
							<description>DMA Channel Hardware Request Enable - HTRE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRL</name>
							<description>DMA Channel Transaction/Transfer Request Lost - TRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CH</name>
							<description>DMA Channel Transaction Request State - CH</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ETRL</name>
							<description>Enable DMA Channel Transaction/Transfer Request Lost Interrupt - ETRL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTREQ</name>
							<description>DMA Channel Halt Request - HLTREQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTACK</name>
							<description>DMA Channel Halt Acknowledge - HLTACK</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECH</name>
							<description>Enable DMA Channel Hardware Transaction Request - ECH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCH</name>
							<description>Disable DMA Channel Hardware Transaction Request - DCH</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CTL</name>
							<description>Clear DMA Channel Transaction/Transfer Request Lost - CTL</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HLTCLR</name>
							<description>Clear DMA Channel Halt Request and Acknowledge - HLTCLR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSR035</name>
					<description>DMA Channel 035 Transaction State Register</description>
					<addressOffset>0x1E8C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>DMA Channel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HTRE</name>
							<description>DMA Channel Hardware Request Enable - HTRE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRL</name>
							<description>DMA Channel Transaction/Transfer Request Lost - TRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CH</name>
							<description>DMA Channel Transaction Request State - CH</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ETRL</name>
							<description>Enable DMA Channel Transaction/Transfer Request Lost Interrupt - ETRL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTREQ</name>
							<description>DMA Channel Halt Request - HLTREQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTACK</name>
							<description>DMA Channel Halt Acknowledge - HLTACK</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECH</name>
							<description>Enable DMA Channel Hardware Transaction Request - ECH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCH</name>
							<description>Disable DMA Channel Hardware Transaction Request - DCH</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CTL</name>
							<description>Clear DMA Channel Transaction/Transfer Request Lost - CTL</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HLTCLR</name>
							<description>Clear DMA Channel Halt Request and Acknowledge - HLTCLR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSR036</name>
					<description>DMA Channel 036 Transaction State Register</description>
					<addressOffset>0x1E90</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>DMA Channel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HTRE</name>
							<description>DMA Channel Hardware Request Enable - HTRE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRL</name>
							<description>DMA Channel Transaction/Transfer Request Lost - TRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CH</name>
							<description>DMA Channel Transaction Request State - CH</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ETRL</name>
							<description>Enable DMA Channel Transaction/Transfer Request Lost Interrupt - ETRL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTREQ</name>
							<description>DMA Channel Halt Request - HLTREQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTACK</name>
							<description>DMA Channel Halt Acknowledge - HLTACK</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECH</name>
							<description>Enable DMA Channel Hardware Transaction Request - ECH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCH</name>
							<description>Disable DMA Channel Hardware Transaction Request - DCH</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CTL</name>
							<description>Clear DMA Channel Transaction/Transfer Request Lost - CTL</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HLTCLR</name>
							<description>Clear DMA Channel Halt Request and Acknowledge - HLTCLR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
