J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>TSR061</name>
					<description>DMA Channel 061 Transaction State Register</description>
					<addressOffset>0x1EF4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>DMA Channel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HTRE</name>
							<description>DMA Channel Hardware Request Enable - HTRE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRL</name>
							<description>DMA Channel Transaction/Transfer Request Lost - TRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CH</name>
							<description>DMA Channel Transaction Request State - CH</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ETRL</name>
							<description>Enable DMA Channel Transaction/Transfer Request Lost Interrupt - ETRL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTREQ</name>
							<description>DMA Channel Halt Request - HLTREQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTACK</name>
							<description>DMA Channel Halt Acknowledge - HLTACK</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECH</name>
							<description>Enable DMA Channel Hardware Transaction Request - ECH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCH</name>
							<description>Disable DMA Channel Hardware Transaction Request - DCH</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CTL</name>
							<description>Clear DMA Channel Transaction/Transfer Request Lost - CTL</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HLTCLR</name>
							<description>Clear DMA Channel Halt Request and Acknowledge - HLTCLR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSR062</name>
					<description>DMA Channel 062 Transaction State Register</description>
					<addressOffset>0x1EF8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>DMA Channel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HTRE</name>
							<description>DMA Channel Hardware Request Enable - HTRE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRL</name>
							<description>DMA Channel Transaction/Transfer Request Lost - TRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CH</name>
							<description>DMA Channel Transaction Request State - CH</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ETRL</name>
							<description>Enable DMA Channel Transaction/Transfer Request Lost Interrupt - ETRL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTREQ</name>
							<description>DMA Channel Halt Request - HLTREQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTACK</name>
							<description>DMA Channel Halt Acknowledge - HLTACK</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECH</name>
							<description>Enable DMA Channel Hardware Transaction Request - ECH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCH</name>
							<description>Disable DMA Channel Hardware Transaction Request - DCH</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CTL</name>
							<description>Clear DMA Channel Transaction/Transfer Request Lost - CTL</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HLTCLR</name>
							<description>Clear DMA Channel Halt Request and Acknowledge - HLTCLR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSR063</name>
					<description>DMA Channel 063 Transaction State Register</description>
					<addressOffset>0x1EFC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>DMA Channel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HTRE</name>
							<description>DMA Channel Hardware Request Enable - HTRE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRL</name>
							<description>DMA Channel Transaction/Transfer Request Lost - TRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CH</name>
							<description>DMA Channel Transaction Request State - CH</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ETRL</name>
							<description>Enable DMA Channel Transaction/Transfer Request Lost Interrupt - ETRL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTREQ</name>
							<description>DMA Channel Halt Request - HLTREQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTACK</name>
							<description>DMA Channel Halt Acknowledge - HLTACK</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECH</name>
							<description>Enable DMA Channel Hardware Transaction Request - ECH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCH</name>
							<description>Disable DMA Channel Hardware Transaction Request - DCH</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CTL</name>
							<description>Clear DMA Channel Transaction/Transfer Request Lost - CTL</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HLTCLR</name>
							<description>Clear DMA Channel Halt Request and Acknowledge - HLTCLR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSR064</name>
					<description>DMA Channel 064 Transaction State Register</description>
					<addressOffset>0x1F00</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>DMA Channel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HTRE</name>
							<description>DMA Channel Hardware Request Enable - HTRE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRL</name>
							<description>DMA Channel Transaction/Transfer Request Lost - TRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CH</name>
							<description>DMA Channel Transaction Request State - CH</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ETRL</name>
							<description>Enable DMA Channel Transaction/Transfer Request Lost Interrupt - ETRL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTREQ</name>
							<description>DMA Channel Halt Request - HLTREQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTACK</name>
							<description>DMA Channel Halt Acknowledge - HLTACK</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECH</name>
							<description>Enable DMA Channel Hardware Transaction Request - ECH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCH</name>
							<description>Disable DMA Channel Hardware Transaction Request - DCH</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CTL</name>
							<description>Clear DMA Channel Transaction/Transfer Request Lost - CTL</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HLTCLR</name>
							<description>Clear DMA Channel Halt Request and Acknowledge - HLTCLR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSR065</name>
					<description>DMA Channel 065 Transaction State Register</description>
					<addressOffset>0x1F04</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>DMA Channel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HTRE</name>
							<description>DMA Channel Hardware Request Enable - HTRE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRL</name>
							<description>DMA Channel Transaction/Transfer Request Lost - TRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CH</name>
							<description>DMA Channel Transaction Request State - CH</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ETRL</name>
							<description>Enable DMA Channel Transaction/Transfer Request Lost Interrupt - ETRL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTREQ</name>
							<description>DMA Channel Halt Request - HLTREQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTACK</name>
							<description>DMA Channel Halt Acknowledge - HLTACK</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECH</name>
							<description>Enable DMA Channel Hardware Transaction Request - ECH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCH</name>
							<description>Disable DMA Channel Hardware Transaction Request - DCH</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CTL</name>
							<description>Clear DMA Channel Transaction/Transfer Request Lost - CTL</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HLTCLR</name>
							<description>Clear DMA Channel Halt Request and Acknowledge - HLTCLR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSR066</name>
					<description>DMA Channel 066 Transaction State Register</description>
					<addressOffset>0x1F08</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>DMA Channel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HTRE</name>
							<description>DMA Channel Hardware Request Enable - HTRE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRL</name>
							<description>DMA Channel Transaction/Transfer Request Lost - TRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CH</name>
							<description>DMA Channel Transaction Request State - CH</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ETRL</name>
							<description>Enable DMA Channel Transaction/Transfer Request Lost Interrupt - ETRL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTREQ</name>
							<description>DMA Channel Halt Request - HLTREQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTACK</name>
							<description>DMA Channel Halt Acknowledge - HLTACK</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECH</name>
							<description>Enable DMA Channel Hardware Transaction Request - ECH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCH</name>
							<description>Disable DMA Channel Hardware Transaction Request - DCH</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CTL</name>
							<description>Clear DMA Channel Transaction/Transfer Request Lost - CTL</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HLTCLR</name>
							<description>Clear DMA Channel Halt Request and Acknowledge - HLTCLR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSR067</name>
					<description>DMA Channel 067 Transaction State Register</description>
					<addressOffset>0x1F0C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>DMA Channel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HTRE</name>
							<description>DMA Channel Hardware Request Enable - HTRE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRL</name>
							<description>DMA Channel Transaction/Transfer Request Lost - TRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CH</name>
							<description>DMA Channel Transaction Request State - CH</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ETRL</name>
							<description>Enable DMA Channel Transaction/Transfer Request Lost Interrupt - ETRL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTREQ</name>
							<description>DMA Channel Halt Request - HLTREQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTACK</name>
							<description>DMA Channel Halt Acknowledge - HLTACK</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECH</name>
							<description>Enable DMA Channel Hardware Transaction Request - ECH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCH</name>
							<description>Disable DMA Channel Hardware Transaction Request - DCH</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CTL</name>
							<description>Clear DMA Channel Transaction/Transfer Request Lost - CTL</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HLTCLR</name>
							<description>Clear DMA Channel Halt Request and Acknowledge - HLTCLR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSR068</name>
					<description>DMA Channel 068 Transaction State Register</description>
					<addressOffset>0x1F10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RST</name>
							<description>DMA Channel Reset - RST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HTRE</name>
							<description>DMA Channel Hardware Request Enable - HTRE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRL</name>
							<description>DMA Channel Transaction/Transfer Request Lost - TRL</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CH</name>
							<description>DMA Channel Transaction Request State - CH</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ETRL</name>
							<description>Enable DMA Channel Transaction/Transfer Request Lost Interrupt - ETRL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTREQ</name>
							<description>DMA Channel Halt Request - HLTREQ</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HLTACK</name>
							<description>DMA Channel Halt Acknowledge - HLTACK</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ECH</name>
							<description>Enable DMA Channel Hardware Transaction Request - ECH</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DCH</name>
							<description>Disable DMA Channel Hardware Transaction Request - DCH</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CTL</name>
							<description>Clear DMA Channel Transaction/Transfer Request Lost - CTL</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>HLTCLR</name>
							<description>Clear DMA Channel Halt Request and Acknowledge - HLTCLR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
