J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>ADICR031</name>
					<description>DMARAM Channel 031 Address and Interrupt Control Register</description>
					<addressOffset>0x23F0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SMF</name>
							<description>Source Address Modification Factor - SMF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INCS</name>
							<description>Increment of Source Address - INCS</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMF</name>
							<description>Destination Address Modification Factor - DMF</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INCD</name>
							<description>Increment of Destination Address - INCD</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CBLS</name>
							<description>Circular Buffer Length Source - CBLS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CBLD</name>
							<description>Circular Buffer Length Destination - CBLD</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SHCT</name>
							<description>Shadow Control - SHCT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCBE</name>
							<description>Source Circular Buffer Enable - SCBE</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DCBE</name>
							<description>Destination Circular Buffer Enable - DCBE</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STAMP</name>
							<description>Time Stamp - STAMP</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WRPSE</name>
							<description>Wrap Source Enable - WRPSE</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WRPDE</name>
							<description>Wrap Destination Enable - WRPDE</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INTCT</name>
							<description>Interrupt Control - INTCT</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IRDV</name>
							<description>Interrupt Raise Detect Value - IRDV</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHCFGR031</name>
					<description>DMARAM Channel 031 Configuration Register</description>
					<addressOffset>0x23F4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TREL</name>
							<description>Transfer Reload Value - TREL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BLKM</name>
							<description>Block Mode - BLKM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RROAT</name>
							<description>Reset Request Only After Transaction - RROAT</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHMODE</name>
							<description>Channel Operation Mode - CHMODE</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHDW</name>
							<description>Channel Data Width - CHDW</description>
							<bitOffset>21</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PATSEL</name>
							<description>Pattern Select - PATSEL</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWAP</name>
							<description>Swap Data CRC Byte Order - SWAP</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PRSEL</name>
							<description>Peripheral Request Select - PRSEL</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SHADR031</name>
					<description>DMARAM Channel 031 Shadow Address Register</description>
					<addressOffset>0x23F8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SHADR</name>
							<description>Shadowed Address - SHADR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHCSR031</name>
					<description>DMARAM Channel 031 Control and Status Register</description>
					<addressOffset>0x23FC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TCOUNT</name>
							<description>Transfer Count - TCOUNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LXO</name>
							<description>Old Value of Pattern Detection - LXO</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WRPS</name>
							<description>Wrap Source Buffer - WRPS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WRPD</name>
							<description>Wrap Destination Buffer - WRPD</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICH</name>
							<description>Interrupt from Channel - ICH</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IPM</name>
							<description>Pattern Detection from Channel - IPM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BUFFER</name>
							<description>DMA Double Buffering Active Buffer - BUFFER</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FROZEN</name>
							<description>DMA Double Buffering Frozen Buffer - FROZEN</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWB</name>
							<description>DMA Double Buffering Switch Buffer - SWB</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CWRP</name>
							<description>Clear Wrap Buffer Interrupt - CWRP</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CICH</name>
							<description>Clear Interrupt for DMA Channel - CICH</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SIT</name>
							<description>Set Interrupt Trigger for DMA Channel - SIT</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCH</name>
							<description>Set Transaction Request - SCH</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RDCRCR032</name>
					<description>DMARAM Channel 032 Read Data CRC Register</description>
					<addressOffset>0x2400</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RDCRC</name>
							<description>Read Data CRC - RDCRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SDCRCR032</name>
					<description>DMARAM Channel 032 Source and Destination Address CRC Register</description>
					<addressOffset>0x2404</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SDCRC</name>
							<description>Source and Destination Address CRC - SDCRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SADR032</name>
					<description>DMARAM Channel 032 Source Address Register</description>
					<addressOffset>0x2408</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SADR</name>
							<description>Source Address - SADR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DADR032</name>
					<description>DMARAM Channel 032 Destination Address Register</description>
					<addressOffset>0x240C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DADR</name>
							<description>Destination Address - DADR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ADICR032</name>
					<description>DMARAM Channel 032 Address and Interrupt Control Register</description>
					<addressOffset>0x2410</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SMF</name>
							<description>Source Address Modification Factor - SMF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INCS</name>
							<description>Increment of Source Address - INCS</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMF</name>
							<description>Destination Address Modification Factor - DMF</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INCD</name>
							<description>Increment of Destination Address - INCD</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CBLS</name>
							<description>Circular Buffer Length Source - CBLS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CBLD</name>
							<description>Circular Buffer Length Destination - CBLD</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SHCT</name>
							<description>Shadow Control - SHCT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SCBE</name>
							<description>Source Circular Buffer Enable - SCBE</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DCBE</name>
							<description>Destination Circular Buffer Enable - DCBE</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STAMP</name>
							<description>Time Stamp - STAMP</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WRPSE</name>
							<description>Wrap Source Enable - WRPSE</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WRPDE</name>
							<description>Wrap Destination Enable - WRPDE</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INTCT</name>
							<description>Interrupt Control - INTCT</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IRDV</name>
							<description>Interrupt Raise Detect Value - IRDV</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHCFGR032</name>
					<description>DMARAM Channel 032 Configuration Register</description>
					<addressOffset>0x2414</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TREL</name>
							<description>Transfer Reload Value - TREL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BLKM</name>
							<description>Block Mode - BLKM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RROAT</name>
							<description>Reset Request Only After Transaction - RROAT</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHMODE</name>
							<description>Channel Operation Mode - CHMODE</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHDW</name>
							<description>Channel Data Width - CHDW</description>
							<bitOffset>21</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PATSEL</name>
							<description>Pattern Select - PATSEL</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWAP</name>
							<description>Swap Data CRC Byte Order - SWAP</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PRSEL</name>
							<description>Peripheral Request Select - PRSEL</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SHADR032</name>
					<description>DMARAM Channel 032 Shadow Address Register</description>
					<addressOffset>0x2418</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SHADR</name>
							<description>Shadowed Address - SHADR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHCSR032</name>
					<description>DMARAM Channel 032 Control and Status Register</description>
					<addressOffset>0x241C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TCOUNT</name>
							<description>Transfer Count - TCOUNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LXO</name>
							<description>Old Value of Pattern Detection - LXO</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WRPS</name>
							<description>Wrap Source Buffer - WRPS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WRPD</name>
							<description>Wrap Destination Buffer - WRPD</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ICH</name>
							<description>Interrupt from Channel - ICH</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IPM</name>
							<description>Pattern Detection from Channel - IPM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BUFFER</name>
							<description>DMA Double Buffering Active Buffer - BUFFER</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FROZEN</name>
							<description>DMA Double Buffering Frozen Buffer - FROZEN</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWB</name>
							<description>DMA Double Buffering Switch Buffer - SWB</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CWRP</name>
							<description>Clear Wrap Buffer Interrupt - CWRP</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CICH</name>
							<description>Clear Interrupt for DMA Channel - CICH</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SIT</name>
							<description>Set Interrupt Trigger for DMA Channel - SIT</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCH</name>
							<description>Set Transaction Request - SCH</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RDCRCR033</name>
					<description>DMARAM Channel 033 Read Data CRC Register</description>
					<addressOffset>0x2420</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RDCRC</name>
							<description>Read Data CRC - RDCRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SDCRCR033</name>
					<description>DMARAM Channel 033 Source and Destination Address CRC Register</description>
					<addressOffset>0x2424</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SDCRC</name>
							<description>Source and Destination Address CRC - SDCRC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SADR033</name>
					<description>DMARAM Channel 033 Source Address Register</description>
					<addressOffset>0x2428</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SADR</name>
							<description>Source Address - SADR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DADR033</name>
					<description>DMARAM Channel 033 Destination Address Register</description>
					<addressOffset>0x242C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DADR</name>
							<description>Destination Address - DADR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
