J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>TLTTH</name>
					<description>TG Lines for Trigger to Host</description>
					<addressOffset>0xAC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TL1</name>
							<description>TG Line Enabling for Trigger to Host (TRIG) - TL1</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TL2</name>
							<description>TG Line Enabling for Trigger to Host (TRIG) - TL2</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TL3</name>
							<description>TG Line Enabling for Trigger to Host (TRIG) - TL3</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TL4</name>
							<description>TG Line Enabling for Trigger to Host (TRIG) - TL4</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TL5</name>
							<description>TG Line Enabling for Trigger to Host (TRIG) - TL5</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TL6</name>
							<description>TG Line Enabling for Trigger to Host (TRIG) - TL6</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TL7</name>
							<description>TG Line Enabling for Trigger to Host (TRIG) - TL7</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCCB</name>
					<description>TG Capture for Cores - BRKOUT</description>
					<addressOffset>0xB0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>C0</name>
							<description>Capture of BRKOUT Signal of CPU0 - C0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>C1</name>
							<description>Capture of BRKOUT Signal of CPU1 - C1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>C2</name>
							<description>Capture of BRKOUT Signal of CPU2 - C2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>C3</name>
							<description>Capture of BRKOUT Signal of CPU3 - C3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>C4</name>
							<description>Capture of BRKOUT Signal of CPU4 - C4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>C5</name>
							<description>Capture of BRKOUT Signal of CPU5 - C5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM</name>
							<description>Capture of BRKOUT Signal ofHSM - HSM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCCH</name>
					<description>TG Capture for Cores - HALT</description>
					<addressOffset>0xB4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>C0</name>
							<description>Capture of HALT Signal of CPU0 - C0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>C1</name>
							<description>Capture of HALT Signal of CPU1 - C1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>C2</name>
							<description>Capture of HALT Signal of CPU2 - C2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>C3</name>
							<description>Capture of HALT Signal of CPU3 - C3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>C4</name>
							<description>Capture of HALT Signal of CPU4 - C4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>C5</name>
							<description>Capture of HALT Signal of CPU5 - C5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>HSM</name>
							<description>Capture of HALT Signal ofHSM - HSM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCTGB</name>
					<description>TG Capture for OTGB0/1</description>
					<addressOffset>0xB8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OTGB0</name>
							<description>Capture Bits for OTGB0 - OTGB0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OTGB1</name>
							<description>Capture Bits for OTGB1 - OTGB1</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCM</name>
					<description>TG Capture for MCDS</description>
					<addressOffset>0xBC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BRK</name>
							<description>Capture of MCDS break_out - BRK</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SUS</name>
							<description>Capture of MCDS suspend_out - SUS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>T0</name>
							<description>Capture of MCDS trig_out 0 - T0</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>T1</name>
							<description>Capture of MCDS trig_out 1 - T1</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>T2</name>
							<description>Capture of MCDS trig_out 2 - T2</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>T3</name>
							<description>Capture of MCDS trig_out 3 - T3</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TREC0</name>
					<description>TG Routing Events of CPU0</description>
					<addressOffset>0xC0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TR0EV</name>
							<description>TRxEVT to Trigger Line Routing TR0EV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TR2EV</name>
							<description>TRxEVT to Trigger Line Routing TR2EV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TR4EV</name>
							<description>TRxEVT to Trigger Line Routing TR4EV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TR6EV</name>
							<description>TRxEVT to Trigger Line Routing TR6EV</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TREC1</name>
					<description>TG Routing Events of CPU1</description>
					<addressOffset>0xC4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TR0EV</name>
							<description>TRxEVT to Trigger Line Routing TR0EV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TR2EV</name>
							<description>TRxEVT to Trigger Line Routing TR2EV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TR4EV</name>
							<description>TRxEVT to Trigger Line Routing TR4EV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TR6EV</name>
							<description>TRxEVT to Trigger Line Routing TR6EV</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TREC2</name>
					<description>TG Routing Events of CPU2</description>
					<addressOffset>0xC8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TR0EV</name>
							<description>TRxEVT to Trigger Line Routing TR0EV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TR2EV</name>
							<description>TRxEVT to Trigger Line Routing TR2EV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TR4EV</name>
							<description>TRxEVT to Trigger Line Routing TR4EV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TR6EV</name>
							<description>TRxEVT to Trigger Line Routing TR6EV</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TREC3</name>
					<description>TG Routing Events of CPU3</description>
					<addressOffset>0xCC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TR0EV</name>
							<description>TRxEVT to Trigger Line Routing TR0EV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TR2EV</name>
							<description>TRxEVT to Trigger Line Routing TR2EV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TR4EV</name>
							<description>TRxEVT to Trigger Line Routing TR4EV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TR6EV</name>
							<description>TRxEVT to Trigger Line Routing TR6EV</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TREC4</name>
					<description>TG Routing Events of CPU4</description>
					<addressOffset>0xD0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TR0EV</name>
							<description>TRxEVT to Trigger Line Routing TR0EV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TR2EV</name>
							<description>TRxEVT to Trigger Line Routing TR2EV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TR4EV</name>
							<description>TRxEVT to Trigger Line Routing TR4EV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TR6EV</name>
							<description>TRxEVT to Trigger Line Routing TR6EV</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TREC5</name>
					<description>TG Routing Events of CPU5</description>
					<addressOffset>0xD4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TR0EV</name>
							<description>TRxEVT to Trigger Line Routing TR0EV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TR2EV</name>
							<description>TRxEVT to Trigger Line Routing TR2EV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TR4EV</name>
							<description>TRxEVT to Trigger Line Routing TR4EV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TR6EV</name>
							<description>TRxEVT to Trigger Line Routing TR6EV</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRMT</name>
					<description>TG Routing for MCDS Triggers</description>
					<addressOffset>0xDC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TG0</name>
							<description>MCDS trig_out 0 to Trigger Line Routing - TG0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG1</name>
							<description>MCDS trig_out 1 to Trigger Line Routing - TG1</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG2</name>
							<description>MCDS trig_out 2 to Trigger Line Routing - TG2</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG3</name>
							<description>MCDS trig_out 3 to Trigger Line Routing - TG3</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRTGB0L</name>
					<description>TG Routing for OTGBi Bits [7:0]</description>
					<addressOffset>0xE0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TG0</name>
							<description>OTGBi Bit 0 to Trigger Line Routing - TG0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG1</name>
							<description>OTGBi Bit 1 to Trigger Line Routing - TG1</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG2</name>
							<description>OTGBi Bit 2 to Trigger Line Routing - TG2</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG3</name>
							<description>OTGBi Bit 3 to Trigger Line Routing - TG3</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG4</name>
							<description>OTGBi Bit 4 to Trigger Line Routing - TG4</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG5</name>
							<description>OTGBi Bit 5 to Trigger Line Routing - TG5</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG6</name>
							<description>OTGBi Bit 6 to Trigger Line Routing - TG6</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG7</name>
							<description>OTGBi Bit 7 to Trigger Line Routing - TG7</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRTGB0H</name>
					<description>TG Routing for OTGBi Bits [15:8]</description>
					<addressOffset>0xE4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TG8</name>
							<description>OTGBi Bit 8 to Trigger Line Routing - TG8</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG9</name>
							<description>OTGBi Bit 9 to Trigger Line Routing - TG9</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG10</name>
							<description>OTGBi Bit 10 to Trigger Line Routing - TG10</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG11</name>
							<description>OTGBi Bit 11 to Trigger Line Routing - TG11</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG12</name>
							<description>OTGBi Bit 12 to Trigger Line Routing - TG12</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG13</name>
							<description>OTGBi Bit 13 to Trigger Line Routing - TG13</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG14</name>
							<description>OTGBi Bit 14 to Trigger Line Routing - TG14</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG15</name>
							<description>OTGBi Bit 15 to Trigger Line Routing - TG15</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRTGB1L</name>
					<description>TG Routing for OTGBi Bits [7:0]</description>
					<addressOffset>0xE8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TG0</name>
							<description>OTGBi Bit 0 to Trigger Line Routing - TG0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG1</name>
							<description>OTGBi Bit 1 to Trigger Line Routing - TG1</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG2</name>
							<description>OTGBi Bit 2 to Trigger Line Routing - TG2</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG3</name>
							<description>OTGBi Bit 3 to Trigger Line Routing - TG3</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG4</name>
							<description>OTGBi Bit 4 to Trigger Line Routing - TG4</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG5</name>
							<description>OTGBi Bit 5 to Trigger Line Routing - TG5</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG6</name>
							<description>OTGBi Bit 6 to Trigger Line Routing - TG6</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TG7</name>
							<description>OTGBi Bit 7 to Trigger Line Routing - TG7</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
