J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>ERRADDR3</name>
					<description>SCI 3 Error Address Capture Register</description>
					<addressOffset>0x70</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Transaction Address - ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERR3</name>
					<description>SCI 3 Error Capture Register</description>
					<addressOffset>0x78</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RD_N</name>
							<description>Read Status - RD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WR_N</name>
							<description>Write Status - WR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SVM</name>
							<description>Supervisor Mode Status - SVM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OPC</name>
							<description>Operation Code - OPC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TR_ID</name>
							<description>Transaction ID - TR_ID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDR_EDC</name>
							<description>Address Phase Error Detection Information - ADDR_EDC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MCI_SBS</name>
							<description>MCI Sideband Signals [7:0] - MCI_SBS</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PECON4</name>
					<description>Protocol Error Control Register 4</description>
					<addressOffset>0x80</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PEEN</name>
							<description>Protocol Error Enable - PEEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SETPE</name>
							<description>Set Protocol Error - SETPE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PEACK</name>
							<description>Protocol Error Acknowledge - PEACK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRIORITY4</name>
					<description>SCI4 Arbiter Priority Register</description>
					<addressOffset>0x88</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x70000</resetValue>
					<resetMask>0xfffff000</resetMask>
					<fields>
						<field>
							<name>MCI0_P</name>
							<description>MCI0 Priority - MCI0_P</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI1_P</name>
							<description>MCI1 Priority - MCI1_P</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI2_P</name>
							<description>MCI2 Priority - MCI2_P</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI3_P</name>
							<description>MCI3 Priority - MCI3_P</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI4_P</name>
							<description>MCI4 Priority - MCI4_P</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI5_P</name>
							<description>MCI5 Priority - MCI5_P</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI6_P</name>
							<description>MCI6 Priority - MCI6_P</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI7_P</name>
							<description>MCI7 Priority - MCI7_P</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI8_P</name>
							<description>MCI8 Priority - MCI8_P</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI9_P</name>
							<description>MCI9 Priority - MCI9_P</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI10_P</name>
							<description>MCI10 Priority - MCI10_P</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI11_P</name>
							<description>MCI11 Priority - MCI11_P</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPRS</name>
							<description>High Priority Round Share - HPRS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRADDR4</name>
					<description>SCI 4 Error Address Capture Register</description>
					<addressOffset>0x90</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Transaction Address - ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERR4</name>
					<description>SCI 4 Error Capture Register</description>
					<addressOffset>0x98</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RD_N</name>
							<description>Read Status - RD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WR_N</name>
							<description>Write Status - WR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SVM</name>
							<description>Supervisor Mode Status - SVM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OPC</name>
							<description>Operation Code - OPC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TR_ID</name>
							<description>Transaction ID - TR_ID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDR_EDC</name>
							<description>Address Phase Error Detection Information - ADDR_EDC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MCI_SBS</name>
							<description>MCI Sideband Signals [7:0] - MCI_SBS</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PECON5</name>
					<description>Protocol Error Control Register 5</description>
					<addressOffset>0xA0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PEEN</name>
							<description>Protocol Error Enable - PEEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SETPE</name>
							<description>Set Protocol Error - SETPE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PEACK</name>
							<description>Protocol Error Acknowledge - PEACK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRIORITY5</name>
					<description>SCI5 Arbiter Priority Register</description>
					<addressOffset>0xA8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x70000</resetValue>
					<resetMask>0xfffff000</resetMask>
					<fields>
						<field>
							<name>MCI0_P</name>
							<description>MCI0 Priority - MCI0_P</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI1_P</name>
							<description>MCI1 Priority - MCI1_P</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI2_P</name>
							<description>MCI2 Priority - MCI2_P</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI3_P</name>
							<description>MCI3 Priority - MCI3_P</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI4_P</name>
							<description>MCI4 Priority - MCI4_P</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI5_P</name>
							<description>MCI5 Priority - MCI5_P</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI6_P</name>
							<description>MCI6 Priority - MCI6_P</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI7_P</name>
							<description>MCI7 Priority - MCI7_P</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI8_P</name>
							<description>MCI8 Priority - MCI8_P</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI9_P</name>
							<description>MCI9 Priority - MCI9_P</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI10_P</name>
							<description>MCI10 Priority - MCI10_P</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI11_P</name>
							<description>MCI11 Priority - MCI11_P</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPRS</name>
							<description>High Priority Round Share - HPRS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRADDR5</name>
					<description>SCI 5 Error Address Capture Register</description>
					<addressOffset>0xB0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Transaction Address - ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERR5</name>
					<description>SCI 5 Error Capture Register</description>
					<addressOffset>0xB8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RD_N</name>
							<description>Read Status - RD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WR_N</name>
							<description>Write Status - WR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SVM</name>
							<description>Supervisor Mode Status - SVM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OPC</name>
							<description>Operation Code - OPC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TR_ID</name>
							<description>Transaction ID - TR_ID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDR_EDC</name>
							<description>Address Phase Error Detection Information - ADDR_EDC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MCI_SBS</name>
							<description>MCI Sideband Signals [7:0] - MCI_SBS</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PECON6</name>
					<description>Protocol Error Control Register 6</description>
					<addressOffset>0xC0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PEEN</name>
							<description>Protocol Error Enable - PEEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SETPE</name>
							<description>Set Protocol Error - SETPE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PEACK</name>
							<description>Protocol Error Acknowledge - PEACK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRIORITY6</name>
					<description>SCI6 Arbiter Priority Register</description>
					<addressOffset>0xC8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x70000</resetValue>
					<resetMask>0xfffff000</resetMask>
					<fields>
						<field>
							<name>MCI0_P</name>
							<description>MCI0 Priority - MCI0_P</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI1_P</name>
							<description>MCI1 Priority - MCI1_P</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI2_P</name>
							<description>MCI2 Priority - MCI2_P</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI3_P</name>
							<description>MCI3 Priority - MCI3_P</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI4_P</name>
							<description>MCI4 Priority - MCI4_P</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI5_P</name>
							<description>MCI5 Priority - MCI5_P</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI6_P</name>
							<description>MCI6 Priority - MCI6_P</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI7_P</name>
							<description>MCI7 Priority - MCI7_P</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI8_P</name>
							<description>MCI8 Priority - MCI8_P</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI9_P</name>
							<description>MCI9 Priority - MCI9_P</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI10_P</name>
							<description>MCI10 Priority - MCI10_P</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI11_P</name>
							<description>MCI11 Priority - MCI11_P</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPRS</name>
							<description>High Priority Round Share - HPRS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRADDR6</name>
					<description>SCI 6 Error Address Capture Register</description>
					<addressOffset>0xD0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Transaction Address - ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERR6</name>
					<description>SCI 6 Error Capture Register</description>
					<addressOffset>0xD8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RD_N</name>
							<description>Read Status - RD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WR_N</name>
							<description>Write Status - WR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SVM</name>
							<description>Supervisor Mode Status - SVM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OPC</name>
							<description>Operation Code - OPC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TR_ID</name>
							<description>Transaction ID - TR_ID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDR_EDC</name>
							<description>Address Phase Error Detection Information - ADDR_EDC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MCI_SBS</name>
							<description>MCI Sideband Signals [7:0] - MCI_SBS</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PECON7</name>
					<description>Protocol Error Control Register 7</description>
					<addressOffset>0xE0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PEEN</name>
							<description>Protocol Error Enable - PEEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SETPE</name>
							<description>Set Protocol Error - SETPE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PEACK</name>
							<description>Protocol Error Acknowledge - PEACK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
