J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>PRIORITY14</name>
					<description>SCI14 Arbiter Priority Register</description>
					<addressOffset>0x1C8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x70000</resetValue>
					<resetMask>0xfffff000</resetMask>
					<fields>
						<field>
							<name>MCI0_P</name>
							<description>MCI0 Priority - MCI0_P</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI1_P</name>
							<description>MCI1 Priority - MCI1_P</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI2_P</name>
							<description>MCI2 Priority - MCI2_P</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI3_P</name>
							<description>MCI3 Priority - MCI3_P</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI4_P</name>
							<description>MCI4 Priority - MCI4_P</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI5_P</name>
							<description>MCI5 Priority - MCI5_P</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI6_P</name>
							<description>MCI6 Priority - MCI6_P</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI7_P</name>
							<description>MCI7 Priority - MCI7_P</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI8_P</name>
							<description>MCI8 Priority - MCI8_P</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI9_P</name>
							<description>MCI9 Priority - MCI9_P</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI10_P</name>
							<description>MCI10 Priority - MCI10_P</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI11_P</name>
							<description>MCI11 Priority - MCI11_P</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPRS</name>
							<description>High Priority Round Share - HPRS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRADDR14</name>
					<description>SCI 14 Error Address Capture Register</description>
					<addressOffset>0x1D0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Transaction Address - ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERR14</name>
					<description>SCI 14 Error Capture Register</description>
					<addressOffset>0x1D8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RD_N</name>
							<description>Read Status - RD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WR_N</name>
							<description>Write Status - WR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SVM</name>
							<description>Supervisor Mode Status - SVM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OPC</name>
							<description>Operation Code - OPC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TR_ID</name>
							<description>Transaction ID - TR_ID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDR_EDC</name>
							<description>Address Phase Error Detection Information - ADDR_EDC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MCI_SBS</name>
							<description>MCI Sideband Signals [7:0] - MCI_SBS</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PECON15</name>
					<description>Protocol Error Control Register 15</description>
					<addressOffset>0x1E0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PEEN</name>
							<description>Protocol Error Enable - PEEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SETPE</name>
							<description>Set Protocol Error - SETPE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PEACK</name>
							<description>Protocol Error Acknowledge - PEACK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PRIORITY15</name>
					<description>SCI15 Arbiter Priority Register</description>
					<addressOffset>0x1E8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x70000</resetValue>
					<resetMask>0xfffff000</resetMask>
					<fields>
						<field>
							<name>MCI0_P</name>
							<description>MCI0 Priority - MCI0_P</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI1_P</name>
							<description>MCI1 Priority - MCI1_P</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI2_P</name>
							<description>MCI2 Priority - MCI2_P</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI3_P</name>
							<description>MCI3 Priority - MCI3_P</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI4_P</name>
							<description>MCI4 Priority - MCI4_P</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI5_P</name>
							<description>MCI5 Priority - MCI5_P</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI6_P</name>
							<description>MCI6 Priority - MCI6_P</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI7_P</name>
							<description>MCI7 Priority - MCI7_P</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI8_P</name>
							<description>MCI8 Priority - MCI8_P</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI9_P</name>
							<description>MCI9 Priority - MCI9_P</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI10_P</name>
							<description>MCI10 Priority - MCI10_P</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCI11_P</name>
							<description>MCI11 Priority - MCI11_P</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPRS</name>
							<description>High Priority Round Share - HPRS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERRADDR15</name>
					<description>SCI 15 Error Address Capture Register</description>
					<addressOffset>0x1F0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADDR</name>
							<description>Transaction Address - ADDR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ERR15</name>
					<description>SCI 15 Error Capture Register</description>
					<addressOffset>0x1F8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RD_N</name>
							<description>Read Status - RD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WR_N</name>
							<description>Write Status - WR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SVM</name>
							<description>Supervisor Mode Status - SVM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>OPC</name>
							<description>Operation Code - OPC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TR_ID</name>
							<description>Transaction ID - TR_ID</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ADDR_EDC</name>
							<description>Address Phase Error Detection Information - ADDR_EDC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MCI_SBS</name>
							<description>MCI Sideband Signals [7:0] - MCI_SBS</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Identification Register</description>
					<addressOffset>0x408</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x4d000</resetValue>
					<resetMask>0xffffff00</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number - MOD_REV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type - MOD_TYPE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value - MOD_NUMBER</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PESTAT</name>
					<description>Protocol Error Status Register</description>
					<addressOffset>0x410</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PESCI0</name>
							<description>Protocol Error status of SCI0 - PESCI0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI1</name>
							<description>Protocol Error status of SCI1 - PESCI1</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI2</name>
							<description>Protocol Error status of SCI2 - PESCI2</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI3</name>
							<description>Protocol Error status of SCI3 - PESCI3</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI4</name>
							<description>Protocol Error status of SCI4 - PESCI4</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI5</name>
							<description>Protocol Error status of SCI5 - PESCI5</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI6</name>
							<description>Protocol Error status of SCI6 - PESCI6</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI7</name>
							<description>Protocol Error status of SCI7 - PESCI7</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI8</name>
							<description>Protocol Error status of SCI8 - PESCI8</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI9</name>
							<description>Protocol Error status of SCI9 - PESCI9</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI10</name>
							<description>Protocol Error status of SCI10 - PESCI10</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI11</name>
							<description>Protocol Error status of SCI11 - PESCI11</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI12</name>
							<description>Protocol Error status of SCI12 - PESCI12</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI13</name>
							<description>Protocol Error status of SCI13 - PESCI13</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI14</name>
							<description>Protocol Error status of SCI14 - PESCI14</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PESCI15</name>
							<description>Protocol Error status of SCI15 - PESCI15</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TIDSTAT</name>
					<description>Transaction ID Status Register</description>
					<addressOffset>0x418</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIDSCI0</name>
							<description>Tra0saction ID Error from SCIn Status - TIDSCI0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI1</name>
							<description>Tra1saction ID Error from SCIn Status - TIDSCI1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI2</name>
							<description>Tra2saction ID Error from SCIn Status - TIDSCI2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI3</name>
							<description>Tra3saction ID Error from SCIn Status - TIDSCI3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI4</name>
							<description>Tra4saction ID Error from SCIn Status - TIDSCI4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI5</name>
							<description>Tra5saction ID Error from SCIn Status - TIDSCI5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI6</name>
							<description>Tra6saction ID Error from SCIn Status - TIDSCI6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI7</name>
							<description>Tra7saction ID Error from SCIn Status - TIDSCI7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI8</name>
							<description>Tra8saction ID Error from SCIn Status - TIDSCI8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI9</name>
							<description>Tra9saction ID Error from SCIn Status - TIDSCI9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI10</name>
							<description>Tra10saction ID Error from SCIn Status - TIDSCI10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI11</name>
							<description>Tra11saction ID Error from SCIn Status - TIDSCI11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI12</name>
							<description>Tra12saction ID Error from SCIn Status - TIDSCI12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI13</name>
							<description>Tra13saction ID Error from SCIn Status - TIDSCI13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI14</name>
							<description>Tra14saction ID Error from SCIn Status - TIDSCI14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDSCI15</name>
							<description>Tra15saction ID Error from SCIn Status - TIDSCI15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI0</name>
							<description>Tra0saction ID Error from MCIn Status - TIDMCI0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI1</name>
							<description>Tra1saction ID Error from MCIn Status - TIDMCI1</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI2</name>
							<description>Tra2saction ID Error from MCIn Status - TIDMCI2</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI3</name>
							<description>Tra3saction ID Error from MCIn Status - TIDMCI3</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI4</name>
							<description>Tra4saction ID Error from MCIn Status - TIDMCI4</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI5</name>
							<description>Tra5saction ID Error from MCIn Status - TIDMCI5</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI6</name>
							<description>Tra6saction ID Error from MCIn Status - TIDMCI6</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI7</name>
							<description>Tra7saction ID Error from MCIn Status - TIDMCI7</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI8</name>
							<description>Tra8saction ID Error from MCIn Status - TIDMCI8</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI9</name>
							<description>Tra9saction ID Error from MCIn Status - TIDMCI9</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI10</name>
							<description>Tra10saction ID Error from MCIn Status - TIDMCI10</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIDMCI11</name>
							<description>Tra11saction ID Error from MCIn Status - TIDMCI11</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
