J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>MCXACT12</name>
					<description>Action Definition Register 12</description>
					<addressOffset>0x8B0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AIS0</name>
							<description>Action Input Selector - AIS0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ0</name>
							<description>Action Input Qualifier - AIQ0</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV0</name>
							<description>Action Input Level Mode - LV0</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS1</name>
							<description>Action Input Selector - AIS1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ1</name>
							<description>Action Input Qualifier - AIQ1</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV1</name>
							<description>Action Input Level Mode - LV1</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS2</name>
							<description>Action Input Selector - AIS2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ2</name>
							<description>Action Input Qualifier - AIQ2</description>
							<bitOffset>21</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV2</name>
							<description>Action Input Level Mode - LV2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS3</name>
							<description>Action Input Selector - AIS3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ3</name>
							<description>Action Input Qualifier - AIQ3</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV3</name>
							<description>Action Input Level Mode - LV3</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCXACT13</name>
					<description>Action Definition Register 13</description>
					<addressOffset>0x8B4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AIS0</name>
							<description>Action Input Selector - AIS0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ0</name>
							<description>Action Input Qualifier - AIQ0</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV0</name>
							<description>Action Input Level Mode - LV0</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS1</name>
							<description>Action Input Selector - AIS1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ1</name>
							<description>Action Input Qualifier - AIQ1</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV1</name>
							<description>Action Input Level Mode - LV1</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS2</name>
							<description>Action Input Selector - AIS2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ2</name>
							<description>Action Input Qualifier - AIQ2</description>
							<bitOffset>21</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV2</name>
							<description>Action Input Level Mode - LV2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS3</name>
							<description>Action Input Selector - AIS3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ3</name>
							<description>Action Input Qualifier - AIQ3</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV3</name>
							<description>Action Input Level Mode - LV3</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCXACT14</name>
					<description>Action Definition Register 14</description>
					<addressOffset>0x8B8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AIS0</name>
							<description>Action Input Selector - AIS0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ0</name>
							<description>Action Input Qualifier - AIQ0</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV0</name>
							<description>Action Input Level Mode - LV0</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS1</name>
							<description>Action Input Selector - AIS1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ1</name>
							<description>Action Input Qualifier - AIQ1</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV1</name>
							<description>Action Input Level Mode - LV1</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS2</name>
							<description>Action Input Selector - AIS2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ2</name>
							<description>Action Input Qualifier - AIQ2</description>
							<bitOffset>21</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV2</name>
							<description>Action Input Level Mode - LV2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS3</name>
							<description>Action Input Selector - AIS3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ3</name>
							<description>Action Input Qualifier - AIQ3</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV3</name>
							<description>Action Input Level Mode - LV3</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCXACT15</name>
					<description>Action Definition Register 15</description>
					<addressOffset>0x8BC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AIS0</name>
							<description>Action Input Selector - AIS0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ0</name>
							<description>Action Input Qualifier - AIQ0</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV0</name>
							<description>Action Input Level Mode - LV0</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS1</name>
							<description>Action Input Selector - AIS1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ1</name>
							<description>Action Input Qualifier - AIQ1</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV1</name>
							<description>Action Input Level Mode - LV1</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS2</name>
							<description>Action Input Selector - AIS2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ2</name>
							<description>Action Input Qualifier - AIQ2</description>
							<bitOffset>21</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV2</name>
							<description>Action Input Level Mode - LV2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS3</name>
							<description>Action Input Selector - AIS3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ3</name>
							<description>Action Input Qualifier - AIQ3</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV3</name>
							<description>Action Input Level Mode - LV3</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCXACT16</name>
					<description>Action Definition Register 16</description>
					<addressOffset>0x8C0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AIS0</name>
							<description>Action Input Selector - AIS0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ0</name>
							<description>Action Input Qualifier - AIQ0</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV0</name>
							<description>Action Input Level Mode - LV0</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS1</name>
							<description>Action Input Selector - AIS1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ1</name>
							<description>Action Input Qualifier - AIQ1</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV1</name>
							<description>Action Input Level Mode - LV1</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS2</name>
							<description>Action Input Selector - AIS2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ2</name>
							<description>Action Input Qualifier - AIQ2</description>
							<bitOffset>21</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV2</name>
							<description>Action Input Level Mode - LV2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS3</name>
							<description>Action Input Selector - AIS3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ3</name>
							<description>Action Input Qualifier - AIQ3</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV3</name>
							<description>Action Input Level Mode - LV3</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCXACT17</name>
					<description>Action Definition Register 17</description>
					<addressOffset>0x8C4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AIS0</name>
							<description>Action Input Selector - AIS0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ0</name>
							<description>Action Input Qualifier - AIQ0</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV0</name>
							<description>Action Input Level Mode - LV0</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS1</name>
							<description>Action Input Selector - AIS1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ1</name>
							<description>Action Input Qualifier - AIQ1</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV1</name>
							<description>Action Input Level Mode - LV1</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS2</name>
							<description>Action Input Selector - AIS2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ2</name>
							<description>Action Input Qualifier - AIQ2</description>
							<bitOffset>21</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV2</name>
							<description>Action Input Level Mode - LV2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS3</name>
							<description>Action Input Selector - AIS3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ3</name>
							<description>Action Input Qualifier - AIQ3</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV3</name>
							<description>Action Input Level Mode - LV3</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCXACT18</name>
					<description>Action Definition Register 18</description>
					<addressOffset>0x8C8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AIS0</name>
							<description>Action Input Selector - AIS0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ0</name>
							<description>Action Input Qualifier - AIQ0</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV0</name>
							<description>Action Input Level Mode - LV0</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS1</name>
							<description>Action Input Selector - AIS1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ1</name>
							<description>Action Input Qualifier - AIQ1</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV1</name>
							<description>Action Input Level Mode - LV1</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS2</name>
							<description>Action Input Selector - AIS2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ2</name>
							<description>Action Input Qualifier - AIQ2</description>
							<bitOffset>21</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV2</name>
							<description>Action Input Level Mode - LV2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS3</name>
							<description>Action Input Selector - AIS3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ3</name>
							<description>Action Input Qualifier - AIQ3</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV3</name>
							<description>Action Input Level Mode - LV3</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCXACT19</name>
					<description>Action Definition Register 19</description>
					<addressOffset>0x8CC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AIS0</name>
							<description>Action Input Selector - AIS0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ0</name>
							<description>Action Input Qualifier - AIQ0</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV0</name>
							<description>Action Input Level Mode - LV0</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS1</name>
							<description>Action Input Selector - AIS1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ1</name>
							<description>Action Input Qualifier - AIQ1</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV1</name>
							<description>Action Input Level Mode - LV1</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS2</name>
							<description>Action Input Selector - AIS2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ2</name>
							<description>Action Input Qualifier - AIQ2</description>
							<bitOffset>21</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV2</name>
							<description>Action Input Level Mode - LV2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIS3</name>
							<description>Action Input Selector - AIS3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AIQ3</name>
							<description>Action Input Qualifier - AIQ3</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LV3</name>
							<description>Action Input Level Mode - LV3</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
