J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>TCXCIP</name>
					<description>Current Instruction Pointer</description>
					<addressOffset>0x2008</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CURRENT</name>
							<description>Current Instruction Pointer - CURRENT</description>
							<bitOffset>1</bitOffset>
							<bitWidth>31</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXCFT</name>
					<description>Compact Function Trace Register</description>
					<addressOffset>0x200C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VSHRT_FCT</name>
							<description>Length of very short leaf function - VSHRT_FCT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SHRT_FCT</name>
							<description>Length of short leaf function - SHRT_FCT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXEABND0</name>
					<description>Comparator Bound Register 0</description>
					<addressOffset>0x2400</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BOUND</name>
							<description>Address Comparator range lower bound - BOUND</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXEARNG0</name>
					<description>Comparator Range Register 0</description>
					<addressOffset>0x2404</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xffffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RANGE</name>
							<description>Address Comparator range size - RANGE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXEABND1</name>
					<description>Comparator Bound Register 1</description>
					<addressOffset>0x2410</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BOUND</name>
							<description>Address Comparator range lower bound - BOUND</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXEARNG1</name>
					<description>Comparator Range Register 1</description>
					<addressOffset>0x2414</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xffffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RANGE</name>
							<description>Address Comparator range size - RANGE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXWDBND0</name>
					<description>Comparator Bound Register 0</description>
					<addressOffset>0x2480</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BOUND</name>
							<description>Data Comparator range lower bound - BOUND</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXWDRNG0</name>
					<description>Comparator Range Register 0</description>
					<addressOffset>0x2488</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RANGE</name>
							<description>Data Comparator range size - RANGE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXWDMSK0</name>
					<description>Comparator Mask Register 0</description>
					<addressOffset>0x2490</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xffffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MASK</name>
							<description>Data Comparator bit mask - MASK</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXWDSGN0</name>
					<description>Comparator Sign Register 0</description>
					<addressOffset>0x249C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SIGN</name>
							<description>Bit number of sign bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXWDBND1</name>
					<description>Comparator Bound Register 1</description>
					<addressOffset>0x24A0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BOUND</name>
							<description>Data Comparator range lower bound - BOUND</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXWDRNG1</name>
					<description>Comparator Range Register 1</description>
					<addressOffset>0x24A8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RANGE</name>
							<description>Data Comparator range size - RANGE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXWDMSK1</name>
					<description>Comparator Mask Register 1</description>
					<addressOffset>0x24B0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xffffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MASK</name>
							<description>Data Comparator bit mask - MASK</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXWDSGN1</name>
					<description>Comparator Sign Register 1</description>
					<addressOffset>0x24BC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SIGN</name>
							<description>Bit number of sign bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXACBND0</name>
					<description>Comparator Bound Register 0</description>
					<addressOffset>0x2500</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BOUND</name>
							<description>Mode Comparator range lower bound - BOUND</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXACRNG0</name>
					<description>Comparator Range Register 0</description>
					<addressOffset>0x2504</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RANGE</name>
							<description>Mode Comparator range size - RANGE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXACMSK0</name>
					<description>Comparator Mask Register 0</description>
					<addressOffset>0x2508</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x7fff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SVM</name>
							<description>Comparator bit mask for Supervisor Mode - SVM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MASTER</name>
							<description>Comparator bit mask for Master ID - MASTER</description>
							<bitOffset>1</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SUBCHANNEL</name>
							<description>Comparator bit mask for Sub-channel ID - SUBCHANNEL</description>
							<bitOffset>5</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WR</name>
							<description>Comparator bit mask for Direction Write - WR</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RD</name>
							<description>Comparator bit mask for Direction Read - RD</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MSK</name>
							<description>Bit mask for Transaction Type - MSK</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXACBND1</name>
					<description>Comparator Bound Register 1</description>
					<addressOffset>0x2518</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BOUND</name>
							<description>Mode Comparator range lower bound - BOUND</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXACRNG1</name>
					<description>Comparator Range Register 1</description>
					<addressOffset>0x251C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RANGE</name>
							<description>Mode Comparator range size - RANGE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXACMSK1</name>
					<description>Comparator Mask Register 1</description>
					<addressOffset>0x2520</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x7fff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SVM</name>
							<description>Comparator bit mask for Supervisor Mode - SVM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MASTER</name>
							<description>Comparator bit mask for Master ID - MASTER</description>
							<bitOffset>1</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SUBCHANNEL</name>
							<description>Comparator bit mask for Sub-channel ID - SUBCHANNEL</description>
							<bitOffset>5</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WR</name>
							<description>Comparator bit mask for Direction Write - WR</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RD</name>
							<description>Comparator bit mask for Direction Read - RD</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MSK</name>
							<description>Bit mask for Transaction Type - MSK</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXIPBND0</name>
					<description>Comparator Bound Register 0</description>
					<addressOffset>0x3000</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BOUND</name>
							<description>IP Comparator range lower bound - BOUND</description>
							<bitOffset>1</bitOffset>
							<bitWidth>31</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXIPRNG0</name>
					<description>Comparator Range Register 0</description>
					<addressOffset>0x3004</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xfffffffe</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RANGE</name>
							<description>IP Comparator range size - RANGE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>31</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXIPBND1</name>
					<description>Comparator Bound Register 1</description>
					<addressOffset>0x3010</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BOUND</name>
							<description>IP Comparator range lower bound - BOUND</description>
							<bitOffset>1</bitOffset>
							<bitWidth>31</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCXIPRNG1</name>
					<description>Comparator Range Register 1</description>
					<addressOffset>0x3014</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xfffffffe</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RANGE</name>
							<description>IP Comparator range size - RANGE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>31</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
