J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>TXBCR0</name>
					<description>Tx Buffer Cancellation Request 0</description>
					<addressOffset>0x82D4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CR0</name>
							<description>Cancellation Request Tx Buffer 0 - CR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR1</name>
							<description>Cancellation Request Tx Buffer 1 - CR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR2</name>
							<description>Cancellation Request Tx Buffer 2 - CR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR3</name>
							<description>Cancellation Request Tx Buffer 3 - CR</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR4</name>
							<description>Cancellation Request Tx Buffer 4 - CR</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR5</name>
							<description>Cancellation Request Tx Buffer 5 - CR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR6</name>
							<description>Cancellation Request Tx Buffer 6 - CR</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR7</name>
							<description>Cancellation Request Tx Buffer 7 - CR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR8</name>
							<description>Cancellation Request Tx Buffer 8 - CR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR9</name>
							<description>Cancellation Request Tx Buffer 9 - CR</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR10</name>
							<description>Cancellation Request Tx Buffer 10 - CR</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR11</name>
							<description>Cancellation Request Tx Buffer 11 - CR</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR12</name>
							<description>Cancellation Request Tx Buffer 12 - CR</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR13</name>
							<description>Cancellation Request Tx Buffer 13 - CR</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR14</name>
							<description>Cancellation Request Tx Buffer 14 - CR</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR15</name>
							<description>Cancellation Request Tx Buffer 15 - CR</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR16</name>
							<description>Cancellation Request Tx Buffer 16 - CR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR17</name>
							<description>Cancellation Request Tx Buffer 17 - CR</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR18</name>
							<description>Cancellation Request Tx Buffer 18 - CR</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR19</name>
							<description>Cancellation Request Tx Buffer 19 - CR</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR20</name>
							<description>Cancellation Request Tx Buffer 20 - CR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR21</name>
							<description>Cancellation Request Tx Buffer 21 - CR</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR22</name>
							<description>Cancellation Request Tx Buffer 22 - CR</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR23</name>
							<description>Cancellation Request Tx Buffer 23 - CR</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR24</name>
							<description>Cancellation Request Tx Buffer 24 - CR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR25</name>
							<description>Cancellation Request Tx Buffer 25 - CR</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR26</name>
							<description>Cancellation Request Tx Buffer 26 - CR</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR27</name>
							<description>Cancellation Request Tx Buffer 27 - CR</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR28</name>
							<description>Cancellation Request Tx Buffer 28 - CR</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR29</name>
							<description>Cancellation Request Tx Buffer 29 - CR</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR30</name>
							<description>Cancellation Request Tx Buffer 30 - CR</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR31</name>
							<description>Cancellation Request Tx Buffer 31 - CR</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXBTO0</name>
					<description>Tx Buffer Transmission Occurred 0</description>
					<addressOffset>0x82D8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TO0</name>
							<description>Transmission Occurred Tx Buffer 0 - TO</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO1</name>
							<description>Transmission Occurred Tx Buffer 1 - TO</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO2</name>
							<description>Transmission Occurred Tx Buffer 2 - TO</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO3</name>
							<description>Transmission Occurred Tx Buffer 3 - TO</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO4</name>
							<description>Transmission Occurred Tx Buffer 4 - TO</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO5</name>
							<description>Transmission Occurred Tx Buffer 5 - TO</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO6</name>
							<description>Transmission Occurred Tx Buffer 6 - TO</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO7</name>
							<description>Transmission Occurred Tx Buffer 7 - TO</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO8</name>
							<description>Transmission Occurred Tx Buffer 8 - TO</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO9</name>
							<description>Transmission Occurred Tx Buffer 9 - TO</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO10</name>
							<description>Transmission Occurred Tx Buffer 10 - TO</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO11</name>
							<description>Transmission Occurred Tx Buffer 11 - TO</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO12</name>
							<description>Transmission Occurred Tx Buffer 12 - TO</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO13</name>
							<description>Transmission Occurred Tx Buffer 13 - TO</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO14</name>
							<description>Transmission Occurred Tx Buffer 14 - TO</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO15</name>
							<description>Transmission Occurred Tx Buffer 15 - TO</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO16</name>
							<description>Transmission Occurred Tx Buffer 16 - TO</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO17</name>
							<description>Transmission Occurred Tx Buffer 17 - TO</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO18</name>
							<description>Transmission Occurred Tx Buffer 18 - TO</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO19</name>
							<description>Transmission Occurred Tx Buffer 19 - TO</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO20</name>
							<description>Transmission Occurred Tx Buffer 20 - TO</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO21</name>
							<description>Transmission Occurred Tx Buffer 21 - TO</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO22</name>
							<description>Transmission Occurred Tx Buffer 22 - TO</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO23</name>
							<description>Transmission Occurred Tx Buffer 23 - TO</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO24</name>
							<description>Transmission Occurred Tx Buffer 24 - TO</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO25</name>
							<description>Transmission Occurred Tx Buffer 25 - TO</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO26</name>
							<description>Transmission Occurred Tx Buffer 26 - TO</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO27</name>
							<description>Transmission Occurred Tx Buffer 27 - TO</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO28</name>
							<description>Transmission Occurred Tx Buffer 28 - TO</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO29</name>
							<description>Transmission Occurred Tx Buffer 29 - TO</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO30</name>
							<description>Transmission Occurred Tx Buffer 30 - TO</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TO31</name>
							<description>Transmission Occurred Tx Buffer 31 - TO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXBCF0</name>
					<description>Tx Buffer Cancellation Finished 0</description>
					<addressOffset>0x82DC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CF0</name>
							<description>Cancellation Finished Tx Buffer 0 - CF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF1</name>
							<description>Cancellation Finished Tx Buffer 1 - CF</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF2</name>
							<description>Cancellation Finished Tx Buffer 2 - CF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF3</name>
							<description>Cancellation Finished Tx Buffer 3 - CF</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF4</name>
							<description>Cancellation Finished Tx Buffer 4 - CF</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF5</name>
							<description>Cancellation Finished Tx Buffer 5 - CF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF6</name>
							<description>Cancellation Finished Tx Buffer 6 - CF</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF7</name>
							<description>Cancellation Finished Tx Buffer 7 - CF</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF8</name>
							<description>Cancellation Finished Tx Buffer 8 - CF</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF9</name>
							<description>Cancellation Finished Tx Buffer 9 - CF</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF10</name>
							<description>Cancellation Finished Tx Buffer 10 - CF</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF11</name>
							<description>Cancellation Finished Tx Buffer 11 - CF</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF12</name>
							<description>Cancellation Finished Tx Buffer 12 - CF</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF13</name>
							<description>Cancellation Finished Tx Buffer 13 - CF</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF14</name>
							<description>Cancellation Finished Tx Buffer 14 - CF</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF15</name>
							<description>Cancellation Finished Tx Buffer 15 - CF</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF16</name>
							<description>Cancellation Finished Tx Buffer 16 - CF</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF17</name>
							<description>Cancellation Finished Tx Buffer 17 - CF</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF18</name>
							<description>Cancellation Finished Tx Buffer 18 - CF</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF19</name>
							<description>Cancellation Finished Tx Buffer 19 - CF</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF20</name>
							<description>Cancellation Finished Tx Buffer 20 - CF</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF21</name>
							<description>Cancellation Finished Tx Buffer 21 - CF</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF22</name>
							<description>Cancellation Finished Tx Buffer 22 - CF</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF23</name>
							<description>Cancellation Finished Tx Buffer 23 - CF</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF24</name>
							<description>Cancellation Finished Tx Buffer 24 - CF</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF25</name>
							<description>Cancellation Finished Tx Buffer 25 - CF</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF26</name>
							<description>Cancellation Finished Tx Buffer 26 - CF</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF27</name>
							<description>Cancellation Finished Tx Buffer 27 - CF</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF28</name>
							<description>Cancellation Finished Tx Buffer 28 - CF</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF29</name>
							<description>Cancellation Finished Tx Buffer 29 - CF</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF30</name>
							<description>Cancellation Finished Tx Buffer 30 - CF</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CF31</name>
							<description>Cancellation Finished Tx Buffer 31 - CF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
