J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>TTMLM0</name>
					<description>TT Matrix Limits 0</description>
					<addressOffset>0x830C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CCM</name>
							<description>Cycle Count Max - CCM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CSS</name>
							<description>Cycle Start Synchronization - CSS</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXEW</name>
							<description>Tx Enable Window - TXEW</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENTT</name>
							<description>Expected Number of Tx Triggers - ENTT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TURCF0</name>
					<description>TUR Configuration 0</description>
					<addressOffset>0x8310</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x10000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>NCL</name>
							<description>Numerator Configuration Low - NCL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DC</name>
							<description>Denominator Configuration - DC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ELT</name>
							<description>Enable Local Time - ELT</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TTOCN0</name>
					<description>TT Operation Control 0</description>
					<addressOffset>0x8314</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SGT</name>
							<description>Set Global time - SGT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECS</name>
							<description>External Clock Synchronization - ECS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWP</name>
							<description>Stop Watch Polarity - SWP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWS</name>
							<description>Stop Watch Source - SWS</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTIE</name>
							<description>Register Time Mark Interrupt Pulse Enable - RTIE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TMC</name>
							<description>Register Time Mark Compare - TMC</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TTIE</name>
							<description>Trigger Time Mark Interrupt Pulse Enable - TTIE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GCS</name>
							<description>Gap Control Select - GCS</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FGP</name>
							<description>Finish Gap - FGP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TMG</name>
							<description>Time Mark Gap - TMG</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NIG</name>
							<description>Next is Gap - NIG</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ESCN</name>
							<description>External Synchronization Control - ESCN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCKC</name>
							<description>TT Operation Control Register Locked - LCKC</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TTGTP0</name>
					<description>TT Global Time Preset 0</description>
					<addressOffset>0x8318</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TP</name>
							<description>Time Preset - TP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CTP</name>
							<description>Cycle Time Target Phase - CTP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TTTMK0</name>
					<description>TT Time Mark 0</description>
					<addressOffset>0x831C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TM</name>
							<description>Time Mark - TM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TICC</name>
							<description>Time Mark Cycle Code - TICC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCKM</name>
							<description>TT Time Mark Register Locked - LCKM</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TTIR0</name>
					<description>TT Interrupt Register 0</description>
					<addressOffset>0x8320</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SBC</name>
							<description>Start of Basic Cycle - SBC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SMC</name>
							<description>Start of Matrix Cycle - SMC</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CSM</name>
							<description>Change of Synchronization Mode - CSM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SOG</name>
							<description>Start of Gap - SOG</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTMI</name>
							<description>Register Time Mark Interrupt - RTMI</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TTMI</name>
							<description>Trigger Time Mark Event Internal - TTMI</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWE</name>
							<description>Stop Watch Polarity - SWE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GTW</name>
							<description>Global Time Wrap - GTW</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GTD</name>
							<description>Global Time Discontinuity - GTD</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GTE</name>
							<description>Global Time Error - GTE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXU</name>
							<description>Tx Count Underflow - TXU</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXO</name>
							<description>Tx Count Overflow - TXO</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SE1</name>
							<description>Scheduling Error 1 - SE1</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SE2</name>
							<description>Scheduling Error 2 - SE2</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ELC</name>
							<description>Error Level Changed - ELC</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IWT</name>
							<description>Initialization Watch Trigger - IWT</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WT</name>
							<description>Watch Trigger - WT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AW</name>
							<description>Application Watchdog - AW</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CER</name>
							<description>Configuration Error - CER</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TTIE0</name>
					<description>TT Interrupt Enable 0</description>
					<addressOffset>0x8324</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SBCE</name>
							<description>Start of Basic Cycle Interrupt Enable - SBCE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SMCE</name>
							<description>Start of Matrix Cycle Interrupt Enable - SMCE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CSME</name>
							<description>Change of Synchronization Mode Interrupt Enable - CSME</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SOGE</name>
							<description>Start of Gap Interrupt Enable - SOGE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTMIE</name>
							<description>Register Time Mark Interrupt Enable - RTMIE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TTMIE</name>
							<description>Trigger Time Mark Event Internal Interrupt Enable - TTMIE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWEE</name>
							<description>Stop Watch Polarity Interrupt Enable - SWEE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GTWE</name>
							<description>Global Time Wrap Interrupt Enable - GTWE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GTDE</name>
							<description>Global Time Discontinuity Interrupt Enable - GTDE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GTEE</name>
							<description>Global Time Error Interrupt Enable - GTEE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXUE</name>
							<description>Tx Count Underflow Interrupt Enable - TXUE</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXOE</name>
							<description>Tx Count Overflow Interrupt Enable - TXOE</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SE1E</name>
							<description>Scheduling Error 1 Interrupt Enable - SE1E</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SE2E</name>
							<description>Scheduling Error 2 Interrupt Enable - SE2E</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ELCE</name>
							<description>Change Error Level Interrupt Enable - ELCE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IWTE</name>
							<description>Initialization Watch Trigger Interrupt Enable - IWTE</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WTE</name>
							<description>Watch Trigger Interrupt Enable - WTE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AWE</name>
							<description>Application Watchdog Interrupt Enable - AWE</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CERE</name>
							<description>Configuration Error Interrupt Enable - CERE</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TTOST0</name>
					<description>TT Operation Status 0</description>
					<addressOffset>0x832C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x20000080</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EL</name>
							<description>Error Level - EL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MS</name>
							<description>Master State - MS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SYS</name>
							<description>Synchronization State - SYS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>QGTP</name>
							<description>Quality of Global Time Phase - QGTP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>QCS</name>
							<description>Quality of Clock Speed - QCS</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RTO</name>
							<description>Reference Trigger Offset - RTO</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WGTD</name>
							<description>Wait for Global Time Discontinuity - WGTD</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GFI</name>
							<description>Gap Finished Indicator - GFI</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TMP</name>
							<description>Time Master Priority - TMP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GSI</name>
							<description>Gap Started Indicator - GSI</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WFE</name>
							<description>Wait for Event - WFE</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AWE</name>
							<description>Application Watchdog Event - AWE</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WECS</name>
							<description>Wait for External Clock Synchronization - WECS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SPL</name>
							<description>Schedule Phase Lock - SPL</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TURNA0</name>
					<description>TUR Numerator Actual 0</description>
					<addressOffset>0x8330</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x10000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>NAV</name>
							<description>Numerator Actual Value - NAV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>18</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TTLGT0</name>
					<description>TT Local &amp; Global Time 0</description>
					<addressOffset>0x8334</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>LT</name>
							<description>Local Time - LT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GT</name>
							<description>Global Time - GT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TTCTC0</name>
					<description>TT Cycle Time &amp; Count 0</description>
					<addressOffset>0x8338</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x3f0000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CT</name>
							<description>Cycle Time - CT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CC</name>
							<description>Cycle Count - CC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TTCPT0</name>
					<description>TT Capture Time 0</description>
					<addressOffset>0x833C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CCV</name>
							<description>Cycle Count Value - CCV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SWV</name>
							<description>Stop Watch Value - SWV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TTCSM0</name>
					<description>TT Cycle Sync Mark 0</description>
					<addressOffset>0x8340</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CSM</name>
							<description>Cycle Sync Mark - CSM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
