J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>CREL1</name>
					<description>Core Release Register 1</description>
					<addressOffset>0x8600</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x32150320</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DAY</name>
							<description>Time Stamp Day</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MON</name>
							<description>Time Stamp Month</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>YEAR</name>
							<description>Time Stamp Year</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SUBSTEP</name>
							<description>Sub-step of Core Release - SUBSTEP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>STEP</name>
							<description>Step of Core Release - STEP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>REL</name>
							<description>Core Release - REL</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ENDN1</name>
					<description>Endian Register 1</description>
					<addressOffset>0x8604</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x87654321</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ETV</name>
							<description>Endianness Test Value - ETV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DBTP1</name>
					<description>Data Bit Timing &amp; Prescaler Register 1</description>
					<addressOffset>0x860C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xa33</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DSJW</name>
							<description>Data (Re) Synchronization Jump Width - DSJW</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTSEG2</name>
							<description>Data time segment after sample point - DTSEG2</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTSEG1</name>
							<description>Data time segment before sample point - DTSEG1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DBRP</name>
							<description>Data Baud Rate Prescaler - DBRP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TDC</name>
							<description>Transmitter Delay Compensation - TDC</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TEST1</name>
					<description>Test Register 1</description>
					<addressOffset>0x8610</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffff7f</resetMask>
					<fields>
						<field>
							<name>LBCK</name>
							<description>Loop Back Mode - LBCK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TX</name>
							<description>Control of Transmit Pin - TX</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RX</name>
							<description>Receive Pin - RX</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RWD1</name>
					<description>RAM Watchdog 1</description>
					<addressOffset>0x8614</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>WDC</name>
							<description>Watchdog Configuration - WDC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WDV</name>
							<description>Watchdog Value - WDV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCCR1</name>
					<description>CC Control Register 1</description>
					<addressOffset>0x8618</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>INIT</name>
							<description>Initialization - INIT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCE</name>
							<description>Configuration Change Enable - CCE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ASM</name>
							<description>Restricted Operation Mode - ASM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CSA</name>
							<description>Clock Stop Acknowledge - CSA</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CSR</name>
							<description>Clock Stop Request - CSR</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MON</name>
							<description>Bus Monitoring Mode - MON</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DAR</name>
							<description>Disable Automatic Retransmission - DAR</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEST</name>
							<description>Test Mode Enable - TEST</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FDOE</name>
							<description>FD Operation Enable - FDOE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BRSE</name>
							<description>Bit Rate Switch Enable - BRSE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PXHD</name>
							<description>Protocol Exception Handling Disable - PXHD</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EFBI</name>
							<description>Edge Filtering during Bus Integration - EFBI</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXP</name>
							<description>Transmit Pause - TXP</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NISO</name>
							<description>Non ISO Operation - NISO</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NBTP1</name>
					<description>Nominal Bit Timing &amp; Prescaler Register 1</description>
					<addressOffset>0x861C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x6000a03</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>NTSEG2</name>
							<description>Nominal Time segment after sample point - NTSEG2</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NTSEG1</name>
							<description>Nominal Time segment before sample point - NTSEG1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NBRP</name>
							<description>Baud Rate Prescaler - NBRP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NSJW</name>
							<description>(Re) Synchronization Jump Width - NSJW</description>
							<bitOffset>25</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSCC1</name>
					<description>Timestamp Counter Configuration 1</description>
					<addressOffset>0x8620</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TSS</name>
							<description>Time segment before sample point - TSS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCP</name>
							<description>Timestamp Counter Prescaler - TCP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSCV1</name>
					<description>Timestamp Counter Value 1</description>
					<addressOffset>0x8624</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TSC</name>
							<description>Timestamp Counter - TSC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TOCC1</name>
					<description>Timeout Counter Configuration 1</description>
					<addressOffset>0x8628</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xffff0000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ETOC</name>
							<description>Enable Timeout Counter - ETOC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Timeout Select - TOS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOP</name>
							<description>Timeout Period - TOP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TOCV1</name>
					<description>Timeout Counter Value 1</description>
					<addressOffset>0x862C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TOC</name>
							<description>Timeout Counter - TOC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ECR1</name>
					<description>Error Counter Register 1</description>
					<addressOffset>0x8640</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TEC</name>
							<description>Transmit Error Counter - TEC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>REC</name>
							<description>Receive Error Counter - REC</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RP</name>
							<description>Receive Error Passive - RP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CEL</name>
							<description>CAN Error Logging - CEL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSR1</name>
					<description>Protocol Status Register 1</description>
					<addressOffset>0x8644</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x707</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>LEC</name>
							<description>Last Error Code - LEC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ACT</name>
							<description>Activity - ACT</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EP</name>
							<description>Error Passive - EP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EW</name>
							<description>Warning Status - EW</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BO</name>
							<description>Bus_Off Status - BO</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DLEC</name>
							<description>Data Phase Last Error Code - DLEC</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RESI</name>
							<description>ESI flag of last received CAN FD Message - RESI</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RBRS</name>
							<description>BRS flag of last received CAN FD Message - RBRS</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RFDF</name>
							<description>Received a CAN FD Message - RFDF</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PXE</name>
							<description>Protocol Exception Event - PXE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TDCV</name>
							<description>Transmitter Delay Compensation Value - TDCV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TDCR1</name>
					<description>Transmitter Delay Compensation Register 1</description>
					<addressOffset>0x8648</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TDCF</name>
							<description>Transmitter Delay Compensation Filter Window Length - TDCF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TDCO</name>
							<description>Transmitter Delay Compensation Offset - TDCO</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IR1</name>
					<description>Interrupt Register 1</description>
					<addressOffset>0x8650</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RF0N</name>
							<description>Rx FIFO 0 New Message - RF0N</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF0W</name>
							<description>Rx FIFO 0 Watermark Reached - RF0W</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF0F</name>
							<description>Rx FIFO 0 Full - RF0F</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF0L</name>
							<description>Rx FIFO 0 Message Lost - RF0L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF1N</name>
							<description>Rx FIFO 1 New Message - RF1N</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF1W</name>
							<description>Rx FIFO 1 Watermark Reached - RF1W</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF1F</name>
							<description>Rx FIFO 1 Full - RF1F</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF1L</name>
							<description>Rx FIFO 1 Message Lost - RF1L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPM</name>
							<description>High Priority Message - HPM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TC</name>
							<description>Transmission Completed - TC</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCF</name>
							<description>Transmission Cancellation Finished - TCF</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TFE</name>
							<description>Tx FIFO Empty - TFE</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEFN</name>
							<description>Tx Event FIFO New Entry - TEFN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEFW</name>
							<description>Tx Event FIFO Watermark Reached - TEFW</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEFF</name>
							<description>Tx Event FIFO Full - TEFF</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEFL</name>
							<description>Tx Event FIFO Element Lost - TEFL</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TSW</name>
							<description>Timestamp Wraparound - TSW</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MRAF</name>
							<description>Message RAM Access Failure - MRAF</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOO</name>
							<description>Timeout Occurred - TOO</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRX</name>
							<description>Message stored to Dedicated Rx Buffer - DRX</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ELO</name>
							<description>Error Logging Overflow - ELO</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EP</name>
							<description>Error Passive - EP</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EW</name>
							<description>Warning Status - EW</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BO</name>
							<description>Bus_Off Status - BO</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WDI</name>
							<description>Watchdog Interrupt - WDI</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PEA</name>
							<description>Protocol Error in Arbitration Phase - PEA</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PED</name>
							<description>Protocol Error in Data Phase - PED</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
