J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>TXBTIE2</name>
					<description>Tx Buffer Transmission Interrupt Enable 2</description>
					<addressOffset>0x8AE0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIE0</name>
							<description>Transmission Interrupt Enable Tx Buffer 0 - TIE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE1</name>
							<description>Transmission Interrupt Enable Tx Buffer 1 - TIE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE2</name>
							<description>Transmission Interrupt Enable Tx Buffer 2 - TIE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE3</name>
							<description>Transmission Interrupt Enable Tx Buffer 3 - TIE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE4</name>
							<description>Transmission Interrupt Enable Tx Buffer 4 - TIE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE5</name>
							<description>Transmission Interrupt Enable Tx Buffer 5 - TIE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE6</name>
							<description>Transmission Interrupt Enable Tx Buffer 6 - TIE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE7</name>
							<description>Transmission Interrupt Enable Tx Buffer 7 - TIE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE8</name>
							<description>Transmission Interrupt Enable Tx Buffer 8 - TIE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE9</name>
							<description>Transmission Interrupt Enable Tx Buffer 9 - TIE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE10</name>
							<description>Transmission Interrupt Enable Tx Buffer 10 - TIE</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE11</name>
							<description>Transmission Interrupt Enable Tx Buffer 11 - TIE</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE12</name>
							<description>Transmission Interrupt Enable Tx Buffer 12 - TIE</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE13</name>
							<description>Transmission Interrupt Enable Tx Buffer 13 - TIE</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE14</name>
							<description>Transmission Interrupt Enable Tx Buffer 14 - TIE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE15</name>
							<description>Transmission Interrupt Enable Tx Buffer 15 - TIE</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE16</name>
							<description>Transmission Interrupt Enable Tx Buffer 16 - TIE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE17</name>
							<description>Transmission Interrupt Enable Tx Buffer 17 - TIE</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE18</name>
							<description>Transmission Interrupt Enable Tx Buffer 18 - TIE</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE19</name>
							<description>Transmission Interrupt Enable Tx Buffer 19 - TIE</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE20</name>
							<description>Transmission Interrupt Enable Tx Buffer 20 - TIE</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE21</name>
							<description>Transmission Interrupt Enable Tx Buffer 21 - TIE</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE22</name>
							<description>Transmission Interrupt Enable Tx Buffer 22 - TIE</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE23</name>
							<description>Transmission Interrupt Enable Tx Buffer 23 - TIE</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE24</name>
							<description>Transmission Interrupt Enable Tx Buffer 24 - TIE</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE25</name>
							<description>Transmission Interrupt Enable Tx Buffer 25 - TIE</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE26</name>
							<description>Transmission Interrupt Enable Tx Buffer 26 - TIE</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE27</name>
							<description>Transmission Interrupt Enable Tx Buffer 27 - TIE</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE28</name>
							<description>Transmission Interrupt Enable Tx Buffer 28 - TIE</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE29</name>
							<description>Transmission Interrupt Enable Tx Buffer 29 - TIE</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE30</name>
							<description>Transmission Interrupt Enable Tx Buffer 30 - TIE</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TIE31</name>
							<description>Transmission Interrupt Enable Tx Buffer 31 - TIE</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXBCIE2</name>
					<description>Tx Buffer Cancellation Finished Interrupt Enable 2</description>
					<addressOffset>0x8AE4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CFIE0</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 0 - CFIE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE1</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 1 - CFIE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE2</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 2 - CFIE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE3</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 3 - CFIE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE4</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 4 - CFIE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE5</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 5 - CFIE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE6</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 6 - CFIE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE7</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 7 - CFIE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE8</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 8 - CFIE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE9</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 9 - CFIE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE10</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 10 - CFIE</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE11</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 11 - CFIE</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE12</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 12 - CFIE</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE13</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 13 - CFIE</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE14</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 14 - CFIE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE15</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 15 - CFIE</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE16</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 16 - CFIE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE17</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 17 - CFIE</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE18</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 18 - CFIE</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE19</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 19 - CFIE</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE20</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 20 - CFIE</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE21</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 21 - CFIE</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE22</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 22 - CFIE</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE23</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 23 - CFIE</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE24</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 24 - CFIE</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE25</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 25 - CFIE</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE26</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 26 - CFIE</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE27</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 27 - CFIE</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE28</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 28 - CFIE</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE29</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 29 - CFIE</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE30</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 30 - CFIE</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFIE31</name>
							<description>Cancellation Finished Interrupt Enable Tx Buffer 31 - CFIE</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXEFC2</name>
					<description>Tx Event FIFO Configuration 2</description>
					<addressOffset>0x8AF0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EFSA</name>
							<description>Event FIFO Start Address - EFSA</description>
							<bitOffset>2</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EFS</name>
							<description>Event FIFO Size - EFS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EFWM</name>
							<description>Event FIFO Watermark - EFWM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXEFS2</name>
					<description>Tx Event FIFO Status 2</description>
					<addressOffset>0x8AF4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EFFL</name>
							<description>Event FIFO Fill Level - EFFL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EFGI</name>
							<description>Event FIFO Get Index - EFGI</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EFPI</name>
							<description>Event FIFO Put Index - EFPI</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EFF</name>
							<description>Event FIFO Full - EFF</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TEFL</name>
							<description>Tx Event FIFO Element Lost - TEFL</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXEFA2</name>
					<description>Tx Event FIFO Acknowledge 2</description>
					<addressOffset>0x8AF8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EFAI</name>
							<description>Event FIFO Acknowledge Index - EFAI</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
