J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>IE0</name>
					<description>Interrupt Enable 0</description>
					<addressOffset>0x8254</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RF0NE</name>
							<description>Rx FIFO 0 New Message Interrupt Enable - RF0NE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF0WE</name>
							<description>Rx FIFO 0 Watermark Reached Interrupt Enable - RF0WE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF0FE</name>
							<description>Rx FIFO 0 Full Interrupt Enable - RF0FE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF0LE</name>
							<description>Rx FIFO 0 Message Lost Interrupt Enable - RF0LE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF1NE</name>
							<description>Rx FIFO 1 New Message Interrupt Enable - RF1NE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF1WE</name>
							<description>Rx FIFO 1 Watermark Reached Interrupt Enable - RF1WE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF1FE</name>
							<description>Rx FIFO 1 Full Interrupt Enable - RF1FE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF1LE</name>
							<description>Rx FIFO 1 Message Lost Interrupt Enable - RF1LE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPME</name>
							<description>High Priority Message Interrupt Enable - HPME</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCE</name>
							<description>Transmission Completed Interrupt Enable - TCE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCFE</name>
							<description>Transmission Cancellation Finished Interrupt Enable - TCFE</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TFEE</name>
							<description>Tx FIFO Empty Interrupt Enable - TFEE</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEFNE</name>
							<description>Tx Event FIFO New Entry Interrupt Enable - TEFNE</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEFWE</name>
							<description>Tx Event FIFO Watermark Reached Interrupt Enable - TEFWE</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEFFE</name>
							<description>Tx Event FIFO Full Interrupt Enable - TEFFE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEFLE</name>
							<description>Tx Event FIFO Element Lost Interrupt Enable - TEFLE</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TSWE</name>
							<description>Timestamp Wraparound Interrupt Enable - TSWE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MRAFE</name>
							<description>Message RAM Access Failure Interrupt Enable - MRAFE</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOOE</name>
							<description>Timeout Occurred Interrupt Enable - TOOE</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRXE</name>
							<description>Message stored to Dedicated Rx Buffer Interrupt Enable - DRXE</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ELOE</name>
							<description>Error Logging Overflow Interrupt Enable - ELOE</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EPE</name>
							<description>Error Passive Interrupt Enable - EPE</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EWE</name>
							<description>Warning Status Interrupt Enable - EWE</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BOE</name>
							<description>Bus_Off Status Interrupt Enable - BOE</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WDIE</name>
							<description>Watchdog Interrupt Enable - WDIE</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PEAE</name>
							<description>Protocol Error in Arbitration Phase Enable - PEAE</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PEDE</name>
							<description>Protocol Error in Data Phase Enable - PEDE</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GFC0</name>
					<description>Global Filter Configuration 0</description>
					<addressOffset>0x8280</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RRFE</name>
							<description>Reject Remote Frames Extended - RRFE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RRFS</name>
							<description>Reject Remote Frames Standard - RRFS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ANFE</name>
							<description>Accept Non-matching Frames Extended - ANFE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ANFS</name>
							<description>Accept Non-matching Frames Standard - ANFS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SIDFC0</name>
					<description>Standard ID Filter Configuration 0</description>
					<addressOffset>0x8284</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FLSSA</name>
							<description>Filter List Standard Start Address - FLSSA</description>
							<bitOffset>2</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LSS</name>
							<description>List Size Standard - LSS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>XIDFC0</name>
					<description>Extended ID Filter Configuration 0</description>
					<addressOffset>0x8288</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FLESA</name>
							<description>Filter List Extended Start Address - FLESA</description>
							<bitOffset>2</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LSE</name>
							<description>List Size Extended - LSE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>XIDAM0</name>
					<description>Extended ID AND Mask 0</description>
					<addressOffset>0x8290</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1fffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EIDM</name>
							<description>Extended ID Mask - EIDM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>29</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HPMS0</name>
					<description>High Priority Message Status 0</description>
					<addressOffset>0x8294</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BIDX</name>
							<description>Buffer Index - BIDX</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MSI</name>
							<description>Message Storage Indicator - MSI</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FIDX</name>
							<description>Filter Index - FIDX</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FLST</name>
							<description>Filter List - FLST</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NDAT10</name>
					<description>New Data 1 0</description>
					<addressOffset>0x8298</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ND0</name>
							<description>New Data in Rx Buffer 0 - ND</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND1</name>
							<description>New Data in Rx Buffer 1 - ND</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND2</name>
							<description>New Data in Rx Buffer 2 - ND</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND3</name>
							<description>New Data in Rx Buffer 3 - ND</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND4</name>
							<description>New Data in Rx Buffer 4 - ND</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND5</name>
							<description>New Data in Rx Buffer 5 - ND</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND6</name>
							<description>New Data in Rx Buffer 6 - ND</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND7</name>
							<description>New Data in Rx Buffer 7 - ND</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND8</name>
							<description>New Data in Rx Buffer 8 - ND</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND9</name>
							<description>New Data in Rx Buffer 9 - ND</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND10</name>
							<description>New Data in Rx Buffer 10 - ND</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND11</name>
							<description>New Data in Rx Buffer 11 - ND</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND12</name>
							<description>New Data in Rx Buffer 12 - ND</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND13</name>
							<description>New Data in Rx Buffer 13 - ND</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND14</name>
							<description>New Data in Rx Buffer 14 - ND</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND15</name>
							<description>New Data in Rx Buffer 15 - ND</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND16</name>
							<description>New Data in Rx Buffer 16 - ND</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND17</name>
							<description>New Data in Rx Buffer 17 - ND</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND18</name>
							<description>New Data in Rx Buffer 18 - ND</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND19</name>
							<description>New Data in Rx Buffer 19 - ND</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND20</name>
							<description>New Data in Rx Buffer 20 - ND</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND21</name>
							<description>New Data in Rx Buffer 21 - ND</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND22</name>
							<description>New Data in Rx Buffer 22 - ND</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND23</name>
							<description>New Data in Rx Buffer 23 - ND</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND24</name>
							<description>New Data in Rx Buffer 24 - ND</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND25</name>
							<description>New Data in Rx Buffer 25 - ND</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND26</name>
							<description>New Data in Rx Buffer 26 - ND</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND27</name>
							<description>New Data in Rx Buffer 27 - ND</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND28</name>
							<description>New Data in Rx Buffer 28 - ND</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND29</name>
							<description>New Data in Rx Buffer 29 - ND</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND30</name>
							<description>New Data in Rx Buffer 30 - ND</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ND31</name>
							<description>New Data in Rx Buffer 31 - ND</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
