J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>TXBRP2</name>
					<description>Tx Buffer Request Pending 2</description>
					<addressOffset>0x8ACC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TRP0</name>
							<description>Transmission Request Pending Tx  Buffer 0 - TRP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP1</name>
							<description>Transmission Request Pending Tx  Buffer 1 - TRP</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP2</name>
							<description>Transmission Request Pending Tx  Buffer 2 - TRP</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP3</name>
							<description>Transmission Request Pending Tx  Buffer 3 - TRP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP4</name>
							<description>Transmission Request Pending Tx  Buffer 4 - TRP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP5</name>
							<description>Transmission Request Pending Tx  Buffer 5 - TRP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP6</name>
							<description>Transmission Request Pending Tx  Buffer 6 - TRP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP7</name>
							<description>Transmission Request Pending Tx  Buffer 7 - TRP</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP8</name>
							<description>Transmission Request Pending Tx  Buffer 8 - TRP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP9</name>
							<description>Transmission Request Pending Tx  Buffer 9 - TRP</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP10</name>
							<description>Transmission Request Pending Tx  Buffer 10 - TRP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP11</name>
							<description>Transmission Request Pending Tx  Buffer 11 - TRP</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP12</name>
							<description>Transmission Request Pending Tx  Buffer 12 - TRP</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP13</name>
							<description>Transmission Request Pending Tx  Buffer 13 - TRP</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP14</name>
							<description>Transmission Request Pending Tx  Buffer 14 - TRP</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP15</name>
							<description>Transmission Request Pending Tx  Buffer 15 - TRP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP16</name>
							<description>Transmission Request Pending Tx  Buffer 16 - TRP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP17</name>
							<description>Transmission Request Pending Tx  Buffer 17 - TRP</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP18</name>
							<description>Transmission Request Pending Tx  Buffer 18 - TRP</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP19</name>
							<description>Transmission Request Pending Tx  Buffer 19 - TRP</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP20</name>
							<description>Transmission Request Pending Tx  Buffer 20 - TRP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP21</name>
							<description>Transmission Request Pending Tx  Buffer 21 - TRP</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP22</name>
							<description>Transmission Request Pending Tx  Buffer 22 - TRP</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP23</name>
							<description>Transmission Request Pending Tx  Buffer 23 - TRP</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP24</name>
							<description>Transmission Request Pending Tx  Buffer 24 - TRP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP25</name>
							<description>Transmission Request Pending Tx  Buffer 25 - TRP</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP26</name>
							<description>Transmission Request Pending Tx  Buffer 26 - TRP</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP27</name>
							<description>Transmission Request Pending Tx  Buffer 27 - TRP</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP28</name>
							<description>Transmission Request Pending Tx  Buffer 28 - TRP</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP29</name>
							<description>Transmission Request Pending Tx  Buffer 29 - TRP</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP30</name>
							<description>Transmission Request Pending Tx  Buffer 30 - TRP</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRP31</name>
							<description>Transmission Request Pending Tx  Buffer 31 - TRP</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXBAR2</name>
					<description>Tx Buffer Add Request 2</description>
					<addressOffset>0x8AD0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>AR0</name>
							<description>Add Request Tx Buffer 0 - AR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR1</name>
							<description>Add Request Tx Buffer 1 - AR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR2</name>
							<description>Add Request Tx Buffer 2 - AR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR3</name>
							<description>Add Request Tx Buffer 3 - AR</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR4</name>
							<description>Add Request Tx Buffer 4 - AR</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR5</name>
							<description>Add Request Tx Buffer 5 - AR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR6</name>
							<description>Add Request Tx Buffer 6 - AR</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR7</name>
							<description>Add Request Tx Buffer 7 - AR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR8</name>
							<description>Add Request Tx Buffer 8 - AR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR9</name>
							<description>Add Request Tx Buffer 9 - AR</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR10</name>
							<description>Add Request Tx Buffer 10 - AR</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR11</name>
							<description>Add Request Tx Buffer 11 - AR</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR12</name>
							<description>Add Request Tx Buffer 12 - AR</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR13</name>
							<description>Add Request Tx Buffer 13 - AR</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR14</name>
							<description>Add Request Tx Buffer 14 - AR</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR15</name>
							<description>Add Request Tx Buffer 15 - AR</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR16</name>
							<description>Add Request Tx Buffer 16 - AR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR17</name>
							<description>Add Request Tx Buffer 17 - AR</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR18</name>
							<description>Add Request Tx Buffer 18 - AR</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR19</name>
							<description>Add Request Tx Buffer 19 - AR</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR20</name>
							<description>Add Request Tx Buffer 20 - AR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR21</name>
							<description>Add Request Tx Buffer 21 - AR</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR22</name>
							<description>Add Request Tx Buffer 22 - AR</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR23</name>
							<description>Add Request Tx Buffer 23 - AR</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR24</name>
							<description>Add Request Tx Buffer 24 - AR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR25</name>
							<description>Add Request Tx Buffer 25 - AR</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR26</name>
							<description>Add Request Tx Buffer 26 - AR</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR27</name>
							<description>Add Request Tx Buffer 27 - AR</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR28</name>
							<description>Add Request Tx Buffer 28 - AR</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR29</name>
							<description>Add Request Tx Buffer 29 - AR</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR30</name>
							<description>Add Request Tx Buffer 30 - AR</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AR31</name>
							<description>Add Request Tx Buffer 31 - AR</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TXBCR2</name>
					<description>Tx Buffer Cancellation Request 2</description>
					<addressOffset>0x8AD4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CR0</name>
							<description>Cancellation Request Tx Buffer 0 - CR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR1</name>
							<description>Cancellation Request Tx Buffer 1 - CR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR2</name>
							<description>Cancellation Request Tx Buffer 2 - CR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR3</name>
							<description>Cancellation Request Tx Buffer 3 - CR</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR4</name>
							<description>Cancellation Request Tx Buffer 4 - CR</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR5</name>
							<description>Cancellation Request Tx Buffer 5 - CR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR6</name>
							<description>Cancellation Request Tx Buffer 6 - CR</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR7</name>
							<description>Cancellation Request Tx Buffer 7 - CR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR8</name>
							<description>Cancellation Request Tx Buffer 8 - CR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR9</name>
							<description>Cancellation Request Tx Buffer 9 - CR</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR10</name>
							<description>Cancellation Request Tx Buffer 10 - CR</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR11</name>
							<description>Cancellation Request Tx Buffer 11 - CR</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR12</name>
							<description>Cancellation Request Tx Buffer 12 - CR</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR13</name>
							<description>Cancellation Request Tx Buffer 13 - CR</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR14</name>
							<description>Cancellation Request Tx Buffer 14 - CR</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR15</name>
							<description>Cancellation Request Tx Buffer 15 - CR</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR16</name>
							<description>Cancellation Request Tx Buffer 16 - CR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR17</name>
							<description>Cancellation Request Tx Buffer 17 - CR</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR18</name>
							<description>Cancellation Request Tx Buffer 18 - CR</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR19</name>
							<description>Cancellation Request Tx Buffer 19 - CR</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR20</name>
							<description>Cancellation Request Tx Buffer 20 - CR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR21</name>
							<description>Cancellation Request Tx Buffer 21 - CR</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR22</name>
							<description>Cancellation Request Tx Buffer 22 - CR</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR23</name>
							<description>Cancellation Request Tx Buffer 23 - CR</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR24</name>
							<description>Cancellation Request Tx Buffer 24 - CR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR25</name>
							<description>Cancellation Request Tx Buffer 25 - CR</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR26</name>
							<description>Cancellation Request Tx Buffer 26 - CR</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR27</name>
							<description>Cancellation Request Tx Buffer 27 - CR</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR28</name>
							<description>Cancellation Request Tx Buffer 28 - CR</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR29</name>
							<description>Cancellation Request Tx Buffer 29 - CR</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR30</name>
							<description>Cancellation Request Tx Buffer 30 - CR</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CR31</name>
							<description>Cancellation Request Tx Buffer 31 - CR</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
