J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>GRINT13</name>
					<description>Interrupt routing for Groups 1 3</description>
					<addressOffset>0x8D14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TEFIFO</name>
							<description>Transmit Event FIFO Incidents - TEFIFO</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPE</name>
							<description>High Priority Events - HPE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WATI</name>
							<description>Watermark interrupts - WATI</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ALRT</name>
							<description>ALERTS - ALRT</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOER</name>
							<description>Module errors - MOER</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SAFE</name>
							<description>Safety counter overflow - SAFE</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BOFF</name>
							<description>Bus Off has been reached - BOFF</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LOI</name>
							<description>Last Error Interrupts - LOI</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GRINT23</name>
					<description>Interrupt routing for Groups 2 3</description>
					<addressOffset>0x8D18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REINT</name>
							<description>Message stored in dedicated receive buffer interrupt (IR.DRX) - REINT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RxF1F</name>
							<description>IR.RF1F - RxF1F</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RxF0F</name>
							<description>IR.RF0F - RxF0F</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RxF1N</name>
							<description>IR.RF1N - RxF1N</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RxF0N</name>
							<description>IR.RF0N - RxF0N</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RETI</name>
							<description>Receive Timeouts - RETI</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRAQ</name>
							<description>Transmission Queue Events - TRAQ</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRACO</name>
							<description>Interrupts of the transmission control - TRACO</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NTCCR3</name>
					<description>Node 3 Timer Clock Control Register</description>
					<addressOffset>0x8D20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TPSC</name>
							<description>Timer Prescaler - TPSC</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STRESET</name>
							<description>Stamping Reset - STRESET</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STSTART</name>
							<description>Stamping Start - STSTART</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRIGSRC</name>
							<description>Trigger Source - TRIGSRC</description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NTATTR3</name>
					<description>Node 3 Timer A Transmit Trigger Register</description>
					<addressOffset>0x8D24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x10000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RELOAD</name>
							<description>Reload Value - RELOAD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXMO</name>
							<description>Transmit Message Object - TXMO</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>STRT</name>
							<description>Timer Start - STRT</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NTBTTR3</name>
					<description>Node 3 Timer B Transmit Trigger Register</description>
					<addressOffset>0x8D28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x20000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RELOAD</name>
							<description>Reload Value - RELOAD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXMO</name>
							<description>Transmit Message Object - TXMO</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>STRT</name>
							<description>Timer Start - STRT</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NTCTTR3</name>
					<description>Node 3 Timer C Transmit Trigger Register</description>
					<addressOffset>0x8D2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x30000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RELOAD</name>
							<description>Reload Value - RELOAD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXMO</name>
							<description>Transmit Message Object - TXMO</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>STRT</name>
							<description>Timer Start - STRT</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NTRTR3</name>
					<description>Node 3 Timer Receive Timeout Register</description>
					<addressOffset>0x8D30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RELOAD</name>
							<description>Reload Value - RELOAD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEIE</name>
							<description>Timer Event Interrupt Enable - TEIE</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TE</name>
							<description>Timer Event - TE</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NPCR3</name>
					<description>Node 3 Port Control Register</description>
					<addressOffset>0x8D40</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RXSEL</name>
							<description>Receive Select - RXSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LBM</name>
							<description>Loop-Back Mode - LBM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LOUT</name>
							<description>Loop Back Mode Out - LOUT</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DELE</name>
							<description>Enable destructive read on ECR3.CEL - DELE</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CREL3</name>
					<description>Core Release Register 3</description>
					<addressOffset>0x8E00</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x32150320</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DAY</name>
							<description>Time Stamp Day</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MON</name>
							<description>Time Stamp Month</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>YEAR</name>
							<description>Time Stamp Year</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SUBSTEP</name>
							<description>Sub-step of Core Release - SUBSTEP</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>STEP</name>
							<description>Step of Core Release - STEP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>REL</name>
							<description>Core Release - REL</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ENDN3</name>
					<description>Endian Register 3</description>
					<addressOffset>0x8E04</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x87654321</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ETV</name>
							<description>Endianness Test Value - ETV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>32</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DBTP3</name>
					<description>Data Bit Timing &amp; Prescaler Register 3</description>
					<addressOffset>0x8E0C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xa33</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DSJW</name>
							<description>Data (Re) Synchronization Jump Width - DSJW</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTSEG2</name>
							<description>Data time segment after sample point - DTSEG2</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTSEG1</name>
							<description>Data time segment before sample point - DTSEG1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DBRP</name>
							<description>Data Baud Rate Prescaler - DBRP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TDC</name>
							<description>Transmitter Delay Compensation - TDC</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TEST3</name>
					<description>Test Register 3</description>
					<addressOffset>0x8E10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffff7f</resetMask>
					<fields>
						<field>
							<name>LBCK</name>
							<description>Loop Back Mode - LBCK</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TX</name>
							<description>Control of Transmit Pin - TX</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RX</name>
							<description>Receive Pin - RX</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RWD3</name>
					<description>RAM Watchdog 3</description>
					<addressOffset>0x8E14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>WDC</name>
							<description>Watchdog Configuration - WDC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WDV</name>
							<description>Watchdog Value - WDV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CCCR3</name>
					<description>CC Control Register 3</description>
					<addressOffset>0x8E18</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>INIT</name>
							<description>Initialization - INIT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCE</name>
							<description>Configuration Change Enable - CCE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ASM</name>
							<description>Restricted Operation Mode - ASM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CSA</name>
							<description>Clock Stop Acknowledge - CSA</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CSR</name>
							<description>Clock Stop Request - CSR</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MON</name>
							<description>Bus Monitoring Mode - MON</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DAR</name>
							<description>Disable Automatic Retransmission - DAR</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEST</name>
							<description>Test Mode Enable - TEST</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FDOE</name>
							<description>FD Operation Enable - FDOE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BRSE</name>
							<description>Bit Rate Switch Enable - BRSE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PXHD</name>
							<description>Protocol Exception Handling Disable - PXHD</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EFBI</name>
							<description>Edge Filtering during Bus Integration - EFBI</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TXP</name>
							<description>Transmit Pause - TXP</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NISO</name>
							<description>Non ISO Operation - NISO</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NBTP3</name>
					<description>Nominal Bit Timing &amp; Prescaler Register 3</description>
					<addressOffset>0x8E1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x6000a03</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>NTSEG2</name>
							<description>Nominal Time segment after sample point - NTSEG2</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NTSEG1</name>
							<description>Nominal Time segment before sample point - NTSEG1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NBRP</name>
							<description>Baud Rate Prescaler - NBRP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NSJW</name>
							<description>(Re) Synchronization Jump Width - NSJW</description>
							<bitOffset>25</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSCC3</name>
					<description>Timestamp Counter Configuration 3</description>
					<addressOffset>0x8E20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TSS</name>
							<description>Time segment before sample point - TSS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCP</name>
							<description>Timestamp Counter Prescaler - TCP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSCV3</name>
					<description>Timestamp Counter Value 3</description>
					<addressOffset>0x8E24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TSC</name>
							<description>Timestamp Counter - TSC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TOCC3</name>
					<description>Timeout Counter Configuration 3</description>
					<addressOffset>0x8E28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xffff0000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ETOC</name>
							<description>Enable Timeout Counter - ETOC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOS</name>
							<description>Timeout Select - TOS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOP</name>
							<description>Timeout Period - TOP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TOCV3</name>
					<description>Timeout Counter Value 3</description>
					<addressOffset>0x8E2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TOC</name>
							<description>Timeout Counter - TOC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ECR3</name>
					<description>Error Counter Register 3</description>
					<addressOffset>0x8E40</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TEC</name>
							<description>Transmit Error Counter - TEC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>REC</name>
							<description>Receive Error Counter - REC</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RP</name>
							<description>Receive Error Passive - RP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CEL</name>
							<description>CAN Error Logging - CEL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
