J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>PSR3</name>
					<description>Protocol Status Register 3</description>
					<addressOffset>0x8E44</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x707</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>LEC</name>
							<description>Last Error Code - LEC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ACT</name>
							<description>Activity - ACT</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EP</name>
							<description>Error Passive - EP</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EW</name>
							<description>Warning Status - EW</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>BO</name>
							<description>Bus_Off Status - BO</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DLEC</name>
							<description>Data Phase Last Error Code - DLEC</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RESI</name>
							<description>ESI flag of last received CAN FD Message - RESI</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RBRS</name>
							<description>BRS flag of last received CAN FD Message - RBRS</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RFDF</name>
							<description>Received a CAN FD Message - RFDF</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PXE</name>
							<description>Protocol Exception Event - PXE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TDCV</name>
							<description>Transmitter Delay Compensation Value - TDCV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TDCR3</name>
					<description>Transmitter Delay Compensation Register 3</description>
					<addressOffset>0x8E48</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TDCF</name>
							<description>Transmitter Delay Compensation Filter Window Length - TDCF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TDCO</name>
							<description>Transmitter Delay Compensation Offset - TDCO</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IR3</name>
					<description>Interrupt Register 3</description>
					<addressOffset>0x8E50</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RF0N</name>
							<description>Rx FIFO 0 New Message - RF0N</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF0W</name>
							<description>Rx FIFO 0 Watermark Reached - RF0W</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF0F</name>
							<description>Rx FIFO 0 Full - RF0F</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF0L</name>
							<description>Rx FIFO 0 Message Lost - RF0L</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF1N</name>
							<description>Rx FIFO 1 New Message - RF1N</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF1W</name>
							<description>Rx FIFO 1 Watermark Reached - RF1W</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF1F</name>
							<description>Rx FIFO 1 Full - RF1F</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF1L</name>
							<description>Rx FIFO 1 Message Lost - RF1L</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPM</name>
							<description>High Priority Message - HPM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TC</name>
							<description>Transmission Completed - TC</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCF</name>
							<description>Transmission Cancellation Finished - TCF</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TFE</name>
							<description>Tx FIFO Empty - TFE</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEFN</name>
							<description>Tx Event FIFO New Entry - TEFN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEFW</name>
							<description>Tx Event FIFO Watermark Reached - TEFW</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEFF</name>
							<description>Tx Event FIFO Full - TEFF</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEFL</name>
							<description>Tx Event FIFO Element Lost - TEFL</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TSW</name>
							<description>Timestamp Wraparound - TSW</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MRAF</name>
							<description>Message RAM Access Failure - MRAF</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOO</name>
							<description>Timeout Occurred - TOO</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRX</name>
							<description>Message stored to Dedicated Rx Buffer - DRX</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ELO</name>
							<description>Error Logging Overflow - ELO</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EP</name>
							<description>Error Passive - EP</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EW</name>
							<description>Warning Status - EW</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BO</name>
							<description>Bus_Off Status - BO</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WDI</name>
							<description>Watchdog Interrupt - WDI</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PEA</name>
							<description>Protocol Error in Arbitration Phase - PEA</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PED</name>
							<description>Protocol Error in Data Phase - PED</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IE3</name>
					<description>Interrupt Enable 3</description>
					<addressOffset>0x8E54</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RF0NE</name>
							<description>Rx FIFO 0 New Message Interrupt Enable - RF0NE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF0WE</name>
							<description>Rx FIFO 0 Watermark Reached Interrupt Enable - RF0WE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF0FE</name>
							<description>Rx FIFO 0 Full Interrupt Enable - RF0FE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF0LE</name>
							<description>Rx FIFO 0 Message Lost Interrupt Enable - RF0LE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF1NE</name>
							<description>Rx FIFO 1 New Message Interrupt Enable - RF1NE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF1WE</name>
							<description>Rx FIFO 1 Watermark Reached Interrupt Enable - RF1WE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF1FE</name>
							<description>Rx FIFO 1 Full Interrupt Enable - RF1FE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RF1LE</name>
							<description>Rx FIFO 1 Message Lost Interrupt Enable - RF1LE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HPME</name>
							<description>High Priority Message Interrupt Enable - HPME</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCE</name>
							<description>Transmission Completed Interrupt Enable - TCE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TCFE</name>
							<description>Transmission Cancellation Finished Interrupt Enable - TCFE</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TFEE</name>
							<description>Tx FIFO Empty Interrupt Enable - TFEE</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEFNE</name>
							<description>Tx Event FIFO New Entry Interrupt Enable - TEFNE</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEFWE</name>
							<description>Tx Event FIFO Watermark Reached Interrupt Enable - TEFWE</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEFFE</name>
							<description>Tx Event FIFO Full Interrupt Enable - TEFFE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TEFLE</name>
							<description>Tx Event FIFO Element Lost Interrupt Enable - TEFLE</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TSWE</name>
							<description>Timestamp Wraparound Interrupt Enable - TSWE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MRAFE</name>
							<description>Message RAM Access Failure Interrupt Enable - MRAFE</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TOOE</name>
							<description>Timeout Occurred Interrupt Enable - TOOE</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRXE</name>
							<description>Message stored to Dedicated Rx Buffer Interrupt Enable - DRXE</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ELOE</name>
							<description>Error Logging Overflow Interrupt Enable - ELOE</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EPE</name>
							<description>Error Passive Interrupt Enable - EPE</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EWE</name>
							<description>Warning Status Interrupt Enable - EWE</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BOE</name>
							<description>Bus_Off Status Interrupt Enable - BOE</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WDIE</name>
							<description>Watchdog Interrupt Enable - WDIE</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PEAE</name>
							<description>Protocol Error in Arbitration Phase Enable - PEAE</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PEDE</name>
							<description>Protocol Error in Data Phase Enable - PEDE</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GFC3</name>
					<description>Global Filter Configuration 3</description>
					<addressOffset>0x8E80</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RRFE</name>
							<description>Reject Remote Frames Extended - RRFE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RRFS</name>
							<description>Reject Remote Frames Standard - RRFS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ANFE</name>
							<description>Accept Non-matching Frames Extended - ANFE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ANFS</name>
							<description>Accept Non-matching Frames Standard - ANFS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SIDFC3</name>
					<description>Standard ID Filter Configuration 3</description>
					<addressOffset>0x8E84</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FLSSA</name>
							<description>Filter List Standard Start Address - FLSSA</description>
							<bitOffset>2</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LSS</name>
							<description>List Size Standard - LSS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>XIDFC3</name>
					<description>Extended ID Filter Configuration 3</description>
					<addressOffset>0x8E88</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FLESA</name>
							<description>Filter List Extended Start Address - FLESA</description>
							<bitOffset>2</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LSE</name>
							<description>List Size Extended - LSE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>XIDAM3</name>
					<description>Extended ID AND Mask 3</description>
					<addressOffset>0x8E90</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1fffffff</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EIDM</name>
							<description>Extended ID Mask - EIDM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>29</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>HPMS3</name>
					<description>High Priority Message Status 3</description>
					<addressOffset>0x8E94</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BIDX</name>
							<description>Buffer Index - BIDX</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MSI</name>
							<description>Message Storage Indicator - MSI</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FIDX</name>
							<description>Filter Index - FIDX</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FLST</name>
							<description>Filter List - FLST</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
