J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CCU60</name>
			<version>100</version>
			<description>ce_ccusix</description>
			<groupName>CCU60</groupName>
			<baseAddress>0xF0002A00</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CLC</name>
					<description>Clock Control Register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x3</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit - DISR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit - DISS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>Sleep Mode Enable Control - EDIS</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCFG</name>
					<description>Module Configuration Register</description>
					<addressOffset>0x4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x7</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>T12</name>
							<description>T12 Available - T12</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>T13</name>
							<description>T13 Available - T13</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MCM</name>
							<description>Multi-Channel Mode Available - MCM</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x5400</resetValue>
					<resetMask>0xffffff00</resetMask>
					<fields>
						<field>
							<name>MODREV</name>
							<description>Module Revision Number - MODREV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MODNUM</name>
							<description>Module Number Value - MODNUM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MOSEL</name>
					<description>CCU60 Module Output Select Register</description>
					<addressOffset>0xC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TRIG0SEL</name>
							<description>Output Trigger Select for CCU6061 TRIG0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRIG1SEL</name>
							<description>Output Trigger Select for CCU6061 TRIG1</description>
							<bitOffset>3</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRIG2SEL</name>
							<description>Output Trigger Select for CCU6061 TRIG2</description>
							<bitOffset>6</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PISEL0</name>
					<description>Port Input Select Register 0</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ISCC60</name>
							<description>Input Select for CC60 ISCC6x (x=0,1,2)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISCC61</name>
							<description>Input Select for CC60 ISCC6x (x=0,1,2)</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISCC62</name>
							<description>Input Select for CC60 ISCC6x (x=0,1,2)</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISTRP</name>
							<description>Input Select for CTRAP - ISTRP</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISPOS0</name>
							<description>Input Select for CCPOS0 ISPOSx (x=0,1,2)</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISPOS1</name>
							<description>Input Select for CCPOS0 ISPOSx (x=0,1,2)</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISPOS2</name>
							<description>Input Select for CCPOS0 ISPOSx (x=0,1,2)</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IST12HR</name>
							<description>Input Select for T12HR - IST12HR</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PISEL2</name>
					<description>Port Input Select Register 2</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IST13HR</name>
							<description>Input Select for T13HR - IST13HR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISCNT12</name>
							<description>Input Select for T12 Counting Input - ISCNT12</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISCNT13</name>
							<description>Input Select for T13 Counting Input - ISCNT13</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>T12EXT</name>
							<description>Extension for T12HR Inputs - T12EXT</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>T13EXT</name>
							<description>Extension for T13HR Inputs - T13EXT</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KSCSR</name>
					<description>Kernel State Control Sensitivity Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SB0</name>
							<description>Sensitivity Block x  SBx (x=0,1,2,3)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SB1</name>
							<description>Sensitivity Block x  SBx (x=0,1,2,3)</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SB2</name>
							<description>Sensitivity Block x  SBx (x=0,1,2,3)</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SB3</name>
							<description>Sensitivity Block x  SBx (x=0,1,2,3)</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T12</name>
					<description>Timer T12 Counter Register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>T12CV</name>
							<description>Timer 12 Counter Value - T12CV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T12PR</name>
					<description>Timer 12 Period Register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>T12PV</name>
							<description>T12 Period Value - T12PV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T12DTC</name>
					<description>Dead-Time Control Register for Timer12</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DTM</name>
							<description>Dead-Time - DTM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTE0</name>
							<description>Dead Time Enable Bits DTEx (x=0,1,2) </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTE1</name>
							<description>Dead Time Enable Bits DTEx (x=0,1,2) </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTE2</name>
							<description>Dead Time Enable Bits DTEx (x=0,1,2) </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DTR0</name>
							<description>Dead Time Run Indication Bits DTRx (x=1,2,3)</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DTR1</name>
							<description>Dead Time Run Indication Bits DTRx (x=1,2,3)</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DTR2</name>
							<description>Dead Time Run Indication Bits DTRx (x=1,2,3)</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC60R</name>
					<description>Capture/Compare Register for Channel CC60</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CCV</name>
							<description>Capture/Compare Value - CCV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC61R</name>
					<description>Capture/Compare Register for Channel CC61</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CCV</name>
							<description>Capture/Compare Value - CCV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC62R</name>
					<description>Capture/Compare Register for Channel CC62</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CCV</name>
							<description>Capture/Compare Value - CCV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC60SR</name>
					<description>Capture/Compare Shadow Reg. for Channel CC60</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CCS</name>
							<description>Shadow Register for Channel x Capture/Compare Value - CCS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC61SR</name>
					<description>Capture/Compare Shadow Reg. for Channel CC61</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CCS</name>
							<description>Shadow Register for Channel x Capture/Compare Value - CCS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC62SR</name>
					<description>Capture/Compare Shadow Reg. for Channel CC62</description>
					<addressOffset>0x48</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CCS</name>
							<description>Shadow Register for Channel x Capture/Compare Value - CCS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T13</name>
					<description>Timer T13 Counter Register</description>
					<addressOffset>0x50</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>T13CV</name>
							<description>Timer 13 Counter Value - T13CV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T13PR</name>
					<description>Timer 13 Period Register</description>
					<addressOffset>0x54</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>T13PV</name>
							<description>T13 Period Value - T13PV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC63R</name>
					<description>Compare Register for T13</description>
					<addressOffset>0x58</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CCV</name>
							<description>Channel CC63 Compare Value - CCV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC63SR</name>
					<description>Compare Shadow Register for T13</description>
					<addressOffset>0x5C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CCS</name>
							<description>Shadow Register for Channel CC63 Compare Value - CCS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMPSTAT</name>
					<description>Compare State Register</description>
					<addressOffset>0x60</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CC60ST</name>
							<description>Capture/Compare State Bits for CC60 (x = 0, 1, 2) - CC60ST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CC61ST</name>
							<description>Capture/Compare State Bits for CC61 (x = 0, 1, 2) - CC61ST</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CC62ST</name>
							<description>Capture/Compare State Bits for CC62 (x = 0, 1, 2) - CC62ST</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CCPOS60</name>
							<description>Sampled Hall Pattern Bits - CCPOS60</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CCPOS61</name>
							<description>Sampled Hall Pattern Bits - CCPOS61</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CCPOS62</name>
							<description>Sampled Hall Pattern Bits - CCPOS62</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CC63ST</name>
							<description>Capture/Compare State Bit for CC63 - CC63ST</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CC60PS</name>
							<description>Passive State Select for Compare Outputs CC60 (x = 0, 1, 2) - CC60PS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COUT60PS</name>
							<description>Passive State Select for Compare Outputs COUT60 (x = 0, 1, 2) - COUT60PS</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC61PS</name>
							<description>Passive State Select for Compare Outputs CC61 (x = 0, 1, 2) - CC61PS</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COUT61PS</name>
							<description>Passive State Select for Compare Outputs COUT61 (x = 0, 1, 2) - COUT61PS</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC62PS</name>
							<description>Passive State Select for Compare Outputs CC62 (x = 0, 1, 2) - CC62PS</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COUT62PS</name>
							<description>Passive State Select for Compare Outputs COUT62 (x = 0, 1, 2) - COUT62PS</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COUT63PS</name>
							<description>Passive State Select for Compare Output COUT63 - COUT63PS</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>T13IM</name>
							<description>T13 Inverted Modulation - T13IM</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMPMODIF</name>
					<description>Compare State Modification Register</description>
					<addressOffset>0x64</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MCC60S</name>
							<description>Capture/Compare Status Modification Bits MCC60S (x = 0, 1, 2) - MCC60S</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC61S</name>
							<description>Capture/Compare Status Modification Bits MCC61S (x = 0, 1, 2) - MCC61S</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC62S</name>
							<description>Capture/Compare Status Modification Bits MCC62S (x = 0, 1, 2) - MCC62S</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC63S</name>
							<description>Capture/Compare Status Modification Bit MCC63S - MCC63S</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC60R</name>
							<description>Capture/Compare Status Modification Bits MCC60R (x = 0, 1, 2) - MCC60R</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC61R</name>
							<description>Capture/Compare Status Modification Bits MCC61R (x = 0, 1, 2) - MCC61R</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC62R</name>
							<description>Capture/Compare Status Modification Bits MCC62R (x = 0, 1, 2) - MCC62R</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC63R</name>
							<description>Capture/Compare Status Modification Bits MCC63R - MCC63R</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
