J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>T12MSEL</name>
					<description>T12 Mode Select Register</description>
					<addressOffset>0x68</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MSEL60</name>
							<description>Capture/Compare Mode Selection MSEL6x (x=0,1,2)</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MSEL61</name>
							<description>Capture/Compare Mode Selection MSEL6x (x=0,1,2)</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MSEL62</name>
							<description>Capture/Compare Mode Selection MSEL6x (x=0,1,2)</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HSYNC</name>
							<description>Hall Synchronization - HSYNC</description>
							<bitOffset>12</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DBYP</name>
							<description>Delay Bypass - DBYP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCTR0</name>
					<description>Timer Control Register 0</description>
					<addressOffset>0x70</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>T12CLK</name>
							<description>Timer T12 Input Clock Select - T12CLK</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>T12PRE</name>
							<description>Timer T12 Prescaler Bit - T12PRE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>T12R</name>
							<description>Timer T12 Run Bit - T12R</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>STE12</name>
							<description>Timer T12 Shadow Transfer Enable - STE12</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CDIR</name>
							<description>Count Direction of Timer T12 - CDIR</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CTM</name>
							<description>T12 Operating Mode - CTM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>T13CLK</name>
							<description>Timer T13 Input Clock Select - T13CLK</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>T13PRE</name>
							<description>Timer T13 Prescaler Bit - T13PRE</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>T13R</name>
							<description>Timer T13 Run Bit - T13R</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>STE13</name>
							<description>Timer T13 Shadow Transfer Enable - STE13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCTR2</name>
					<description>Timer Control Register 2</description>
					<addressOffset>0x74</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>T12SSC</name>
							<description>Timer T12 Single Shot Control - T12SSC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>T13SSC</name>
							<description>Timer T13 Single Shot Control - T13SSC</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>T13TEC</name>
							<description>T13 Trigger Event Control - T13TEC</description>
							<bitOffset>2</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>T13TED</name>
							<description>Timer T13 Trigger Event Direction - T13TED</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>T12RSEL</name>
							<description>Timer T12 External Run Selection - T12RSEL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>T13RSEL</name>
							<description>Timer T13 External Run Selection - T13RSEL</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCTR4</name>
					<description>Timer Control Register 4</description>
					<addressOffset>0x78</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>T12RR</name>
							<description>Timer T12 Run Reset - T12RR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>T12RS</name>
							<description>Timer T12 Run Set - T12RS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>T12RES</name>
							<description>Timer T12 Reset - T12RES</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DTRES</name>
							<description>Dead-Time Counter Reset - DTRES</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>T12CNT</name>
							<description>Timer T12 Count Event - T12CNT</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>T12STR</name>
							<description>Timer T12 Shadow Transfer Request - T12STR</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>T12STD</name>
							<description>Timer T12 Shadow Transfer Disable - T12STD</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>T13RR</name>
							<description>Timer T13 Run Reset - T13RR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>T13RS</name>
							<description>Timer T13 Run Set - T13RS</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>T13RES</name>
							<description>Timer T13 Reset - T13RES</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>T13CNT</name>
							<description>Timer T13 Count Event - T13CNT</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>T13STR</name>
							<description>Timer T13 Shadow Transfer Request - T13STR</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>T13STD</name>
							<description>Timer T13 Shadow Transfer Disable - T13STD</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MODCTR</name>
					<description>Modulation Control Register</description>
					<addressOffset>0x80</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>T12MODEN</name>
							<description>T12 Modulation Enable - T12MODEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCMEN</name>
							<description>Multi-Channel Mode Enable - MCMEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>T13MODEN</name>
							<description>T13 Modulation Enable - T13MODEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ECT13O</name>
							<description>Enable Compare Timer T13 Output - ECT13O</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRPCTR</name>
					<description>Trap Control Register</description>
					<addressOffset>0x84</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TRPM0</name>
							<description>Trap Mode Control Bit 0 - TRPM0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRPM1</name>
							<description>Trap Mode Control Bit 1 - TRPM1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRPM2</name>
							<description>Trap Mode Control Bit 2 - TRPM2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRPEN</name>
							<description>Trap Enable Control - TRPEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRPEN13</name>
							<description>Trap Enable Control for Timer T13 - TRPEN13</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRPPEN</name>
							<description>Trap Pin Enable - TRPPEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PSLR</name>
					<description>Passive State Level Register</description>
					<addressOffset>0x88</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PSL</name>
							<description>Compare Outputs Passive State Level - PSL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PSL63</name>
							<description>Passive State Level of Output COUT63 - PSL63</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCMOUTS</name>
					<description>Multi-Channel Mode Output Shadow Register</description>
					<addressOffset>0x8C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MCMPS</name>
							<description>Multi-Channel PWM Pattern Shadow - MCMPS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STRMCM</name>
							<description>Shadow Transfer Request for MCMPS - STRMCM</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EXPHS</name>
							<description>Expected Hall Pattern Shadow - EXPHS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CURHS</name>
							<description>Current Hall Pattern Shadow - CURHS</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STRHP</name>
							<description>Shadow Transfer Request for the Hall Pattern - STRHP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCMOUT</name>
					<description>Multi-Channel Mode Output Register</description>
					<addressOffset>0x90</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MCMP</name>
							<description>Multi-Channel PWM Pattern - MCMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>R</name>
							<description>Reminder Flag - R</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EXPH</name>
							<description>Expected Hall Pattern - EXPH</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CURH</name>
							<description>Current Hall Pattern - CURH</description>
							<bitOffset>11</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MCMCTR</name>
					<description>Multi-Channel Mode Control Register</description>
					<addressOffset>0x94</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SWSEL</name>
							<description>Switching Selection - SWSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SWSYN</name>
							<description>Switching Synchronization - SWSYN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STE12U</name>
							<description>Shadow Transfer Enable for T12 Upcounting - STE12U</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STE12D</name>
							<description>Shadow Transfer Enable for T12 Downcounting - STE12D</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STE13U</name>
							<description>Shadow Transfer Enable for T13 Upcounting - STE13U</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IMON</name>
					<description>Input Monitoring Register</description>
					<addressOffset>0x98</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>LBE</name>
							<description>Lost Bit Event - LBE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCPOS0I</name>
							<description>Event indication for input signal CCPOS0 - CCPOS0I</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCPOS1I</name>
							<description>Event indication for input signal CCPOS1 - CCPOS1I</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCPOS2I</name>
							<description>Event indication for input signal CCPOS2 - CCPOS2I</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC60INI</name>
							<description>Event indication for input signal CC60IN - CC60INI</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC61INI</name>
							<description>Event indication for input signal CC61IN - CC61INI</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC62INI</name>
							<description>Event indication for input signal CC62IN - CC62INI</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CTRAPI</name>
							<description>Event indication for input signal CTRAP - CTRAPI</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>T12HRI</name>
							<description>Event indication for input signal T12HR - T12HRI</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>T13HRI</name>
							<description>Event indication for input signal T13HR - T13HRI</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LI</name>
					<description>Lost Indicator Register</description>
					<addressOffset>0x9C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CCPOS0EN</name>
							<description>Lost Indicator Enable for input signal CCPOS0 - CCPOS0EN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCPOS1EN</name>
							<description>Lost Indicator Enable for input signal CCPOS1 - CCPOS1EN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CCPOS2EN</name>
							<description>Lost Indicator Enable for input signal CCPOS2 - CCPOS2EN</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC60INEN</name>
							<description>Lost Indicator Enable for input signal CC60IN - CC60INEN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC61INEN</name>
							<description>Lost Indicator Enable for input signal CC61IN - CC61INEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CC62INEN</name>
							<description>Lost Indicator Enable for input signal CC62IN - CC62INEN</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CTRAPEN</name>
							<description>Lost Indicator Enable for input signal CTRAP - CTRAPEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>T12HREN</name>
							<description>Lost Indicator Enable for input signal T12HR - T12HREN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>T13HREN</name>
							<description>Lost Indicator Enable for input signal T13HR - T13HREN</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LBEEN</name>
							<description>Interrupt Enable for Lost Bit Event - LBEEN</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPLBE</name>
							<description>Interrupt Node Pointer for lost bit event - INPLBE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
