J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>PMSWSTATCLR</name>
					<description>Standby and Wake-up Status Clear Register</description>
					<addressOffset>0xE8</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ESR0WKPCLR</name>
							<description>ESR0 Wake-up indication flag clear - ESR0WKPCLR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ESR1WKPCLR</name>
							<description>ESR1 Wake-up indication flag clear - ESR1WKPCLR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PINAWKPCLR</name>
							<description>PINA Wake-up indication flag clear - PINAWKPCLR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PINBWKPCLR</name>
							<description>PINB Wake-up indication flag clear - PINBWKPCLR</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PWRWKPCLR</name>
							<description>PWRWKP Wake-up indication flag clear - PWRWKPCLR</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCRWKPCLR</name>
							<description>SCR Wake-up indication flag clear - SCRWKPCLR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PORSTWKPCLR</name>
							<description>PORST Wake-up indication flag clear - PORSTWKPCLR</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>WUTWKPCLR</name>
							<description>WUT Wake-up indication flag clear - WUTWKPCLR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ESR0OVRUNCLR</name>
							<description>ESR0 Overrun status indication flag clear - ESR0OVRUNCLR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ESR1OVRUNCLR</name>
							<description>ESR1 Overrun status indication flag clear - ESR1OVRUNCLR</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PINAOVRUNCLR</name>
							<description>PINA Overrun status indication flag clear - PINAOVRUNCLR</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PINBOVRUNCLR</name>
							<description>PINB Overrun status indication flag clear - PINBOVRUNCLR</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCROVRUNCLR</name>
							<description>SCR Overrun status indication flag clear - SCROVRUNCLR</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PORSTOVRUNCLR</name>
							<description>PORST Overrun status indication flag clear - PORSTOVRUNCLR</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>WUTOVRUNCLR</name>
							<description>WUT Overrun status indication flag clear - WUTOVRUNCLR</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SCRSTCLR</name>
							<description>Standby controller SCRST indication flag clear - SCRSTCLR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ESR0INTCLR</name>
							<description>ESR0 Interrupt indication flag clear - ESR0INTCLR</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ESR1INTCLR</name>
							<description>ESR1 Interrupt indication flag clear - ESR1INTCLR</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PINAINTCLR</name>
							<description>PINA Interrupt indication flag clear - PINAINTCLR</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PINBINTCLR</name>
							<description>PINB Interrupt indication flag clear - PINBINTCLR</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDSTAT0</name>
					<description>EVR SD Status Register 0</description>
					<addressOffset>0xFC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ADCFBCV</name>
							<description>Step Down Converter Core Voltage Feedback ADC Conversion Result - ADCFBCV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DPWMOUT</name>
							<description>DPWM Control Output Status - DPWMOUT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL0</name>
					<description>EVRC SD Control Register 0</description>
					<addressOffset>0x108</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xf0390001</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SDFREQSPRD</name>
							<description>Frequency Spread Threshold(freqsp_coeff_i) - SDFREQSPRD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDFREQ</name>
							<description>Regulator Switching Frequency or Over-sampling Factor(m0osfl_fact_i+m0osfh_fact_i) - SDFREQ</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NGOFF</name>
							<description>NMOS level during OFF state(drvslo_ngoff_i) - NGOFF</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PGOFF</name>
							<description>PMOS level during OFF state(drvslo_pgoff_i) - PGOFF</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UP</name>
							<description>Update request for SMPS register values - UP</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL1</name>
					<description>EVRC SD Control Register 1</description>
					<addressOffset>0x10C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x86690708</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>M0TOFF</name>
							<description>Minimum Off Time(m0toff_mintof_i) - M0TOFF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0TON</name>
							<description>Minimum On Time(m0ton_minton_i) - M0TON</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S0COEFF</name>
							<description>S0 coefficient(m0s0_coeff_i) - M0S0COEFF</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0DEADBD</name>
							<description>Dead Band(m0s0_deadbd_i) - M0DEADBD</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0ADCZB</name>
							<description>ADC Zero Bin(m0fcfg_adczb_i) - M0ADCZB</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0SKIP</name>
							<description>Skip Pulse Threshold(m0skip_thres_i) - M0SKIP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNCEN</name>
							<description>EVRC Synchronization input enable(synci0_en_i) - SYNCEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL2</name>
					<description>EVRC SD Control Register 2</description>
					<addressOffset>0x110</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x36033b</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>LPBNDOFFSET</name>
							<description>Low Power Mode Hysteresis OFFSET(lpbnd_offset_i) - LPBNDOFFSET</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LPBNDWIDTH</name>
							<description>Low Power Mode Hysteresis Band Width(lpbnd_width_i) - LPBNDWIDTH</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LPLPFCOEFF</name>
							<description>Low Pass Filter Coefficient(lplpf_coeff_i) - LPLPFCOEFF</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDFREQLP</name>
							<description>Regulator Over-sampling Factor(m1osfl_fact_i+m1osfh_fact_i) - SDFREQLP</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVRCMOD</name>
							<description>LPM or PWM EVRC Mode Activation - EVRCMOD</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL3</name>
					<description>EVRC SD Control Register 3</description>
					<addressOffset>0x114</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xb690810</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>M1TOFF</name>
							<description>Minimum Off Time(m1toff_mintof_i) - M1TOFF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1TON</name>
							<description>Minimum On Time(m1ton_minton_i) - M1TON</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S0COEFF</name>
							<description>S0 coefficient(m1s0_coeff_i) - M1S0COEFF</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1DEADBD</name>
							<description>Dead Band(m1s0_deadbd_i) - M1DEADBD</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1ADCZB</name>
							<description>ADC Zero Bin(m1fcfg_adczb_i) - M1ADCZB</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1SKIP</name>
							<description>Skip Pulse Threshold(m1skip_thres_i) - M1SKIP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL4</name>
					<description>EVRC SD Control Register 4</description>
					<addressOffset>0x118</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x360009</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VOKCFG</name>
							<description>Voltage OK Circuit Configuration(vokcfg_config_i) - VOKCFG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDFREQST</name>
							<description>Regulator Switching Frequency or Over-sampling Factor(m2osfl_fact_i+m2osfh_fact_i) - SDFREQST</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL5</name>
					<description>EVRC SD Control Register 5</description>
					<addressOffset>0x11C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xb690808</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>M2TOFF</name>
							<description>Minimum Off Time(m2toff_mintof_i) - M2TOFF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2TON</name>
							<description>Minimum On Time(m2ton_minton_i) - M2TON</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S0COEFF</name>
							<description>S0 coefficient(m2s0_coeff_i) - M2S0COEFF</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2DEADBD</name>
							<description>Dead Band(m2s0_deadbd_i) - M2DEADBD</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2ADCZB</name>
							<description>ADC Zero Bin(m2fcfg_adczb_i) - M2ADCZB</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2SKIP</name>
							<description>Skip Pulse Threshold(m2skip_thres_i) - M2SKIP</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL6</name>
					<description>EVRC SD Control Register 6</description>
					<addressOffset>0x120</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x80231c94</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SVINTH</name>
							<description>Vin threshold to switch between SINCLO or SINCHI.(svinth_thres_i) - SVINTH</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SVOTH</name>
							<description>Vout threshold to switch from open loop start-up to closed loop mode.(svoth_thres_i) - SVOTH</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SINCLO</name>
							<description>Increment for low input voltage.(sinc_sinclo_i) - SINCLO</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SINCHI</name>
							<description>Increment for high input voltage.(sinc_sinchi_i) - SINCHI</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL7</name>
					<description>EVRC SD Control Register 7</description>
					<addressOffset>0x124</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x800000fe</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRVNI</name>
							<description>Selection of N-driver current - DRVNI</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRVPCBF</name>
							<description>P-Driver Current Boost Factor(drvp_strgth_i) - DRVPCBF</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRVP</name>
							<description>P-Driver Current(drvp_strgth_i) - DRVP</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRVSLOMODE</name>
							<description>Switching Configuration(drvslo_mode_i) - DRVSLOMODE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRVSPR</name>
							<description>Spare bits(drvspr_x_i) - DRVSPR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNCDIVFAC</name>
							<description>Switching frequency division factor for external synchronisation(synco_divfac_i) - SYNCDIVFAC</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL8</name>
					<description>EVRC SD Control Register 8</description>
					<addressOffset>0x128</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x9121048e</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FBADCOFFS</name>
							<description>Feedback Converted Counter Value Offset(fbadc2_offset_i) - FBADCOFFS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FBADCSMP</name>
							<description>FB ADC Sampling period(fbadc1_smpthr_i) - FBADCSMP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FBADCBLNK</name>
							<description>FB ADC Blanked Samples Number(fbadc0_blank_i) - FBADCBLNK</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FBADCLPF</name>
							<description>FB ADC Counter LPF Coefficient(fbadc0_lpfcnt_i) - FBADCLPF</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FBADCERR</name>
							<description>FB ADC Error LPF Coefficient(fbadc3_lpferr_i) - FBADCERR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FBADCLSB</name>
							<description>FB ADC LSB for Error Computation(fbadc3_lsb_i) - FBADCLSB</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL9</name>
					<description>EVRC SD Control Register 9</description>
					<addressOffset>0x12C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x80000434</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FFADCOFFS</name>
							<description>Feed Forward Converted Counter Value Offset(ffadc1_offset_i) - FFADCOFFS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FFADCLPF</name>
							<description>FF ADC Counter LPF Coefficient(ffadc0_lpfcnt_i) - FFADCLPF</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCTRL10</name>
					<description>EVRC SD Control Register 10</description>
					<addressOffset>0x130</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x5a82</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SHVH</name>
							<description>Short to High Voltage Threshold(shrth1_shvh_i) - SHVH</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SHVL</name>
							<description>Short to Low Voltage Threshold(shrtl1_shvl_i) - SHVL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SHHVEN</name>
							<description>Short to High Detection Enable(shrth0_shhven_i) - SHHVEN</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SHLVEN</name>
							<description>Short to Low Detection Enable(shrtl0_shlven_i) - SHLVEN</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
