J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>EVRSDCTRL11</name>
					<description>EVRC SD Control Register 11</description>
					<addressOffset>0x134</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x92070909</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DROOPVH</name>
							<description>High VDD Limit for Droop request(droopvh_thres_i) - DROOPVH</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DROOPVL</name>
							<description>Low VDD Limit for Droop request(droopvl_thres_i) - DROOPVL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNCMAXDEV</name>
							<description>Maximum Deviation of the Synchronization Input Frequency(synci1_maxdev_i) - SYNCMAXDEV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNCHYST</name>
							<description>Lock Unlock Hysteresis Window(synci0_hyst_i) - SYNCHYST</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNCMUXSEL</name>
							<description>Synchronisation Input Multiplexer - SYNCMUXSEL</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCOEFF0</name>
					<description>EVRC SD Coefficient Register 0</description>
					<addressOffset>0x148</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xb50873b6</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>M0S0EN</name>
							<description>S0 Enable(m0en_s0en_i) - M0S0EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S2EN</name>
							<description>S2 Enable(m0en_s2en_i) - M0S2EN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S3EN</name>
							<description>S3 Enable(m0en_s3en_i) - M0S3EN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S3CLIP</name>
							<description>S3 Clip(m0en_s3clip_i) - M0S3CLIP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S4EN</name>
							<description>S4 Enable(m0en_s4en_i) - M0S4EN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0RAMPEN</name>
							<description>Ramp Enable(m0en_rampen_i) - M0RAMPEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0SFRGET</name>
							<description>SFRGET(m0en_sfrget_i) - M0SFRGET</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0SKIPEN</name>
							<description>Skip Enable(m0en_skipen_i) - M0SKIPEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S3COEFF</name>
							<description>S3 Coefficient(m0s3_coeff_i) - M0S3COEFF</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S4COEFF</name>
							<description>S4 Coefficient(m0s4_coeff_i) - M0S4COEFF</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0SRMPCOEFF</name>
							<description>S Ramp Coefficient(m0srmp_coeff_i) - M0SRMPCOEFF</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0FGETCOEFF</name>
							<description>S2 Forgetting Factor(m0fget_coeff_i) - M0FGETCOEFF</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S2COEFF</name>
							<description>S2 Coefficient(m0s2_coeff_i) - M0S2COEFF</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S2VINSRC</name>
							<description>S2 Vin Source(m0s2_vinsrc_i) - M0S2VINSRC</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S2VOSRC</name>
							<description>S2 Vout Source(m0s2_vosrc_i) - M0S2VOSRC</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0SRMPCOEFFFRAC</name>
							<description>S Ramp Fractional Coefficient</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCOEFF1</name>
					<description>EVRC SD Coefficient Register 1</description>
					<addressOffset>0x14C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xa2946c46</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>M0VOCFLPF</name>
							<description>LPF Coefficient(m0vocf_lpf_i) - M0VOCFLPF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0VOCFINC</name>
							<description>Output Voltage Ramp Coefficient(m0vocf_inc_i) - M0VOCFINC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0VOUT</name>
							<description>Digital representation of the target voltage(m0vo_lb_i) - M0VOUT</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0VIN</name>
							<description>Digital representation of the input voltage(m0vinh_vin_i+m0vinl_vin_i)) - M0VIN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S3COEFFFRAC</name>
							<description>S3 Fractional Coefficient</description>
							<bitOffset>27</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M0S2COEFFFRAC</name>
							<description>S2 Fractional Coefficient</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCOEFF2</name>
					<description>EVRC SD Coefficient Register 2</description>
					<addressOffset>0x150</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x3408710e</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>M1S0EN</name>
							<description>S0 Enable(m1en_s0en_i) - M1S0EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S2EN</name>
							<description>S2 Enable(m1en_s2en_i) - M1S2EN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S3EN</name>
							<description>S3 Enable(m1en_s3en_i) - M1S3EN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S3CLIP</name>
							<description>S3 Clip(m1en_s3clip_i) - M1S3CLIP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S4EN</name>
							<description>S4 Enable(m1en_s4en_i) - M1S4EN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1RAMPEN</name>
							<description>Ramp Enable(m1en_rampen_i) - M1RAMPEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1SFRGET</name>
							<description>SFRGET(m1en_sfrget_i) - M1SFRGET</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1SKIPEN</name>
							<description>Skip Enable(m1en_skipen_i) - M1SKIPEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S3COEFF</name>
							<description>S3 Coefficient(m1s3_coeff_i) - M1S3COEFF</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S4COEFF</name>
							<description>S4 Coefficient(m1s4_coeff_i) - M1S4COEFF</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1SRMPCOEFF</name>
							<description>S Ramp Coefficient(m1srmp_coeff_i) - M1SRMPCOEFF</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1FGETCOEFF</name>
							<description>S2 Forgetting Factor(m1fget_coeff_i) - M1FGETCOEFF</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S2COEFF</name>
							<description>S2 Coefficient(m1s2_coeff_i) - M1S2COEFF</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S2VINSRC</name>
							<description>S2 Vin Source(m1s2_vinsrc_i) - M1S2VINSRC</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S2VOSRC</name>
							<description>S2 Vout Source(m1s2_vosrc_i) - M1S2VOSRC</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCOEFF3</name>
					<description>EVRC SD Coefficient Register 3</description>
					<addressOffset>0x154</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x2946c44</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>M1VOCFLPF</name>
							<description>LPF Coefficient(m1vocf_lpf_i) - M1VOCFLPF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1VOCFINC</name>
							<description>Output Voltage Ramp Coefficient(m1vocf_inc_i) - M1VOCFINC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1VOUT</name>
							<description>Digital representation of the target voltage(m1vo_lb_i) - M1VOUT</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1VIN</name>
							<description>Digital representation of the input voltage(m1vinh_vin_i+m1vinl_vin_i) - M1VIN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S3COEFFFRAC</name>
							<description>S3 Fractional Coefficient</description>
							<bitOffset>27</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1S2COEFFFRAC</name>
							<description>S2 Fractional Coefficient</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M1SRMPCOEFFFRAC</name>
							<description>S Ramp Fractional Coefficient</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCOEFF4</name>
					<description>EVRC SD Coefficient Register 4</description>
					<addressOffset>0x158</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1b0822b6</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>M2S0EN</name>
							<description>S0 Enable(m2en_s0en_i) - M2S0EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S2EN</name>
							<description>S2 Enable(m2en_s2en_i) - M2S2EN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S3EN</name>
							<description>S3 Enable(m2en_s3en_i) - M2S3EN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S3CLIP</name>
							<description>S3 Clip(m2en_s3clip_i) - M2S3CLIP</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S4EN</name>
							<description>S4 Enable(m2en_s4en_i) - M2S4EN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2RAMPEN</name>
							<description>Ramp Enable(m2en_rampen_i) - M2RAMPEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2SFRGET</name>
							<description>SFRGET(m2en_sfrget_i) - M2SFRGET</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2SKIPEN</name>
							<description>Skip Enable(m2en_skipen_i) - M2SKIPEN</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S3COEFF</name>
							<description>S3 Coefficient(m2s3_coeff_i) - M2S3COEFF</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S4COEFF</name>
							<description>S4 Coefficient(m2s4_coeff_i) - M2S4COEFF</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2SRMPCOEFF</name>
							<description>S Ramp Coefficient(m2srmp_coeff_i) - M2SRMPCOEFF</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2FGETCOEFF</name>
							<description>S2 Forgetting Factor(m2fget_coeff_i) - M2FGETCOEFF</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S2COEFF</name>
							<description>S2 Coefficient(m2s2_coeff_i) - M2S2COEFF</description>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S2VINSRC</name>
							<description>S2 Vin Source(m2s2_vinsrc_i) - M2S2VINSRC</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S2VOSRC</name>
							<description>S2 Vout Source(m2s2_vosrc_i) - M2S2VOSRC</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCOEFF5</name>
					<description>EVRC SD Coefficient Register 5</description>
					<addressOffset>0x15C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x2946c46</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>M2VOCFLPF</name>
							<description>LPF Coefficient(m2vocf_lpf_i) - M2VOCFLPF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2VOCFINC</name>
							<description>Output Voltage Ramp Coefficient(m2vocf_inc_i) - M2VOCFINC</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2VOUT</name>
							<description>Digital representation of the target voltage(m2vo_lb_i) - M2VOUT</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2VIN</name>
							<description>Digital representation of the input voltage(m2vinh_vin_i+m2vinl_vin_i) - M2VIN</description>
							<bitOffset>16</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S3COEFFFRAC</name>
							<description>S3 Fractional Coefficient</description>
							<bitOffset>27</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2S2COEFFFRAC</name>
							<description>S2 Fractional Coefficient</description>
							<bitOffset>29</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>M2SRMPCOEFFFRAC</name>
							<description>S Ramp Fractional Coefficient</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCOEFF6</name>
					<description>EVRC SD Coefficient Register 6</description>
					<addressOffset>0x160</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x80971802</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CT5REG0</name>
							<description>Commutation trimming and Slope Control(drv5v0_trim_i) - CT5REG0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CT5REG1</name>
							<description>Commutation trimming(drv5v1_trim_i) - CT5REG1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CT5REG2</name>
							<description>Commutation trimming(drv5v2_trim_i) - CT5REG2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCOEFF7</name>
					<description>EVRC SD Coefficient Register 7</description>
					<addressOffset>0x164</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x8000d8f7</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CT5REG3</name>
							<description>Commutation trimming(drv5v3_trim_i) - CT5REG3</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CT5REG4</name>
							<description>Commutation trimming(drv5v4_trim_i) - CT5REG4</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCOEFF8</name>
					<description>EVRC SD Coefficient Register 8</description>
					<addressOffset>0x168</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x80171002</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CT33REG0</name>
							<description>Commutation trimming(drv3v0_trim_i) - CT33REG0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CT33REG1</name>
							<description>Commutation trimming(drv3v1_trim_i) - CT33REG1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CT33REG2</name>
							<description>Commutation trimming(drv3v2_trim_i) - CT33REG2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EVRSDCOEFF9</name>
					<description>EVRC SD Coefficient Register 9</description>
					<addressOffset>0x16C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x8000a0af</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CT33REG3</name>
							<description>Commutation trimming(drv3v3_trim_i) - CT33REG3</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CT33REG4</name>
							<description>Commutation trimming(drv3v4_trim_i) - CT33REG4</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LCK</name>
							<description>Lock Status - LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
