J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>OMR</name>
					<description>ESR Output Modification Register</description>
					<addressOffset>0xA8</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PS0</name>
							<description>ESRx Pin Set Bit 0 - PS0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PS1</name>
							<description>ESRx Pin Set Bit 1 - PS1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL0</name>
							<description>ESRx Pin Clear Bit 0 - PCL0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PCL1</name>
							<description>ESRx Pin Clear Bit 1 - PCL1</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IN</name>
					<description>ESR Input Register</description>
					<addressOffset>0xAC</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xfffffff0</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>Input Bit 0 - P0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>P1</name>
							<description>Input Bit 1 - P1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STSTAT</name>
					<description>STSTAT</description>
					<addressOffset>0xC0</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x8000</resetValue>
					<resetMask>0xfff0ff00</resetMask>
					<fields>
						<field>
							<name>HWCFG</name>
							<description>Hardware Configuration Setting - HWCFG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FTM</name>
							<description>Firmware Test Setting - FTM</description>
							<bitOffset>8</bitOffset>
							<bitWidth>7</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MODE</name>
							<description>MODE - MODE</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FCBAE</name>
							<description>Flash Config. Sector Access Enable - FCBAE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>LUDIS</name>
							<description>Latch Update Disable - LUDIS</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRSTL</name>
							<description>TRSTL Status - TRSTL</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SPDEN</name>
							<description>Single Pin DAP Mode Enable - SPDEN</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RAMINT</name>
							<description>RAM Content Security Integrity - RAMINT</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STCON</name>
					<description>Start-up Configuration Register</description>
					<addressOffset>0xC4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SFCBAE</name>
							<description>Set Flash Config. Sector Access Enable - SFCBAE</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CFCBAE</name>
							<description>Clear Flash Config. Sector Access Enable - CFCBAE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>STP</name>
							<description>Start-up Protection Setting - STP</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCSR0</name>
					<description>Power Management Control and Status Register</description>
					<addressOffset>0xC8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x100</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REQSLP</name>
							<description>Idle Mode and Sleep Mode Request - REQSLP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PMST</name>
							<description>Power management Status - PMST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCSR1</name>
					<description>Power Management Control and Status Register</description>
					<addressOffset>0xCC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x100</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REQSLP</name>
							<description>Idle Mode and Sleep Mode Request - REQSLP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PMST</name>
							<description>Power management Status - PMST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCSR2</name>
					<description>Power Management Control and Status Register</description>
					<addressOffset>0xD0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x100</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REQSLP</name>
							<description>Idle Mode and Sleep Mode Request - REQSLP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PMST</name>
							<description>Power management Status - PMST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCSR3</name>
					<description>Power Management Control and Status Register</description>
					<addressOffset>0xD4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x100</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REQSLP</name>
							<description>Idle Mode and Sleep Mode Request - REQSLP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PMST</name>
							<description>Power management Status - PMST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCSR4</name>
					<description>Power Management Control and Status Register</description>
					<addressOffset>0xD8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x100</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REQSLP</name>
							<description>Idle Mode and Sleep Mode Request - REQSLP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PMST</name>
							<description>Power management Status - PMST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCSR5</name>
					<description>Power Management Control and Status Register</description>
					<addressOffset>0xDC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x100</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REQSLP</name>
							<description>Idle Mode and Sleep Mode Request - REQSLP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PMST</name>
							<description>Power management Status - PMST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSTAT0</name>
					<description>Power Management Status Register 0</description>
					<addressOffset>0xE4</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CPU0</name>
							<description>CPU0 Status - CPU0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1</name>
							<description>CPU1 Status - CPU1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2</name>
							<description>CPU2 Status - CPU2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU3</name>
							<description>CPU3 Status - CPU3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU4</name>
							<description>CPU4 Status - CPU4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU5</name>
							<description>CPU5 Status - CPU5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU0LS</name>
							<description>CPU0LS Status - CPU0LS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU1LS</name>
							<description>CPU1LS Status - CPU1LS</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU2LS</name>
							<description>CPU2LS Status - CPU2LS</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CPU3LS</name>
							<description>CPU3LS Status - CPU3LS</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PMSWCR1</name>
					<description>Standby and Wake-up Control Register 1</description>
					<addressOffset>0xE8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CPUIDLSEL</name>
							<description>CPU selection for Idle mode - CPUIDLSEL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IRADIS</name>
							<description>Idle-Request-Acknowledge Sequence Disable - IRADIS</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CPUSEL</name>
							<description>CPU selection for Sleep and Standby mode - CPUSEL</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>STBYEVEN</name>
							<description>Standby Entry Event configuration enable - STBYEVEN</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>STBYEV</name>
							<description>Standby Entry Event Configuration - STBYEV</description>
							<bitOffset>28</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EMSR</name>
					<description>Emergency Stop Register</description>
					<addressOffset>0xFC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>POL</name>
							<description>Input Polarity - POL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE</name>
							<description>Mode Selection - MODE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENON</name>
							<description>Enable ON - ENON</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PSEL</name>
							<description>PORT Select - PSEL</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EMSF</name>
							<description>Emergency Stop Flag - EMSF</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SEMSF</name>
							<description>SMU Emergency Stop Flag - SEMSF</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>EMSSW</name>
					<description>Emergency Stop Software set and clear register</description>
					<addressOffset>0x100</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>EMSFM</name>
							<description>Emergency Stop Flag Modification - EMSFM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SEMSFM</name>
							<description>SMU Emergency Stop Flag Modification - SEMSFM</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DTSCSTAT</name>
					<description>Core Die Temperature Sensor Status Register</description>
					<addressOffset>0x104</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of the DTSC Measurement - RESULT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DTSCLIM</name>
					<description>Core Die Temperature Sensor Limit Register</description>
					<addressOffset>0x108</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xcd806d6</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>LOWER</name>
							<description>DTSC Lower Limit - LOWER</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BGPOK</name>
							<description>DTSC Bandgap OK</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EN</name>
							<description>DTSC Enable</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>LLU</name>
							<description>DTSC Lower Limit Underflow - LLU</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UPPER</name>
							<description>DTSC Upper Limit - UPPER</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INTEN</name>
							<description>DTSC Interrupt Enable</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INT</name>
							<description>DTSC Interrupt status flag</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>UOF</name>
							<description>DTSC Upper Limit Overflow - UOF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRAPDIS1</name>
					<description>Trap Disable Register 1</description>
					<addressOffset>0x120</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xffff</resetValue>
					<resetMask>0xffffffff</resetMask>
				</register>
				<register>
					<name>TRAPSTAT</name>
					<description>Trap Status Register</description>
					<addressOffset>0x124</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xfffffff0</resetMask>
					<fields>
						<field>
							<name>ESR0T</name>
							<description>ESR0 Trap Request Flag - ESR0T</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ESR1T</name>
							<description>ESR1 Trap Request Flag - ESR1T</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TRAP2</name>
							<description>Trap Bit 2 Request Flag - TRAP2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SMUT</name>
							<description>SMU Alarm Trap Request Flag - SMUT</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRAPSET</name>
					<description>Trap Set Register</description>
					<addressOffset>0x128</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ESR0T</name>
							<description>Set Trap Request Flag ESR0T - ESR0T</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ESR1T</name>
							<description>Set Trap Request Flag ESR1T - ESR1T</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TRAP2</name>
							<description>Set Trap Request Flag TRAP2 - TRAP2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SMUT</name>
							<description>Set Trap Request Flag SMUT - SMUT</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TRAPCLR</name>
					<description>Trap Clear Register</description>
					<addressOffset>0x12C</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ESR0T</name>
							<description>Clear Trap Request Flag ESR0T - ESR0T</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ESR1T</name>
							<description>Clear Trap Request Flag ESR1T - ESR1T</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TRAP2</name>
							<description>Clear Trap Request Flag TRAP2 - TRAP2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SMUT</name>
							<description>Clear Trap Request Flag SMUT - SMUT</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
