J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SMU</name>
			<version>100</version>
			<description>ce_smu</description>
			<groupName>SMU</groupName>
			<baseAddress>0xF0036800</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0x800</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CLC</name>
					<description>Clock Control Register</description>
					<addressOffset>0x0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DISR</name>
							<description>Module Disable Request Bit - DISR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DISS</name>
							<description>Module Disable Status Bit - DISS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EDIS</name>
							<description>Sleep Mode Enable Control - EDIS</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register</description>
					<addressOffset>0x8</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x89c001</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number - MOD_REV</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type - MOD_TYPE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value - MOD_NUMBER</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMD</name>
					<description>Command Register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMD</name>
							<description>Implements the SMU_core Command Interface. - CMD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ARG</name>
							<description>Implements the SMU_core Command Interface. - ARG</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STS</name>
					<description>Status Register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xfffff3ff</resetMask>
					<fields>
						<field>
							<name>CMD</name>
							<description>Last command received - CMD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ARG</name>
							<description>Last command argument received - ARG</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RES</name>
							<description>Result of last received command - RES</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ASCE</name>
							<description>Alarm Status Clear Enable - ASCE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FSP</name>
							<description>Fault Signaling Protocol status - FSP</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FSTS</name>
							<description>Fault State Timing Status - FSTS</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTS0</name>
							<description>Recovery Timer 0 Status - RTS0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTME0</name>
							<description>Recovery Timer 0 Missed Event - RTME0</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTS1</name>
							<description>Recovery Timer 1 Status - RTS1</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTME1</name>
							<description>Recovery Timer 1 Missed Event - RTME1</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FSP</name>
					<description>Fault Signaling Protocol</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x3fff00</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>PRE1</name>
							<description>Prescaler1 - PRE1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PRE2</name>
							<description>Prescaler2 - PRE2</description>
							<bitOffset>3</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MODE</name>
							<description>Fault Signaling Protocol configuration - MODE</description>
							<bitOffset>5</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PES</name>
							<description>Port Emergency Stop (PES) - PES</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TFSP_LOW</name>
							<description>Specifies the FSP fault state duration - TFSP_LOW</description>
							<bitOffset>8</bitOffset>
							<bitWidth>14</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TFSP_HIGH</name>
							<description>Specifies the FSP fault state duration - TFSP_HIGH</description>
							<bitOffset>22</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AGC</name>
					<description>Alarm Global Configuration</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IGCS0</name>
							<description>Interrupt Generation Configuration Set 0 - IGCS0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IGCS1</name>
							<description>Interrupt Generation Configuration Set 1 - IGCS1</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IGCS2</name>
							<description>Interrupt Generation Configuration Set 2 - IGCS2</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RCS</name>
							<description>CPU Reset Configuration Set - RCS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PES</name>
							<description>Port Emergency Stop - PES</description>
							<bitOffset>24</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EFRST</name>
							<description>Enable FAULT to RUN State Transition - EFRST</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RTC</name>
					<description>Recovery Timer Configuration</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x3fff03</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RT0E</name>
							<description>RT0 Enable Bit - RT0E</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RT1E</name>
							<description>RT1 Enable Bit - RT1E</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTD</name>
							<description>Recovery Timer Duration - RTD</description>
							<bitOffset>8</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>KEYS</name>
					<description>Key Register</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CFGLCK</name>
							<description>Configuration Lock - CFGLCK</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PERLCK</name>
							<description>Permanent Lock - PERLCK</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DBG</name>
					<description>Debug Register</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SSM</name>
							<description>Running state of the SMU_core State Machine - SSM</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PCTL</name>
					<description>Port Control</description>
					<addressOffset>0x3C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x8000</resetValue>
					<resetMask>0xff80ffff</resetMask>
					<fields>
						<field>
							<name>HWDIR</name>
							<description>Port Direction. - HWDIR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>HWEN</name>
							<description>Port Enable - HWEN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GFSCU_EN</name>
							<description>Glitch Filter for ErrorPin SMU_FSP0 to SCU enable - GFSCU_EN</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GFSTS_EN</name>
							<description>Glitch Filter for ErrorPin SMU_FSP0 to register SMU_STS enable - GFSTS_EN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PCS</name>
							<description>PAD Configuration Select - PCS</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AFCNT</name>
					<description>Alarm and Fault Counter</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FCNT</name>
							<description>Fault Counter. - FCNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ACNT</name>
							<description>Alarm Counter. - ACNT</description>
							<bitOffset>4</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FCO</name>
							<description>Fault Counter Overflow. - FCO</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ACO</name>
							<description>Alarm Counter Overflow. - ACO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RTAC00</name>
					<description>Recovery Timer 0 Alarm Configuration 0</description>
					<addressOffset>0x60</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xa80108</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>GID0</name>
							<description>Group Index 0. - GID0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ALID0</name>
							<description>Alarm Identifier 0. - ALID0</description>
							<bitOffset>4</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GID1</name>
							<description>Group Index 1. - GID1</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ALID1</name>
							<description>Alarm Identifier 1. - ALID1</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RTAC01</name>
					<description>Recovery Timer 0 Alarm Configuration 1</description>
					<addressOffset>0x64</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xc800b8</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>GID2</name>
							<description>Group Index 2. - GID2</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ALID2</name>
							<description>Alarm Identifier 0. - ALID2</description>
							<bitOffset>4</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GID3</name>
							<description>Group Index 3. - GID3</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ALID3</name>
							<description>Alarm Identifier 1. - ALID3</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RTAC10</name>
					<description>Recovery Timer 1 Alarm Configuration 0</description>
					<addressOffset>0x68</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xe800d8</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>GID0</name>
							<description>Group Index 0. - GID0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ALID0</name>
							<description>Alarm Identifier 0. - ALID0</description>
							<bitOffset>4</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GID1</name>
							<description>Group Index 1. - GID1</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ALID1</name>
							<description>Alarm Identifier 1. - ALID1</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RTAC11</name>
					<description>Recovery Timer 1 Alarm Configuration 1</description>
					<addressOffset>0x6C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xf800f8</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>GID2</name>
							<description>Group Index 2. - GID2</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ALID2</name>
							<description>Alarm Identifier 2. - ALID2</description>
							<bitOffset>4</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GID3</name>
							<description>Group Index 3. - GID3</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ALID3</name>
							<description>Alarm Identifier 3. - ALID3</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AEX</name>
					<description>Alarm Executed Status Register</description>
					<addressOffset>0x70</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IRQ0STS</name>
							<description>IRQ0 Request Status - IRQ0STS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IRQ1STS</name>
							<description>IRQ1 Request Status - IRQ1STS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IRQ2STS</name>
							<description>IRQ2 Request Status - IRQ2STS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RST0STS</name>
							<description>RST0 Request Status - RST0STS</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RST1STS</name>
							<description>RST1 Request Status - RST1STS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RST2STS</name>
							<description>RST2 Request Status - RST2STS</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RST3STS</name>
							<description>RST3 Request Status - RST3STS</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RST4STS</name>
							<description>RST4 Request Status - RST4STS</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RST5STS</name>
							<description>RST5 Request Status - RST5STS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>NMISTS</name>
							<description>NMI Request Status - NMISTS</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMSSTS</name>
							<description>EMS Request Status - EMSSTS</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IRQ0AEM</name>
							<description>IRQ0 AEM - IRQ0AEM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IRQ1AEM</name>
							<description>IRQ1 AEM - IRQ1AEM</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>IRQ2AEM</name>
							<description>IRQ2 AEM - IRQ2AEM</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RST0AEM</name>
							<description>RST0 AEM - RST0AEM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RST1AEM</name>
							<description>RST1 AEM - RST1AEM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RST2AEM</name>
							<description>RST2 AEM - RST2AEM</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RST3AEM</name>
							<description>RST3 AEM - RST3AEM</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RST4AEM</name>
							<description>RST4 AEM - RST4AEM</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RST5AEM</name>
							<description>RST5 AEM - RST5AEM</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>NMIAEM</name>
							<description>NMI AEM - NMIAEM</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMSAEM</name>
							<description>EMS AEM - EMSAEM</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
