J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>AEXCLR</name>
					<description>Alarm Executed Status Clear Register</description>
					<addressOffset>0x74</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IRQ0CLR</name>
							<description>IRQ0 Request Status Clear - IRQ0CLR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IRQ1CLR</name>
							<description>IRQ1 Request Status Clear - IRQ1CLR</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IRQ2CLR</name>
							<description>IRQ2 Request Status Clear - IRQ2CLR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RST0CLR</name>
							<description>RST0 Request Status Clear - RST0CLR</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RST1CLR</name>
							<description>RST1 Request Status Clear - RST1CLR</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RST2CLR</name>
							<description>RST2 Request Status Clear - RST2CLR</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RST3CLR</name>
							<description>RST3 Request Status Clear - RST3CLR</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RST4CLR</name>
							<description>RST4 Request Status Clear - RST4CLR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RST5CLR</name>
							<description>RST5 Request Status Clear - RST5CLR</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>NMICLR</name>
							<description>NMI Request Status Clear - NMICLR</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EMSCLR</name>
							<description>EMS Request Status Clear - EMSCLR</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IRQ0AEMCLR</name>
							<description>IRQ0 AEM Status Clear - IRQ0AEMCLR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IRQ1AEMCLR</name>
							<description>IRQ1 AEM Status Clear - IRQ1AEMCLR</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>IRQ2AEMCLR</name>
							<description>IRQ2 AEM Status Clear - IRQ2AEMCLR</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RST0AEMCLR</name>
							<description>RST0 AEM Status Clear - RST0AEMCLR</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RST1AEMCLR</name>
							<description>RST1 AEM Status Clear - RST1AEMCLR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RST2AEMCLR</name>
							<description>RST2 AEM Status Clear - RST2AEMCLR</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RST3AEMCLR</name>
							<description>RST3 AEM Status Clear - RST3AEMCLR</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RST4AEMCLR</name>
							<description>RST4 AEM Status Clear - RST4AEMCLR</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RST5AEMCLR</name>
							<description>RST5 AEM Status Clear - RST5AEMCLR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>NMIAEMCLR</name>
							<description>NMI AEM Status Clear - NMIAEMCLR</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EMSAEMCLR</name>
							<description>EMS AEM Status Clear - EMSAEMCLR</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AG0CF0</name>
					<description>Alarm Configuration Register</description>
					<addressOffset>0x100</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CF0</name>
							<description>Configuration flag x (x=0-2) for alarm 0 belonging to alarm group i. - CF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF1</name>
							<description>Configuration flag x (x=0-2) for alarm 1 belonging to alarm group i. - CF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF2</name>
							<description>Configuration flag x (x=0-2) for alarm 2 belonging to alarm group i. - CF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF4</name>
							<description>Configuration flag x (x=0-2) for alarm 4 belonging to alarm group i. - CF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF5</name>
							<description>Configuration flag x (x=0-2) for alarm 5 belonging to alarm group i. - CF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF6</name>
							<description>Configuration flag x (x=0-2) for alarm 6 belonging to alarm group i. - CF6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF7</name>
							<description>Configuration flag x (x=0-2) for alarm 7 belonging to alarm group i. - CF7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF8</name>
							<description>Configuration flag x (x=0-2) for alarm 8 belonging to alarm group i. - CF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF9</name>
							<description>Configuration flag x (x=0-2) for alarm 9 belonging to alarm group i. - CF9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF10</name>
							<description>Configuration flag x (x=0-2) for alarm 10 belonging to alarm group i. - CF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF11</name>
							<description>Configuration flag x (x=0-2) for alarm 11 belonging to alarm group i. - CF11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF12</name>
							<description>Configuration flag x (x=0-2) for alarm 12 belonging to alarm group i. - CF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF13</name>
							<description>Configuration flag x (x=0-2) for alarm 13 belonging to alarm group i. - CF13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF14</name>
							<description>Configuration flag x (x=0-2) for alarm 14 belonging to alarm group i. - CF14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF22</name>
							<description>Configuration flag x (x=0-2) for alarm 22 belonging to alarm group i. - CF22</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF23</name>
							<description>Configuration flag x (x=0-2) for alarm 23 belonging to alarm group i. - CF23</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF24</name>
							<description>Configuration flag x (x=0-2) for alarm 24 belonging to alarm group i. - CF24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AG0CF1</name>
					<description>Alarm Configuration Register</description>
					<addressOffset>0x104</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CF0</name>
							<description>Configuration flag x (x=0-2) for alarm 0 belonging to alarm group i. - CF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF1</name>
							<description>Configuration flag x (x=0-2) for alarm 1 belonging to alarm group i. - CF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF2</name>
							<description>Configuration flag x (x=0-2) for alarm 2 belonging to alarm group i. - CF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF4</name>
							<description>Configuration flag x (x=0-2) for alarm 4 belonging to alarm group i. - CF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF5</name>
							<description>Configuration flag x (x=0-2) for alarm 5 belonging to alarm group i. - CF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF6</name>
							<description>Configuration flag x (x=0-2) for alarm 6 belonging to alarm group i. - CF6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF7</name>
							<description>Configuration flag x (x=0-2) for alarm 7 belonging to alarm group i. - CF7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF8</name>
							<description>Configuration flag x (x=0-2) for alarm 8 belonging to alarm group i. - CF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF9</name>
							<description>Configuration flag x (x=0-2) for alarm 9 belonging to alarm group i. - CF9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF10</name>
							<description>Configuration flag x (x=0-2) for alarm 10 belonging to alarm group i. - CF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF11</name>
							<description>Configuration flag x (x=0-2) for alarm 11 belonging to alarm group i. - CF11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF12</name>
							<description>Configuration flag x (x=0-2) for alarm 12 belonging to alarm group i. - CF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF13</name>
							<description>Configuration flag x (x=0-2) for alarm 13 belonging to alarm group i. - CF13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF14</name>
							<description>Configuration flag x (x=0-2) for alarm 14 belonging to alarm group i. - CF14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF22</name>
							<description>Configuration flag x (x=0-2) for alarm 22 belonging to alarm group i. - CF22</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF23</name>
							<description>Configuration flag x (x=0-2) for alarm 23 belonging to alarm group i. - CF23</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF24</name>
							<description>Configuration flag x (x=0-2) for alarm 24 belonging to alarm group i. - CF24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AG0CF2</name>
					<description>Alarm Configuration Register</description>
					<addressOffset>0x108</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CF0</name>
							<description>Configuration flag x (x=0-2) for alarm 0 belonging to alarm group i. - CF0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF1</name>
							<description>Configuration flag x (x=0-2) for alarm 1 belonging to alarm group i. - CF1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF2</name>
							<description>Configuration flag x (x=0-2) for alarm 2 belonging to alarm group i. - CF2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF4</name>
							<description>Configuration flag x (x=0-2) for alarm 4 belonging to alarm group i. - CF4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF5</name>
							<description>Configuration flag x (x=0-2) for alarm 5 belonging to alarm group i. - CF5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF6</name>
							<description>Configuration flag x (x=0-2) for alarm 6 belonging to alarm group i. - CF6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF7</name>
							<description>Configuration flag x (x=0-2) for alarm 7 belonging to alarm group i. - CF7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF8</name>
							<description>Configuration flag x (x=0-2) for alarm 8 belonging to alarm group i. - CF8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF9</name>
							<description>Configuration flag x (x=0-2) for alarm 9 belonging to alarm group i. - CF9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF10</name>
							<description>Configuration flag x (x=0-2) for alarm 10 belonging to alarm group i. - CF10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF11</name>
							<description>Configuration flag x (x=0-2) for alarm 11 belonging to alarm group i. - CF11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF12</name>
							<description>Configuration flag x (x=0-2) for alarm 12 belonging to alarm group i. - CF12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF13</name>
							<description>Configuration flag x (x=0-2) for alarm 13 belonging to alarm group i. - CF13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF14</name>
							<description>Configuration flag x (x=0-2) for alarm 14 belonging to alarm group i. - CF14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF22</name>
							<description>Configuration flag x (x=0-2) for alarm 22 belonging to alarm group i. - CF22</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF23</name>
							<description>Configuration flag x (x=0-2) for alarm 23 belonging to alarm group i. - CF23</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CF24</name>
							<description>Configuration flag x (x=0-2) for alarm 24 belonging to alarm group i. - CF24</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
