J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>FPCESR</name>
					<description>IOM Filter and Prescaler Channels Rising &amp; Falling Edge Status Register</description>
					<addressOffset>0x78</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FEG0</name>
							<description>Falling Edge Glitch Flag for FPC0 - FEG0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG1</name>
							<description>Falling Edge Glitch Flag for FPC1 - FEG1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG2</name>
							<description>Falling Edge Glitch Flag for FPC2 - FEG2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG3</name>
							<description>Falling Edge Glitch Flag for FPC3 - FEG3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG4</name>
							<description>Falling Edge Glitch Flag for FPC4 - FEG4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG5</name>
							<description>Falling Edge Glitch Flag for FPC5 - FEG5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG6</name>
							<description>Falling Edge Glitch Flag for FPC6 - FEG6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG7</name>
							<description>Falling Edge Glitch Flag for FPC7 - FEG7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG8</name>
							<description>Falling Edge Glitch Flag for FPC8 - FEG8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG9</name>
							<description>Falling Edge Glitch Flag for FPC9 - FEG9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG10</name>
							<description>Falling Edge Glitch Flag for FPC10 - FEG10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG11</name>
							<description>Falling Edge Glitch Flag for FPC11 - FEG11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG12</name>
							<description>Falling Edge Glitch Flag for FPC12 - FEG12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG13</name>
							<description>Falling Edge Glitch Flag for FPC13 - FEG13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG14</name>
							<description>Falling Edge Glitch Flag for FPC14 - FEG14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEG15</name>
							<description>Falling Edge Glitch Flag for FPC15 - FEG15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REG0</name>
							<description>Rising Edge Glitch Flag for FPC0 - REG0</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REG1</name>
							<description>Rising Edge Glitch Flag for FPC1 - REG1</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REG2</name>
							<description>Rising Edge Glitch Flag for FPC2 - REG2</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REG3</name>
							<description>Rising Edge Glitch Flag for FPC3 - REG3</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REG4</name>
							<description>Rising Edge Glitch Flag for FPC4 - REG4</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REG5</name>
							<description>Rising Edge Glitch Flag for FPC5 - REG5</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REG6</name>
							<description>Rising Edge Glitch Flag for FPC6 - REG6</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REG7</name>
							<description>Rising Edge Glitch Flag for FPC7 - REG7</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REG8</name>
							<description>Rising Edge Glitch Flag for FPC8 - REG8</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REG9</name>
							<description>Rising Edge Glitch Flag for FPC9 - REG9</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REG10</name>
							<description>Rising Edge Glitch Flag for FPC10 - REG10</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REG11</name>
							<description>Rising Edge Glitch Flag for FPC11 - REG11</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REG12</name>
							<description>Rising Edge Glitch Flag for FPC12 - REG12</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REG13</name>
							<description>Rising Edge Glitch Flag for FPC13 - REG13</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REG14</name>
							<description>Rising Edge Glitch Flag for FPC14 - REG14</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REG15</name>
							<description>Rising Edge Glitch Flag for FPC15 - REG15</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCCTR0</name>
					<description>IOM Filter and Prescaler Channel Control Register 0</description>
					<addressOffset>0x80</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMP</name>
							<description>Threshold Value of Filter &amp; Prescaler Channel k - CMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD</name>
							<description>Operation Mode Selection for Filter &amp; Prescaler Channel k - MOD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISM</name>
							<description>Monitor Input Signal Selection for Filter &amp; Prescaler Channel k - ISM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTG</name>
							<description>Reset Timer behavior for Filter &amp; Prescaler Channel k on Glitch - RTG</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISR</name>
							<description>Reference Input Signal Selection for Filter &amp; Prescaler Channel k - ISR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCCTR1</name>
					<description>IOM Filter and Prescaler Channel Control Register 1</description>
					<addressOffset>0x84</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMP</name>
							<description>Threshold Value of Filter &amp; Prescaler Channel k - CMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD</name>
							<description>Operation Mode Selection for Filter &amp; Prescaler Channel k - MOD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISM</name>
							<description>Monitor Input Signal Selection for Filter &amp; Prescaler Channel k - ISM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTG</name>
							<description>Reset Timer behavior for Filter &amp; Prescaler Channel k on Glitch - RTG</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISR</name>
							<description>Reference Input Signal Selection for Filter &amp; Prescaler Channel k - ISR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCCTR2</name>
					<description>IOM Filter and Prescaler Channel Control Register 2</description>
					<addressOffset>0x88</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMP</name>
							<description>Threshold Value of Filter &amp; Prescaler Channel k - CMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD</name>
							<description>Operation Mode Selection for Filter &amp; Prescaler Channel k - MOD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISM</name>
							<description>Monitor Input Signal Selection for Filter &amp; Prescaler Channel k - ISM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTG</name>
							<description>Reset Timer behavior for Filter &amp; Prescaler Channel k on Glitch - RTG</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISR</name>
							<description>Reference Input Signal Selection for Filter &amp; Prescaler Channel k - ISR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCCTR3</name>
					<description>IOM Filter and Prescaler Channel Control Register 3</description>
					<addressOffset>0x8C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMP</name>
							<description>Threshold Value of Filter &amp; Prescaler Channel k - CMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD</name>
							<description>Operation Mode Selection for Filter &amp; Prescaler Channel k - MOD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISM</name>
							<description>Monitor Input Signal Selection for Filter &amp; Prescaler Channel k - ISM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTG</name>
							<description>Reset Timer behavior for Filter &amp; Prescaler Channel k on Glitch - RTG</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISR</name>
							<description>Reference Input Signal Selection for Filter &amp; Prescaler Channel k - ISR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCCTR4</name>
					<description>IOM Filter and Prescaler Channel Control Register 4</description>
					<addressOffset>0x90</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMP</name>
							<description>Threshold Value of Filter &amp; Prescaler Channel k - CMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD</name>
							<description>Operation Mode Selection for Filter &amp; Prescaler Channel k - MOD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISM</name>
							<description>Monitor Input Signal Selection for Filter &amp; Prescaler Channel k - ISM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTG</name>
							<description>Reset Timer behavior for Filter &amp; Prescaler Channel k on Glitch - RTG</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISR</name>
							<description>Reference Input Signal Selection for Filter &amp; Prescaler Channel k - ISR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCCTR5</name>
					<description>IOM Filter and Prescaler Channel Control Register 5</description>
					<addressOffset>0x94</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMP</name>
							<description>Threshold Value of Filter &amp; Prescaler Channel k - CMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD</name>
							<description>Operation Mode Selection for Filter &amp; Prescaler Channel k - MOD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISM</name>
							<description>Monitor Input Signal Selection for Filter &amp; Prescaler Channel k - ISM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTG</name>
							<description>Reset Timer behavior for Filter &amp; Prescaler Channel k on Glitch - RTG</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISR</name>
							<description>Reference Input Signal Selection for Filter &amp; Prescaler Channel k - ISR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCCTR6</name>
					<description>IOM Filter and Prescaler Channel Control Register 6</description>
					<addressOffset>0x98</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMP</name>
							<description>Threshold Value of Filter &amp; Prescaler Channel k - CMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD</name>
							<description>Operation Mode Selection for Filter &amp; Prescaler Channel k - MOD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISM</name>
							<description>Monitor Input Signal Selection for Filter &amp; Prescaler Channel k - ISM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTG</name>
							<description>Reset Timer behavior for Filter &amp; Prescaler Channel k on Glitch - RTG</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISR</name>
							<description>Reference Input Signal Selection for Filter &amp; Prescaler Channel k - ISR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCCTR7</name>
					<description>IOM Filter and Prescaler Channel Control Register 7</description>
					<addressOffset>0x9C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMP</name>
							<description>Threshold Value of Filter &amp; Prescaler Channel k - CMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD</name>
							<description>Operation Mode Selection for Filter &amp; Prescaler Channel k - MOD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISM</name>
							<description>Monitor Input Signal Selection for Filter &amp; Prescaler Channel k - ISM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTG</name>
							<description>Reset Timer behavior for Filter &amp; Prescaler Channel k on Glitch - RTG</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISR</name>
							<description>Reference Input Signal Selection for Filter &amp; Prescaler Channel k - ISR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCCTR8</name>
					<description>IOM Filter and Prescaler Channel Control Register 8</description>
					<addressOffset>0xA0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMP</name>
							<description>Threshold Value of Filter &amp; Prescaler Channel k - CMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD</name>
							<description>Operation Mode Selection for Filter &amp; Prescaler Channel k - MOD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISM</name>
							<description>Monitor Input Signal Selection for Filter &amp; Prescaler Channel k - ISM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTG</name>
							<description>Reset Timer behavior for Filter &amp; Prescaler Channel k on Glitch - RTG</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISR</name>
							<description>Reference Input Signal Selection for Filter &amp; Prescaler Channel k - ISR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FPCCTR9</name>
					<description>IOM Filter and Prescaler Channel Control Register 9</description>
					<addressOffset>0xA4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CMP</name>
							<description>Threshold Value of Filter &amp; Prescaler Channel k - CMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOD</name>
							<description>Operation Mode Selection for Filter &amp; Prescaler Channel k - MOD</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISM</name>
							<description>Monitor Input Signal Selection for Filter &amp; Prescaler Channel k - ISM</description>
							<bitOffset>19</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RTG</name>
							<description>Reset Timer behavior for Filter &amp; Prescaler Channel k on Glitch - RTG</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ISR</name>
							<description>Reference Input Signal Selection for Filter &amp; Prescaler Channel k - ISR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
