J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>LAMEWC6</name>
					<description>IOM Logic Analyzer Module Event Window Count Status Register 6</description>
					<addressOffset>0x118</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Event Window Count Value LAM block m - CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTO</name>
							<description>Count Overflow Flag LAM block m - CNTO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWC7</name>
					<description>IOM Logic Analyzer Module Event Window Count Status Register 7</description>
					<addressOffset>0x11C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Event Window Count Value LAM block m - CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTO</name>
							<description>Count Overflow Flag LAM block m - CNTO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWC8</name>
					<description>IOM Logic Analyzer Module Event Window Count Status Register 8</description>
					<addressOffset>0x120</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Event Window Count Value LAM block m - CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTO</name>
							<description>Count Overflow Flag LAM block m - CNTO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWC9</name>
					<description>IOM Logic Analyzer Module Event Window Count Status Register 9</description>
					<addressOffset>0x124</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Event Window Count Value LAM block m - CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTO</name>
							<description>Count Overflow Flag LAM block m - CNTO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWC10</name>
					<description>IOM Logic Analyzer Module Event Window Count Status Register 10</description>
					<addressOffset>0x128</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Event Window Count Value LAM block m - CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTO</name>
							<description>Count Overflow Flag LAM block m - CNTO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWC11</name>
					<description>IOM Logic Analyzer Module Event Window Count Status Register 11</description>
					<addressOffset>0x12C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Event Window Count Value LAM block m - CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTO</name>
							<description>Count Overflow Flag LAM block m - CNTO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWC12</name>
					<description>IOM Logic Analyzer Module Event Window Count Status Register 12</description>
					<addressOffset>0x130</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Event Window Count Value LAM block m - CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTO</name>
							<description>Count Overflow Flag LAM block m - CNTO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWC13</name>
					<description>IOM Logic Analyzer Module Event Window Count Status Register 13</description>
					<addressOffset>0x134</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Event Window Count Value LAM block m - CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTO</name>
							<description>Count Overflow Flag LAM block m - CNTO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWC14</name>
					<description>IOM Logic Analyzer Module Event Window Count Status Register 14</description>
					<addressOffset>0x138</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Event Window Count Value LAM block m - CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTO</name>
							<description>Count Overflow Flag LAM block m - CNTO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMEWC15</name>
					<description>IOM Logic Analyzer Module Event Window Count Status Register 15</description>
					<addressOffset>0x13C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CNT</name>
							<description>Event Window Count Value LAM block m - CNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>24</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTO</name>
							<description>Count Overflow Flag LAM block m - CNTO</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMCFG0</name>
					<description>IOM Logic Analyzer Module Configuration Register 0</description>
					<addressOffset>0x180</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IVR</name>
							<description>Invert Reference LAM block m - IVR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IVM</name>
							<description>Invert Monitor LAM block m - IVM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOS</name>
							<description>Monitor Source Select LAM block m - MOS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RMS</name>
							<description>Runmode Select LAM block m - RMS</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EWS</name>
							<description>Event Window Select LAM block m - EWS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DISEV</name>
							<description>Disable Events LAM block m - DISEV</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EDS</name>
							<description>Event Window Active Edge Selection LAM block m - EDS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IVW</name>
							<description>Invert Event Window LAM block m - IVW</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCS</name>
							<description>Monitor Input Signal Selection LAM block m - MCS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RCS</name>
							<description>Reference Input Signal Selection LAM block m - RCS</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMCFG1</name>
					<description>IOM Logic Analyzer Module Configuration Register 1</description>
					<addressOffset>0x184</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IVR</name>
							<description>Invert Reference LAM block m - IVR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IVM</name>
							<description>Invert Monitor LAM block m - IVM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOS</name>
							<description>Monitor Source Select LAM block m - MOS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RMS</name>
							<description>Runmode Select LAM block m - RMS</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EWS</name>
							<description>Event Window Select LAM block m - EWS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DISEV</name>
							<description>Disable Events LAM block m - DISEV</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EDS</name>
							<description>Event Window Active Edge Selection LAM block m - EDS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IVW</name>
							<description>Invert Event Window LAM block m - IVW</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCS</name>
							<description>Monitor Input Signal Selection LAM block m - MCS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RCS</name>
							<description>Reference Input Signal Selection LAM block m - RCS</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMCFG2</name>
					<description>IOM Logic Analyzer Module Configuration Register 2</description>
					<addressOffset>0x188</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IVR</name>
							<description>Invert Reference LAM block m - IVR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IVM</name>
							<description>Invert Monitor LAM block m - IVM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOS</name>
							<description>Monitor Source Select LAM block m - MOS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RMS</name>
							<description>Runmode Select LAM block m - RMS</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EWS</name>
							<description>Event Window Select LAM block m - EWS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DISEV</name>
							<description>Disable Events LAM block m - DISEV</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EDS</name>
							<description>Event Window Active Edge Selection LAM block m - EDS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IVW</name>
							<description>Invert Event Window LAM block m - IVW</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCS</name>
							<description>Monitor Input Signal Selection LAM block m - MCS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RCS</name>
							<description>Reference Input Signal Selection LAM block m - RCS</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMCFG3</name>
					<description>IOM Logic Analyzer Module Configuration Register 3</description>
					<addressOffset>0x18C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IVR</name>
							<description>Invert Reference LAM block m - IVR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IVM</name>
							<description>Invert Monitor LAM block m - IVM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOS</name>
							<description>Monitor Source Select LAM block m - MOS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RMS</name>
							<description>Runmode Select LAM block m - RMS</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EWS</name>
							<description>Event Window Select LAM block m - EWS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DISEV</name>
							<description>Disable Events LAM block m - DISEV</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EDS</name>
							<description>Event Window Active Edge Selection LAM block m - EDS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IVW</name>
							<description>Invert Event Window LAM block m - IVW</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCS</name>
							<description>Monitor Input Signal Selection LAM block m - MCS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RCS</name>
							<description>Reference Input Signal Selection LAM block m - RCS</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMCFG4</name>
					<description>IOM Logic Analyzer Module Configuration Register 4</description>
					<addressOffset>0x190</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IVR</name>
							<description>Invert Reference LAM block m - IVR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IVM</name>
							<description>Invert Monitor LAM block m - IVM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOS</name>
							<description>Monitor Source Select LAM block m - MOS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RMS</name>
							<description>Runmode Select LAM block m - RMS</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EWS</name>
							<description>Event Window Select LAM block m - EWS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DISEV</name>
							<description>Disable Events LAM block m - DISEV</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EDS</name>
							<description>Event Window Active Edge Selection LAM block m - EDS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IVW</name>
							<description>Invert Event Window LAM block m - IVW</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCS</name>
							<description>Monitor Input Signal Selection LAM block m - MCS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RCS</name>
							<description>Reference Input Signal Selection LAM block m - RCS</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LAMCFG5</name>
					<description>IOM Logic Analyzer Module Configuration Register 5</description>
					<addressOffset>0x194</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IVR</name>
							<description>Invert Reference LAM block m - IVR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IVM</name>
							<description>Invert Monitor LAM block m - IVM</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MOS</name>
							<description>Monitor Source Select LAM block m - MOS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RMS</name>
							<description>Runmode Select LAM block m - RMS</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EWS</name>
							<description>Event Window Select LAM block m - EWS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DISEV</name>
							<description>Disable Events LAM block m - DISEV</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EDS</name>
							<description>Event Window Active Edge Selection LAM block m - EDS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IVW</name>
							<description>Invert Event Window LAM block m - IVW</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MCS</name>
							<description>Monitor Input Signal Selection LAM block m - MCS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RCS</name>
							<description>Reference Input Signal Selection LAM block m - RCS</description>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
