J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>G0BOUND</name>
					<description>Boundary Select Register, Group 0</description>
					<addressOffset>0x4B8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BOUNDARY0</name>
							<description>Boundary Value 0 for Limit Checking - BOUNDARY0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BOUNDARY1</name>
							<description>Boundary Value 1 for Limit Checking - BOUNDARY1</description>
							<bitOffset>16</bitOffset>
							<bitWidth>12</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0SYNCTR</name>
					<description>Synchronization Control Register, Group 0</description>
					<addressOffset>0x4C0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>STSEL</name>
							<description>Start Selection - STSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVALR1</name>
							<description>Evaluate Ready Input Ri</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVALR2</name>
							<description>Evaluate Ready Input Ri</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EVALR3</name>
							<description>Evaluate Ready Input Ri</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0QCTRL0</name>
					<description>Queue 0 Source Contr. Register, Group 0</description>
					<addressOffset>0x500</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRCRESREG</name>
							<description>Source-specific Result Register - SRCRESREG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRSEL</name>
							<description>Trigger Source Selection - TRSEL</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XTSEL</name>
							<description>External Trigger Input Selection - XTSEL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XTLVL</name>
							<description>External Trigger Level - XTLVL</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>XTMODE</name>
							<description>Trigger Operating Mode - XTMODE</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XTWC</name>
							<description>Write Control for Trigger Configuration - XTWC</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>GTSEL</name>
							<description>Gate Input Selection - GTSEL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GTLVL</name>
							<description>Gate Input Level - GTLVL</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GTWC</name>
							<description>Write Control for Gate Configuration - GTWC</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TMEN</name>
							<description>Timer Mode Enable - TMEN</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TMWC</name>
							<description>Write Control for Timer Mode - TMWC</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0QMR0</name>
					<description>Queue 0 Mode Register, Group 0</description>
					<addressOffset>0x504</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ENGT</name>
							<description>Enable Gate - ENGT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENTR</name>
							<description>Enable External Trigger - ENTR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLRV</name>
							<description>Clear Valid Bit - CLRV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TREV</name>
							<description>Trigger Event - TREV</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FLUSH</name>
							<description>Flush Queue - FLUSH</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEV</name>
							<description>Clear Event Flag - CEV</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RPTDIS</name>
							<description>Repeat Disable - RPTDIS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0QSR0</name>
					<description>Queue 0 Status Register, Group 0</description>
					<addressOffset>0x508</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x20</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FILL</name>
							<description>Filling Level for Queue - FILL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMPTY</name>
							<description>Queue Empty - EMPTY</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>REQGT</name>
							<description>Request Gate Level - REQGT</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EV</name>
							<description>Event Detected - EV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0Q0R0</name>
					<description>Queue 0 Register 0, Group 0</description>
					<addressOffset>0x50C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REQCHNR</name>
							<description>Request Channel Number - REQCHNR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RF</name>
							<description>Refill - RF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ENSI</name>
							<description>Enable Source Interrupt - ENSI</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EXTR</name>
							<description>External Trigger - EXTR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>V</name>
							<description>Request Channel Number Valid - V</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PDD</name>
							<description>Pull-Down Diagnostics Enable - PDD</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MDPD</name>
							<description>Multiplexer Diagnostics Pull-Devices Enable - MDPD,MDPU</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MDPU</name>
							<description>Multiplexer Diagnostics Pull-Devices Enable - MDPD,MDPU</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CDEN</name>
							<description>Converter Diagnostics Enable - CDEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CDSEL</name>
							<description>Converter Diagnostics Pull-Devices Select - CDSEL</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0QINR0</name>
					<description>Queue 0 Input Register, Group 0</description>
					<addressOffset>0x510</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REQCHNR</name>
							<description>Request Channel Number - REQCHNR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RF</name>
							<description>Refill - RF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ENSI</name>
							<description>Enable Source Interrupt - ENSI</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EXTR</name>
							<description>External Trigger - EXTR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PDD</name>
							<description>Pull-Down Diagnostics Enable - PDD</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MDPD</name>
							<description>Multiplexer Diagnostics Pull-Devices Enable - MDPD,MDPU</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MDPU</name>
							<description>Multiplexer Diagnostics Pull-Devices Enable - MDPD,MDPU</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CDEN</name>
							<description>Converter Diagnostics Enable - CDEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CDSEL</name>
							<description>Converter Diagnostics Pull-Devices Select - CDSEL</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0QBUR0</name>
					<description>Queue 0 Backup Register, Group 0</description>
					<addressOffset>0x514</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REQCHNR</name>
							<description>Request Channel Number - REQCHNR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RF</name>
							<description>Refill - RF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ENSI</name>
							<description>Enable Source Interrupt - ENSI</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EXTR</name>
							<description>External Trigger - EXTR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>V</name>
							<description>Request Channel Number Valid - V</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PDD</name>
							<description>Pull-Down Diagnostics Enable - PDD</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MDPD</name>
							<description>Multiplexer Diagnostics Pull-Down Devices Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MDPU</name>
							<description>Multiplexer Diagnostics Pull-Up Devices Enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CDEN</name>
							<description>Converter Diagnostics Enable - CDEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CDSEL</name>
							<description>Converter Diagnostics Pull-Devices Select - CDSEL</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0REQTM0</name>
					<description>Queue 0 Requ. Timer Mode Reg., Group 0</description>
					<addressOffset>0x518</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xffc00000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SEQMOD</name>
							<description>Sequence Mode - SEQMOD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SEQTIMSET</name>
							<description>Sequence Timer, Set Value - SEQTIMSET</description>
							<bitOffset>6</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REQTS</name>
							<description>Request Timer Start Trigger - REQTS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ENTR</name>
							<description>Enable External Trigger - ENTR</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SEQTIMOFF</name>
							<description>Sequence Timer, Switch Off Value - SEQTIMOFF</description>
							<bitOffset>22</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0REQTS0</name>
					<description>Queue 0 Requ. Timer Status Reg., Group 0</description>
					<addressOffset>0x51C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SEQTIMER</name>
							<description>Sequence Timer - SEQTIMER</description>
							<bitOffset>6</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0QCTRL1</name>
					<description>Queue 1 Source Contr. Register, Group 0</description>
					<addressOffset>0x520</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRCRESREG</name>
							<description>Source-specific Result Register - SRCRESREG</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TRSEL</name>
							<description>Trigger Source Selection - TRSEL</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XTSEL</name>
							<description>External Trigger Input Selection - XTSEL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XTLVL</name>
							<description>External Trigger Level - XTLVL</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>XTMODE</name>
							<description>Trigger Operating Mode - XTMODE</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>XTWC</name>
							<description>Write Control for Trigger Configuration - XTWC</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>GTSEL</name>
							<description>Gate Input Selection - GTSEL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GTLVL</name>
							<description>Gate Input Level - GTLVL</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>GTWC</name>
							<description>Write Control for Gate Configuration - GTWC</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TMEN</name>
							<description>Timer Mode Enable - TMEN</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TMWC</name>
							<description>Write Control for Timer Mode - TMWC</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0QMR1</name>
					<description>Queue 1 Mode Register, Group 0</description>
					<addressOffset>0x524</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ENGT</name>
							<description>Enable Gate - ENGT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ENTR</name>
							<description>Enable External Trigger - ENTR</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CLRV</name>
							<description>Clear Valid Bit - CLRV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TREV</name>
							<description>Trigger Event - TREV</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FLUSH</name>
							<description>Flush Queue - FLUSH</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEV</name>
							<description>Clear Event Flag - CEV</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RPTDIS</name>
							<description>Repeat Disable - RPTDIS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G0QSR1</name>
					<description>Queue 1 Status Register, Group 0</description>
					<addressOffset>0x528</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x20</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FILL</name>
							<description>Filling Level for Queue - FILL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMPTY</name>
							<description>Queue Empty - EMPTY</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>REQGT</name>
							<description>Request Gate Level - REQGT</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EV</name>
							<description>Event Detected - EV</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
