J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>G1Q0R2</name>
					<description>Queue 2 Register 0, Group 1</description>
					<addressOffset>0x94C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REQCHNR</name>
							<description>Request Channel Number - REQCHNR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RF</name>
							<description>Refill - RF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ENSI</name>
							<description>Enable Source Interrupt - ENSI</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EXTR</name>
							<description>External Trigger - EXTR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>V</name>
							<description>Request Channel Number Valid - V</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PDD</name>
							<description>Pull-Down Diagnostics Enable - PDD</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MDPD</name>
							<description>Multiplexer Diagnostics Pull-Devices Enable - MDPD,MDPU</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MDPU</name>
							<description>Multiplexer Diagnostics Pull-Devices Enable - MDPD,MDPU</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CDEN</name>
							<description>Converter Diagnostics Enable - CDEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CDSEL</name>
							<description>Converter Diagnostics Pull-Devices Select - CDSEL</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G1QINR2</name>
					<description>Queue 2 Input Register, Group 1</description>
					<addressOffset>0x950</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REQCHNR</name>
							<description>Request Channel Number - REQCHNR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>RF</name>
							<description>Refill - RF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ENSI</name>
							<description>Enable Source Interrupt - ENSI</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>EXTR</name>
							<description>External Trigger - EXTR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>PDD</name>
							<description>Pull-Down Diagnostics Enable - PDD</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MDPD</name>
							<description>Multiplexer Diagnostics Pull-Devices Enable - MDPD,MDPU</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>MDPU</name>
							<description>Multiplexer Diagnostics Pull-Devices Enable - MDPD,MDPU</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CDEN</name>
							<description>Converter Diagnostics Enable - CDEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CDSEL</name>
							<description>Converter Diagnostics Pull-Devices Select - CDSEL</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G1QBUR2</name>
					<description>Queue 2 Backup Register, Group 1</description>
					<addressOffset>0x954</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REQCHNR</name>
							<description>Request Channel Number - REQCHNR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RF</name>
							<description>Refill - RF</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>ENSI</name>
							<description>Enable Source Interrupt - ENSI</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EXTR</name>
							<description>External Trigger - EXTR</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>V</name>
							<description>Request Channel Number Valid - V</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>PDD</name>
							<description>Pull-Down Diagnostics Enable - PDD</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MDPD</name>
							<description>Multiplexer Diagnostics Pull-Down Devices Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>MDPU</name>
							<description>Multiplexer Diagnostics Pull-Up Devices Enable</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CDEN</name>
							<description>Converter Diagnostics Enable - CDEN</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CDSEL</name>
							<description>Converter Diagnostics Pull-Devices Select - CDSEL</description>
							<bitOffset>13</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G1REQTM2</name>
					<description>Queue 2 Requ. Timer Mode Reg., Group 1</description>
					<addressOffset>0x958</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0xffc00000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SEQMOD</name>
							<description>Sequence Mode - SEQMOD</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SEQTIMSET</name>
							<description>Sequence Timer, Set Value - SEQTIMSET</description>
							<bitOffset>6</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REQTS</name>
							<description>Request Timer Start Trigger - REQTS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>ENTR</name>
							<description>Enable External Trigger - ENTR</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SEQTIMOFF</name>
							<description>Sequence Timer, Switch Off Value - SEQTIMOFF</description>
							<bitOffset>22</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G1REQTS2</name>
					<description>Queue 2 Requ. Timer Status Reg., Group 1</description>
					<addressOffset>0x95C</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SEQTIMER</name>
							<description>Sequence Timer - SEQTIMER</description>
							<bitOffset>6</bitOffset>
							<bitWidth>10</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G1CEFLAG</name>
					<description>Channel Event Flag Register, Group 1</description>
					<addressOffset>0x980</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CEV0</name>
							<description>Channel Event for Channel 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV1</name>
							<description>Channel Event for Channel 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV2</name>
							<description>Channel Event for Channel 2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV3</name>
							<description>Channel Event for Channel 3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV4</name>
							<description>Channel Event for Channel 4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV5</name>
							<description>Channel Event for Channel 5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV6</name>
							<description>Channel Event for Channel 6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV7</name>
							<description>Channel Event for Channel 7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV8</name>
							<description>Channel Event for Channel 8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV9</name>
							<description>Channel Event for Channel 9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV10</name>
							<description>Channel Event for Channel 10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV11</name>
							<description>Channel Event for Channel 11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV12</name>
							<description>Channel Event for Channel 12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV13</name>
							<description>Channel Event for Channel 13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV14</name>
							<description>Channel Event for Channel 14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CEV15</name>
							<description>Channel Event for Channel 15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G1REFLAG</name>
					<description>Result Event Flag Register, Group 1</description>
					<addressOffset>0x984</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>REV0</name>
							<description>Result Event for Result Register 0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV1</name>
							<description>Result Event for Result Register 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV2</name>
							<description>Result Event for Result Register 2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV3</name>
							<description>Result Event for Result Register 3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV4</name>
							<description>Result Event for Result Register 4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV5</name>
							<description>Result Event for Result Register 5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV6</name>
							<description>Result Event for Result Register 6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV7</name>
							<description>Result Event for Result Register 7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV8</name>
							<description>Result Event for Result Register 8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV9</name>
							<description>Result Event for Result Register 9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV10</name>
							<description>Result Event for Result Register 10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV11</name>
							<description>Result Event for Result Register 11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV12</name>
							<description>Result Event for Result Register 12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV13</name>
							<description>Result Event for Result Register 13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV14</name>
							<description>Result Event for Result Register 14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REV15</name>
							<description>Result Event for Result Register 15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G1SEFLAG</name>
					<description>Source Event Flag Register, Group 1</description>
					<addressOffset>0x988</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SEV0</name>
							<description>Source Event i</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SEV1</name>
							<description>Source Event i</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SEV2</name>
							<description>Source Event i</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G1CEFCLR</name>
					<description>Channel Event Flag Clear Register, Group 1</description>
					<addressOffset>0x990</addressOffset>
					<size>32</size>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CEV0</name>
							<description>Clear Channel Event for Channel 0 - CEV0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEV1</name>
							<description>Clear Channel Event for Channel 1 - CEV1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEV2</name>
							<description>Clear Channel Event for Channel 2 - CEV2</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEV3</name>
							<description>Clear Channel Event for Channel 3 - CEV3</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEV4</name>
							<description>Clear Channel Event for Channel 4 - CEV4</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEV5</name>
							<description>Clear Channel Event for Channel 5 - CEV5</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEV6</name>
							<description>Clear Channel Event for Channel 6 - CEV6</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEV7</name>
							<description>Clear Channel Event for Channel 7 - CEV7</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEV8</name>
							<description>Clear Channel Event for Channel 8 - CEV8</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEV9</name>
							<description>Clear Channel Event for Channel 9 - CEV9</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEV10</name>
							<description>Clear Channel Event for Channel 10 - CEV10</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEV11</name>
							<description>Clear Channel Event for Channel 11 - CEV11</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEV12</name>
							<description>Clear Channel Event for Channel 12 - CEV12</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEV13</name>
							<description>Clear Channel Event for Channel 13 - CEV13</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEV14</name>
							<description>Clear Channel Event for Channel 14 - CEV14</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>CEV15</name>
							<description>Clear Channel Event for Channel 15 - CEV15</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
