J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>G9CHCTR8</name>
					<description>Group 9, Channel 8 Control Register</description>
					<addressOffset>0x2A20</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ICLSEL</name>
							<description>Input Class Select - ICLSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELL</name>
							<description>Lower Boundary Select - BNDSELL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELU</name>
							<description>Upper Boundary Select - BNDSELU</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHEVMODE</name>
							<description>Channel Event Mode - CHEVMODE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNC</name>
							<description>Synchronization Request - SYNC</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REFSEL</name>
							<description>Reference Input Selection - REFSEL</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELX</name>
							<description>BoundaryExtension - BNDSELX</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESREG</name>
							<description>Result Register - RESREG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESTGT</name>
							<description>Result Target - RESTGT</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESPOS</name>
							<description>Result Position - RESPOS</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDCH</name>
							<description>Broken Wire Detection Channel - BWDCH</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDEN</name>
							<description>Broken Wire Detection Enable - BWDEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G9CHCTR9</name>
					<description>Group 9, Channel 9 Control Register</description>
					<addressOffset>0x2A24</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ICLSEL</name>
							<description>Input Class Select - ICLSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELL</name>
							<description>Lower Boundary Select - BNDSELL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELU</name>
							<description>Upper Boundary Select - BNDSELU</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHEVMODE</name>
							<description>Channel Event Mode - CHEVMODE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNC</name>
							<description>Synchronization Request - SYNC</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REFSEL</name>
							<description>Reference Input Selection - REFSEL</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELX</name>
							<description>BoundaryExtension - BNDSELX</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESREG</name>
							<description>Result Register - RESREG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESTGT</name>
							<description>Result Target - RESTGT</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESPOS</name>
							<description>Result Position - RESPOS</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDCH</name>
							<description>Broken Wire Detection Channel - BWDCH</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDEN</name>
							<description>Broken Wire Detection Enable - BWDEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G9CHCTR10</name>
					<description>Group 9, Channel 10 Control Register</description>
					<addressOffset>0x2A28</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ICLSEL</name>
							<description>Input Class Select - ICLSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELL</name>
							<description>Lower Boundary Select - BNDSELL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELU</name>
							<description>Upper Boundary Select - BNDSELU</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHEVMODE</name>
							<description>Channel Event Mode - CHEVMODE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNC</name>
							<description>Synchronization Request - SYNC</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REFSEL</name>
							<description>Reference Input Selection - REFSEL</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELX</name>
							<description>BoundaryExtension - BNDSELX</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESREG</name>
							<description>Result Register - RESREG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESTGT</name>
							<description>Result Target - RESTGT</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESPOS</name>
							<description>Result Position - RESPOS</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDCH</name>
							<description>Broken Wire Detection Channel - BWDCH</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDEN</name>
							<description>Broken Wire Detection Enable - BWDEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G9CHCTR11</name>
					<description>Group 9, Channel 11 Control Register</description>
					<addressOffset>0x2A2C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ICLSEL</name>
							<description>Input Class Select - ICLSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELL</name>
							<description>Lower Boundary Select - BNDSELL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELU</name>
							<description>Upper Boundary Select - BNDSELU</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHEVMODE</name>
							<description>Channel Event Mode - CHEVMODE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNC</name>
							<description>Synchronization Request - SYNC</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REFSEL</name>
							<description>Reference Input Selection - REFSEL</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELX</name>
							<description>BoundaryExtension - BNDSELX</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESREG</name>
							<description>Result Register - RESREG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESTGT</name>
							<description>Result Target - RESTGT</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESPOS</name>
							<description>Result Position - RESPOS</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDCH</name>
							<description>Broken Wire Detection Channel - BWDCH</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDEN</name>
							<description>Broken Wire Detection Enable - BWDEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G9CHCTR12</name>
					<description>Group 9, Channel 12 Control Register</description>
					<addressOffset>0x2A30</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ICLSEL</name>
							<description>Input Class Select - ICLSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELL</name>
							<description>Lower Boundary Select - BNDSELL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELU</name>
							<description>Upper Boundary Select - BNDSELU</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHEVMODE</name>
							<description>Channel Event Mode - CHEVMODE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNC</name>
							<description>Synchronization Request - SYNC</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REFSEL</name>
							<description>Reference Input Selection - REFSEL</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELX</name>
							<description>BoundaryExtension - BNDSELX</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESREG</name>
							<description>Result Register - RESREG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESTGT</name>
							<description>Result Target - RESTGT</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESPOS</name>
							<description>Result Position - RESPOS</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDCH</name>
							<description>Broken Wire Detection Channel - BWDCH</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDEN</name>
							<description>Broken Wire Detection Enable - BWDEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G9CHCTR13</name>
					<description>Group 9, Channel 13 Control Register</description>
					<addressOffset>0x2A34</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ICLSEL</name>
							<description>Input Class Select - ICLSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELL</name>
							<description>Lower Boundary Select - BNDSELL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELU</name>
							<description>Upper Boundary Select - BNDSELU</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHEVMODE</name>
							<description>Channel Event Mode - CHEVMODE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNC</name>
							<description>Synchronization Request - SYNC</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REFSEL</name>
							<description>Reference Input Selection - REFSEL</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELX</name>
							<description>BoundaryExtension - BNDSELX</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESREG</name>
							<description>Result Register - RESREG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESTGT</name>
							<description>Result Target - RESTGT</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESPOS</name>
							<description>Result Position - RESPOS</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDCH</name>
							<description>Broken Wire Detection Channel - BWDCH</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDEN</name>
							<description>Broken Wire Detection Enable - BWDEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G9CHCTR14</name>
					<description>Group 9, Channel 14 Control Register</description>
					<addressOffset>0x2A38</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ICLSEL</name>
							<description>Input Class Select - ICLSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELL</name>
							<description>Lower Boundary Select - BNDSELL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELU</name>
							<description>Upper Boundary Select - BNDSELU</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHEVMODE</name>
							<description>Channel Event Mode - CHEVMODE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNC</name>
							<description>Synchronization Request - SYNC</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REFSEL</name>
							<description>Reference Input Selection - REFSEL</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELX</name>
							<description>BoundaryExtension - BNDSELX</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESREG</name>
							<description>Result Register - RESREG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESTGT</name>
							<description>Result Target - RESTGT</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESPOS</name>
							<description>Result Position - RESPOS</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDCH</name>
							<description>Broken Wire Detection Channel - BWDCH</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDEN</name>
							<description>Broken Wire Detection Enable - BWDEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G9CHCTR15</name>
					<description>Group 9, Channel 15 Control Register</description>
					<addressOffset>0x2A3C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ICLSEL</name>
							<description>Input Class Select - ICLSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELL</name>
							<description>Lower Boundary Select - BNDSELL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELU</name>
							<description>Upper Boundary Select - BNDSELU</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CHEVMODE</name>
							<description>Channel Event Mode - CHEVMODE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SYNC</name>
							<description>Synchronization Request - SYNC</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REFSEL</name>
							<description>Reference Input Selection - REFSEL</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BNDSELX</name>
							<description>BoundaryExtension - BNDSELX</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESREG</name>
							<description>Result Register - RESREG</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESTGT</name>
							<description>Result Target - RESTGT</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RESPOS</name>
							<description>Result Position - RESPOS</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDCH</name>
							<description>Broken Wire Detection Channel - BWDCH</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BWDEN</name>
							<description>Broken Wire Detection Enable - BWDEN</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
