J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>G11RCR2</name>
					<description>Group 11 Result Control Register 2</description>
					<addressOffset>0x3288</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G11RCR3</name>
					<description>Group 11 Result Control Register 3</description>
					<addressOffset>0x328C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G11RCR4</name>
					<description>Group 11 Result Control Register 4</description>
					<addressOffset>0x3290</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G11RCR5</name>
					<description>Group 11 Result Control Register 5</description>
					<addressOffset>0x3294</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G11RCR6</name>
					<description>Group 11 Result Control Register 6</description>
					<addressOffset>0x3298</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G11RCR7</name>
					<description>Group 11 Result Control Register 7</description>
					<addressOffset>0x329C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G11RCR8</name>
					<description>Group 11 Result Control Register 8</description>
					<addressOffset>0x32A0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G11RCR9</name>
					<description>Group 11 Result Control Register 9</description>
					<addressOffset>0x32A4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G11RCR10</name>
					<description>Group 11 Result Control Register 10</description>
					<addressOffset>0x32A8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G11RCR11</name>
					<description>Group 11 Result Control Register 11</description>
					<addressOffset>0x32AC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G11RCR12</name>
					<description>Group 11 Result Control Register 12</description>
					<addressOffset>0x32B0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G11RCR13</name>
					<description>Group 11 Result Control Register 13</description>
					<addressOffset>0x32B4</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G11RCR14</name>
					<description>Group 11 Result Control Register 14</description>
					<addressOffset>0x32B8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G11RCR15</name>
					<description>Group 11 Result Control Register 15</description>
					<addressOffset>0x32BC</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DRCTR</name>
							<description>Data Reduction Control - DRCTR</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DMM</name>
							<description>Data Modification Mode - DMM</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>WFR</name>
							<description>Wait-for-Read Mode Enable - WFR</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FEN</name>
							<description>FIFO Mode Enable - FEN</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGEN</name>
							<description>Service Request Generation Enable - SRGEN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G11RES0</name>
					<description>Group 11 Result Register 0</description>
					<addressOffset>0x3300</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion - RESULT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter - DRC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number - CHNR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting - EMUX</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source - CRS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag - VF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>G11RES1</name>
					<description>Group 11 Result Register 1</description>
					<addressOffset>0x3304</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Result of Most Recent Conversion - RESULT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRC</name>
							<description>Data Reduction Counter - DRC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CHNR</name>
							<description>Channel Number - CHNR</description>
							<bitOffset>20</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>EMUX</name>
							<description>External Multiplexer Setting - EMUX</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CRS</name>
							<description>Converted Request Source - CRS</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>VF</name>
							<description>Valid Flag - VF</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
