J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>FCFGM1</name>
					<description>Filter Configuration Register 1, Main</description>
					<addressOffset>0x210</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FIR0EN</name>
							<description>FIR0 Filter Enable - FIR0EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FIR1EN</name>
							<description>FIR1 Filter Enable - FIR1EN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OVCEN</name>
							<description>Overshoot Compensation Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FIR1DEC</name>
							<description>FIR1 Filter Decimation Rate - FIR1DEC</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CICMOD</name>
							<description>CIC Filter Mode - CICMOD</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PFEN</name>
							<description>Prefilter Enable - PFEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OCEN</name>
							<description>Offset Compensation Filter Enable - OCEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFPROT</name>
							<description>Offset Protection - OFFPROT</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FMWC</name>
							<description>Write Control for Filter Modes - FMWC</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SRGM</name>
							<description>Service Request Generation for Main Service Request - SRGM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGA</name>
							<description>Service Request Generation for Alternate Service Request - SRGA</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ESEL</name>
							<description>Event Select - ESEL</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EGT</name>
							<description>Event Gating</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CALIB</name>
							<description>Calibration Trigger - CALIB</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AUTOCAL</name>
							<description>Automatic Calibration Control - AUTOCAL</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CSRWC</name>
							<description>Write Control for Calibration and Service Request Modes - CSRWC</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FCFGC1</name>
					<description>Filter Configuration Register 1, CIC Filter</description>
					<addressOffset>0x214</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CFMDF</name>
							<description>CIC Filter Decimation Factor - CFMDF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFMSV</name>
							<description>CIC Filter Start Value - CFMSV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FCNTC1</name>
					<description>Filter Counter Register 1, CIC Filter</description>
					<addressOffset>0x218</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CFMDCNT</name>
							<description>CIC Filter Decimation Counter - CFMDCNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CAL</name>
							<description>Calibration Status Flag - CAL</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OVSCFG1</name>
					<description>Overshoot Compensation Cfg. Register 1</description>
					<addressOffset>0x21C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRFS</name>
							<description>Slew Rate Filter Strength</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRFRT</name>
							<description>Slew Rate Filter Run Time</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDM</name>
							<description>Step Detection Mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDTH</name>
							<description>Step Detection Threshold</description>
							<bitOffset>16</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IWCTR1</name>
					<description>Integration Window Control Register 1</description>
					<addressOffset>0x220</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>ISC</name>
							<description>Integrator Shift Control - ISC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IWS</name>
							<description>Integration Window Size - IWS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FRC</name>
							<description>Filter Chain Restart Control</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>REPVAL</name>
							<description>Number of Integration Cycles - REPVAL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NVALDIS</name>
							<description>Number of Values Discarded - NVALDIS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>NVALINT</name>
							<description>Number of Values to be Accumulated - NVALINT</description>
							<bitOffset>24</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IIVAL1</name>
					<description>Intermediate Integration Value</description>
					<addressOffset>0x224</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>IVAL</name>
							<description>Result of most recent accumulation - IVAL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>26</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ISTAT1</name>
					<description>Integrator Status Register 1</description>
					<addressOffset>0x228</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>NVALCNT</name>
							<description>Number of Values Counted - NVALCNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>6</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>REPCNT</name>
							<description>Integration Cycle Counter - REPCNT</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INTEN</name>
							<description>Integration Enable - INTEN</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RFC1</name>
					<description>Result FIFO Control Register 1</description>
					<addressOffset>0x22C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRLVL</name>
							<description>Service Request FIFO Level</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RDEC</name>
							<description>Read Error Flag Clear</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>WREC</name>
							<description>Write Error Flag Clear</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FIFL</name>
							<description>FIFO Flush</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FILL</name>
							<description>FIFO Fill Level</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RDERR</name>
							<description>Read Error Flag</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>WRERR</name>
							<description>Write Error Flag</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RESM1</name>
					<description>Result Register 1 Main</description>
					<addressOffset>0x230</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULTLO</name>
							<description>Result Value Lower Part - RESULTLO</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>RESULTHI</name>
							<description>Result Value Higher Part - RESULTHI</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OFFCOMP1</name>
					<description>Offset Compensation Register 1</description>
					<addressOffset>0x238</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>OFFSET</name>
							<description>Offset Value - OFFSET</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GAINCAL1</name>
					<description>Gain Calibration Register 1</description>
					<addressOffset>0x23C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x61a81000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CALFACTOR</name>
							<description>Multiplication Factor for Gain Calibration - CALFACTOR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CALTARGET</name>
							<description>Target Value for Calibrated Fullscale - CALTARGET</description>
							<bitOffset>16</bitOffset>
							<bitWidth>15</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GAINCTR1</name>
					<description>Gain Control Register 1</description>
					<addressOffset>0x240</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>GAINFACTOR</name>
							<description>Multiplication Factor for Gain Correction During Calibration - GAINFACTOR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CICSHIFT</name>
							<description>Position of the CIC Filter Output Shifter During Calibration - CICSHIFT</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CICDEC</name>
							<description>Decimation Rate of the CIC Filter During Calibration - CICDEC</description>
							<bitOffset>24</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GAINCORR1</name>
					<description>Gain Correction Register 1</description>
					<addressOffset>0x244</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>GAINFACTOR</name>
							<description>Multiplication Factor for Gain Correction - GAINFACTOR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CICSHIFT</name>
							<description>Position of the CIC Filter Output Shifter</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSTMP1</name>
					<description>Time-Stamp Register 1</description>
					<addressOffset>0x250</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIMESTAMP</name>
							<description>The Most Recent Captured Timestamp Value - TIMESTAMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AMX</name>
							<description>Analog Multiplexer Setting - AMX</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TSVAL</name>
							<description>Timestamp Valid - TSVAL</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSCNT1</name>
					<description>Time-Stamp Counter 1</description>
					<addressOffset>0x254</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TSCOUNT</name>
							<description>Timestamp Counter Value - TSCOUNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TSCLK</name>
							<description>Timestamp Counter Clock Selection - TSCLK</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TSCRUN</name>
							<description>Timestamp Counter Run Control - TSCRUN</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AMXCOPY</name>
							<description>Analog MUX Setting Copy Enable - AMXCOPY</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FCFGA1</name>
					<description>Auxiliary Filter Configuration Register 1</description>
					<addressOffset>0x270</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CFAEN</name>
							<description>CIC Filter (Auxiliary) Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFADF</name>
							<description>CIC Filter (Auxiliary) Decimation Factor</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFACNT</name>
							<description>CIC Filter (Auxiliary) Decimation Counter</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BOUNDSEL1</name>
					<description>Boundary Select Register 1</description>
					<addressOffset>0x278</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BOUNDARYL</name>
							<description>Lower Boundary Value for Limit Checking - BOUNDARYL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BOUNDARYU</name>
							<description>Upper Boundary Value for Limit Checking - BOUNDARYU</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RESA1</name>
					<description>Result Register 1 Auxiliary</description>
					<addressOffset>0x280</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Most Recent Result of Auxiliary Filter</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CGSYNC1</name>
					<description>Carrier Generator Synchronization Reg. 1</description>
					<addressOffset>0x2A0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SDCOUNT</name>
							<description>Sign Delay Counter - SDCOUNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SDCAP</name>
							<description>Sign Delay Capture Value - SDCAP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SDPOS</name>
							<description>Sign Delay Value for Positive Halfwave - SDPOS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDNEG</name>
							<description>Sign Delay Value for Negative Halfwave - SDNEG</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RECTCFG1</name>
					<description>Rectification Configuration Register 1</description>
					<addressOffset>0x2A8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x80000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RFEN</name>
							<description>Rectification Enable - RFEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SSRC</name>
							<description>Sign Source</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SSCH</name>
							<description>Sign Source Channel</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDCVAL</name>
							<description>Valid Flag - SDCVAL</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SGNCS</name>
							<description>Selected Carrier Sign Signal - SGNCS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SGND</name>
							<description>Sign Signal Delayed - SGND</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
