J3FF-J4N/tc375-freertos/tc37x-pac/TC37X-IFX.svd
				<register>
					<name>GAINCORR2</name>
					<description>Gain Correction Register 2</description>
					<addressOffset>0x344</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x1000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>GAINFACTOR</name>
							<description>Multiplication Factor for Gain Correction - GAINFACTOR</description>
							<bitOffset>0</bitOffset>
							<bitWidth>13</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CICSHIFT</name>
							<description>Position of the CIC Filter Output Shifter</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSTMP2</name>
					<description>Time-Stamp Register 2</description>
					<addressOffset>0x350</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TIMESTAMP</name>
							<description>The Most Recent Captured Timestamp Value - TIMESTAMP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>AMX</name>
							<description>Analog Multiplexer Setting - AMX</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TSVAL</name>
							<description>Timestamp Valid - TSVAL</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TSCNT2</name>
					<description>Time-Stamp Counter 2</description>
					<addressOffset>0x354</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>TSCOUNT</name>
							<description>Timestamp Counter Value - TSCOUNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>TSCLK</name>
							<description>Timestamp Counter Clock Selection - TSCLK</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TSCRUN</name>
							<description>Timestamp Counter Run Control - TSCRUN</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>AMXCOPY</name>
							<description>Analog MUX Setting Copy Enable - AMXCOPY</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FCFGA2</name>
					<description>Auxiliary Filter Configuration Register 2</description>
					<addressOffset>0x370</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CFAEN</name>
							<description>CIC Filter (Auxiliary) Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFADF</name>
							<description>CIC Filter (Auxiliary) Decimation Factor</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFACNT</name>
							<description>CIC Filter (Auxiliary) Decimation Counter</description>
							<bitOffset>16</bitOffset>
							<bitWidth>5</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BOUNDSEL2</name>
					<description>Boundary Select Register 2</description>
					<addressOffset>0x378</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>BOUNDARYL</name>
							<description>Lower Boundary Value for Limit Checking - BOUNDARYL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>BOUNDARYU</name>
							<description>Upper Boundary Value for Limit Checking - BOUNDARYU</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RESA2</name>
					<description>Result Register 2 Auxiliary</description>
					<addressOffset>0x380</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RESULT</name>
							<description>Most Recent Result of Auxiliary Filter</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CGSYNC2</name>
					<description>Carrier Generator Synchronization Reg. 2</description>
					<addressOffset>0x3A0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SDCOUNT</name>
							<description>Sign Delay Counter - SDCOUNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SDCAP</name>
							<description>Sign Delay Capture Value - SDCAP</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SDPOS</name>
							<description>Sign Delay Value for Positive Halfwave - SDPOS</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDNEG</name>
							<description>Sign Delay Value for Negative Halfwave - SDNEG</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RECTCFG2</name>
					<description>Rectification Configuration Register 2</description>
					<addressOffset>0x3A8</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x80000000</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>RFEN</name>
							<description>Rectification Enable - RFEN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SSRC</name>
							<description>Sign Source</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SSCH</name>
							<description>Sign Source Channel</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDCVAL</name>
							<description>Valid Flag - SDCVAL</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SGNCS</name>
							<description>Selected Carrier Sign Signal - SGNCS</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SGND</name>
							<description>Sign Signal Delayed - SGND</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>VCM2</name>
					<description>Common Mode Voltage Register 2</description>
					<addressOffset>0x3B0</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>VREFXSEL</name>
							<description>Fractional Reference Voltage Selection - VREFXSEL</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>VXON</name>
							<description>Fractional Reference Voltage Enable - VXON</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPVC0</name>
							<description>Voltage Control of Positive Inputs 0 of CH2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPVC1</name>
							<description>Voltage Control of Positive Inputs 1 of CH2</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPVC2</name>
							<description>Voltage Control of Positive Inputs 2 of CH2</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INPVC3</name>
							<description>Voltage Control of Positive Inputs 3 of CH2</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INNVC0</name>
							<description>Voltage Control of Negative Inputs 0 of CH2</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INNVC1</name>
							<description>Voltage Control of Negative Inputs 1 of CH2</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INNVC2</name>
							<description>Voltage Control of Negative Inputs 2 of CH2</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INNVC3</name>
							<description>Voltage Control of Negative Inputs 3 of CH2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>MODCFG3</name>
					<description>Modulator Configuration Register 3</description>
					<addressOffset>0x400</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>INCFGP</name>
							<description>Configuration of Positive Input Line - INCFGP</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INCFGN</name>
							<description>Configuration of Negative Input Line - INCFGN</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>GAINSEL</name>
							<description>Gain Select of Analog Input Path - GAINSEL</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INSEL</name>
							<description>Input Pin Selection - INSEL</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INMUX</name>
							<description>Input Multiplexer Setting - INMUX</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>INMODE</name>
							<description>Input Multiplexer Control Mode - INMODE</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INMAC</name>
							<description>Input Multiplexer Action Control - INMAC</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>INCWC</name>
							<description>Write Control for Input Parameters - INCWC</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DIVM</name>
							<description>Modulator Clock Period - DIVM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ACSD</name>
							<description>Analog Clock Synchronization Delay - ACSD</description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DITHEN</name>
							<description>Dithering Function Enable - DITHEN</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>IREN</name>
							<description>Integrator Reset Enable - IREN</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>APC</name>
							<description>Automatic Power Control - APC</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MMWC</name>
							<description>Write Control for Modulator Mode Settings - MMWC</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DICFG3</name>
					<description>Demodulator Input Config. Register 3</description>
					<addressOffset>0x408</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>DSS</name>
							<description>Data Stream Select - DSS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DSRCEX</name>
							<description>Data Source for External Modulator - DSRCEX</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CSRCEX</name>
							<description>Clock Source for External Modulator - CSRCEX</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DSWC</name>
							<description>Write Control for Data Stream Selection - DSWC</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>TRSEL</name>
							<description>Trigger Select - TRSEL</description>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ITRMODE</name>
							<description>Integrator Trigger Mode - ITRMODE</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TSTRMODE</name>
							<description>Timestamp Trigger Mode - TSTRMODE</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DRM</name>
							<description>Data Read Mode - DRM</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>TSM</name>
							<description>Time-Stamp Mode - TSM</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>RDM</name>
							<description>Result Display Mode - RDM</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>MSWC</name>
							<description>Write Control for Mode Settings - MSWC</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FCFGM3</name>
					<description>Filter Configuration Register 3, Main</description>
					<addressOffset>0x410</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>FIR0EN</name>
							<description>FIR0 Filter Enable - FIR0EN</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FIR1EN</name>
							<description>FIR1 Filter Enable - FIR1EN</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OVCEN</name>
							<description>Overshoot Compensation Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FIR1DEC</name>
							<description>FIR1 Filter Decimation Rate - FIR1DEC</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CICMOD</name>
							<description>CIC Filter Mode - CICMOD</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>PFEN</name>
							<description>Prefilter Enable - PFEN</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OCEN</name>
							<description>Offset Compensation Filter Enable - OCEN</description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFPROT</name>
							<description>Offset Protection - OFFPROT</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FMWC</name>
							<description>Write Control for Filter Modes - FMWC</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SRGM</name>
							<description>Service Request Generation for Main Service Request - SRGM</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRGA</name>
							<description>Service Request Generation for Alternate Service Request - SRGA</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>ESEL</name>
							<description>Event Select - ESEL</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>EGT</name>
							<description>Event Gating</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CALIB</name>
							<description>Calibration Trigger - CALIB</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>AUTOCAL</name>
							<description>Automatic Calibration Control - AUTOCAL</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CSRWC</name>
							<description>Write Control for Calibration and Service Request Modes - CSRWC</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FCFGC3</name>
					<description>Filter Configuration Register 3, CIC Filter</description>
					<addressOffset>0x414</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CFMDF</name>
							<description>CIC Filter Decimation Factor - CFMDF</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>CFMSV</name>
							<description>CIC Filter Start Value - CFMSV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FCNTC3</name>
					<description>Filter Counter Register 3, CIC Filter</description>
					<addressOffset>0x418</addressOffset>
					<size>32</size>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>CFMDCNT</name>
							<description>CIC Filter Decimation Counter - CFMDCNT</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>CAL</name>
							<description>Calibration Status Flag - CAL</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OVSCFG3</name>
					<description>Overshoot Compensation Cfg. Register 3</description>
					<addressOffset>0x41C</addressOffset>
					<size>32</size>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xffffffff</resetMask>
					<fields>
						<field>
							<name>SRFS</name>
							<description>Slew Rate Filter Strength</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SRFRT</name>
							<description>Slew Rate Filter Run Time</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDM</name>
							<description>Step Detection Mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>SDTH</name>
							<description>Step Detection Threshold</description>
							<bitOffset>16</bitOffset>
							<bitWidth>11</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
